{
    "status": "success",
    "totalResults": 875,
    "results": [
      {
        "article_id": "4bebecbc352888fa6427291040b43b9d",
        "title": "Today’s Biggest Pre-Market Stock Movers: 10 Top Gainers and Losers on Friday",
        "link": "https://investorplace.com/2023/12/todays-biggest-pre-market-stock-movers-10-top-gainers-and-losers-on-friday-dec-15th/",
        "keywords": [
          "Today's Market",
          "NASDAQ:ATAK",
          "NASDAQ:RIVN",
          "NYSE:GETR",
          "NASDAQ:BRSH",
          "NASDAQ:ATAKU",
          "NASDAQ:BRLI",
          "NASDAQ:SMAP",
          "NYSEMKT:IAUX",
          "NASDAQ:NCPL",
          "NASDAQ:VRPX",
          "NASDAQ:NCSM",
          "NYSE:LU",
          "NASDAQ:AADI",
          "NASDAQ:MGRX",
          "NASDAQ:INHD",
          "NASDAQ:NUBI",
          "NYSEMKT:PTN",
          "NYSEAMERICAN:DDC",
          "NYSEMKT:ADEX+",
          "NASDAQ:EOSE",
          "NASDAQ:ALRN",
          "Today's Market"
        ],
        "creator": [
          "William White"
        ],
        "video_url": null,
        "description": "InvestorPlace - Stock Market News, Stock Advice & Trading Tips It's time to dive into the biggest pre-market stock movers for Friday morning as we check out the winners and losers today! The post Today’s Biggest Pre-Market Stock Movers: 10 Top Gainers and Losers on Friday appeared first on InvestorPlace.",
        "content": "It’s time to dive into the biggest pre-market stock movers for Friday morning! Moving stocks today are earnings reports, merger plans and more. Let’s get into that news below! Biggest Pre-Market Stock Movers: 10 Top Gainers 10 Top Losers On the date of publication, William White did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines .",
        "pubDate": "2023-12-15 12:46:49",
        "image_url": null,
        "source_id": "investorplace",
        "source_priority": 3707,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      },
      {
        "article_id": "75cc42dd515f491ed0119da26dbd5367",
        "title": "Dollar Feels the Heat of Fed’s Rate Outlook",
        "link": "https://www.theepochtimes.com/business/dollar-feels-the-heat-of-feds-rate-outlook-5547587",
        "keywords": [
          "Business & Markets",
          "Business & Markets News",
          "Economic Policies",
          "Economy",
          "Inflation",
          "Stocks",
          "global",
          "Forex"
        ],
        "creator": [
          "Reuters"
        ],
        "video_url": null,
        "description": "LONDON—The dollar headed for its biggest weekly drop in five months on Friday as the prospect of rate cuts from the Federal Reserve against a tough line from central banks in Europe on monetary policy fed weekly gains in the euro and the pound. The Bank of Japan is the last of the major central […]",
        "content": "LONDON—The dollar headed for its biggest weekly drop in five months on Friday as the prospect of rate cuts from the Federal Reserve against a tough line from central banks in Europe on monetary policy fed weekly gains in the euro and the pound. The Bank of Japan is the last of the major central banks to meet this month and the question among traders and investors is whether or not the BOJ will signal its intention to ditch its policy of keeping interest rates at rock-bottom next week. In an action-packed week for central banks, traders found more clarity on when interest rate cuts were likely after Federal Reserve Chair Jerome Powell said at Wednesday's meeting that the tightening of monetary policy is likely over, with a discussion of cuts coming \"into view.\" The divergence between the U.S. and other central banks has set the dollar index on track for a near-2 percent slide this week—its largest weekly loss since mid-July—and around its lowest in four months. It was last flat on the day at 101.94. Futures markets show investors are now pricing in a 75 percent chance of a rate cut in March by the Fed, according to the CME FedWatch tool. At the start of December, there was around a 40 percent chance of a cut. Markets expect U.S. rates to fall by 150 basis points by the end of next year, double the Fed's projections that implied 75 basis points of cuts in 2024. Oil Prices on Track for First Weekly Rise in 2 Months Shares and Bonds Keep On Climbing as Fed Pivot Rally Rolls On The prospect of such a benign rate environment has ignited a rally across risk assets over the past 24 hours, at the expense of the dollar. But the mood may not last, as the U.S. economy is slowing, while inflation is still above target, analysts said. \"There was an element of surprise—the extent to which the Fed has gone with giving the market what it wants. Christmas came early,\" City Index strategist Fiona Cincotta said. Financial markets are pricing in a steep drop in rates, but not the economic pain that might come from the kind of slowdown in activity that it may take to bring core inflation back to the Fed's 2 percent target. Investors are nonetheless still betting heavily on rate cuts from both central banks next year. The ECB has more scope than most to ease, according to Pepperstone strategist Chris Weston, given low growth and a rapid decline in inflation. \"However, the pushback from (ECB President) Lagarde and co suggests conjecture on the timing of initial easing—perhaps this is a function that its desirable to keep one's currency strong to limit imported inflation.\" Preliminary readings of business activity in France and Germany on Friday showed an unexpected slowdown in the eurozone's two largest economies this month, which sent the euro down by as much as 0.4 percent to a session low of $1.0946. It was last at $1.0954, still up 2 percent this week. Sterling eased 0.2 percent to $1.2745, having surged 1.1 percent to a four-month high of $1.2793 on Thursday after the BoE's hawkish tilt. Meanwhile, the Japanese yen strengthened 0.1 percent to 141.70 per dollar, having risen 0.7 percent to a four-and-a-half month high of 140.95 on Thursday. The yen is up 2 percent this week, set for a fifth straight week of gains against the dollar, its longest such stretch since mid-2020.",
        "pubDate": "2023-12-15 12:37:29",
        "image_url": null,
        "source_id": "theepochtimes",
        "source_priority": 10731,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      },
      {
        "article_id": "d3cef187be5b6d682d6ea74936418bbe",
        "title": "eCommerce SEO audit tools",
        "link": "https://www.techrepublic.com/forums/discussions/what-software-tools-are-essential-for-ecommerce-seo-audit/#post-4204362",
        "keywords": null,
        "creator": [
          "james6543i99"
        ],
        "video_url": null,
        "description": "Essential eCommerce SEO audit tools: Google Analytics, Search Console, SEMrush, Ahrefs, Moz Pro, Screaming Frog, Yoast SEO, SpyFu, DeepCrawl, Majestic.",
        "content": "Tags: Hello, TechRepublic Community, I’m currently working on an eCommerce website, and I want to ensure that its SEO performance is top-notch. I’ve heard that a thorough SEO audit is crucial for achieving this goal. However, I’m not sure where to start when it comes to the software tools I should use for the audit. I’d love to hear your recommendations and insights. What software tools do you consider essential for conducting a comprehensive e-commerce SEO audit? Are there specific applications or platforms that have proven to be particularly effective in this regard? I’m particularly interested in tools that can help me with keyword research, on-page optimization, backlink analysis, and technical SEO. Also, any advice on how to use these tools effectively would be greatly appreciated. Your expertise would be invaluable in helping me kickstart this SEO audit. Thank you in advance for your suggestions and recommendations! I look forward to learning from the TechRepublic community.",
        "pubDate": "2023-12-15 12:37:13",
        "image_url": null,
        "source_id": "techrepublic",
        "source_priority": 8938,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      },
      {
        "article_id": "753b1009c600951f1da269275c9843ce",
        "title": "Abcarian: Cheney’s tell-all book shows GOP losing its principles",
        "link": "https://www.eastbaytimes.com/2023/12/15/abcarian-cheneys-tell-all-book-shows-gop-losing-its-principles/",
        "keywords": [
          "Opinion",
          "2020 Elections",
          "2024 Presidential Election",
          "Capitol Breach",
          "Donald Trump"
        ],
        "creator": [
          "Robin Abcarian"
        ],
        "video_url": null,
        "description": "She is one of the few high-profile Republicans willing to do the right thing after the 2020 election, even if ended her career.",
        "content": "You don’t read a book like former Wyoming U.S. Rep. Liz Cheney’s tell-all looking for literary pearls. You read it to find out what was going on behind the scenes in Congress after the 2020 election, as Donald Trump’s Republican sycophants and enablers schemed with him to overturn the results of a legitimate U.S. election. You read it to remember just how feckless Trump was when he was in power, and to remind yourself exactly what he is capable of should the nightmare of a second Trump term come to pass. Oh, and of course you read it because who could ever tire of revelations about former House Speaker Kevin McCarthy’s spinelessness and treachery? God, what a snake. No, strike that. Snakes actually have spines. After forcefully blaming Trump for Jan. 6, McCarthy went to Mar-a-Lago to suck up to the former president, Cheney writes in “Oath and Honor,” because he needed money. Nearly every major corporate donor had threatened to withdraw support from Republicans who voted to object to the electoral college votes. Because McCarthy’s only real political skill was fundraising, she says, he was desperate for access to Trump’s extensive lists of small-dollar donors. “In order to use those lists,” she writes, “Kevin would have to help Donald Trump cover up the stain of his assault on our democracy.” Like many who lean left politically, I have no enduring affection for the Cheney family. They oppose almost everything I support: reproductive rights, renewable energy, the Affordable Care Act, immigration reform, you name it. I was appalled by then-Vice President Dick Cheney’s warmongering and manipulation of then-President George W. Bush. And I’ve never forgotten, either, that the 2012 wedding of her gay sister, Mary. She , but her absence was downright cruel. Imagine my surprise, then, when a tear actually sprang to my eye for a moment after reading about a particularly charged moment between Liz and her father on New Year’s Day 2021. On Dec. 26, 2020, the Washington Post’s David Ignatius with a dire warning about Trump’s postelection plotting. Shortly after he lost, Trump had fired senior Defense Department officials and installed loyalists in their place, an unprecedented move by a lame-duck president. Was he stacking the military deck in order to invoke the Insurrection Act and stay in office? A delegation of senior Republicans, wrote Ignatius, should pay a visit to Trump and tell him in no uncertain terms that he’d lost. There were two problems, however, as Cheney writes. First, not enough senior Republican officials would be willing to risk Trump’s wrath, and second, it was clear that privately urging Trump to do anything against his self-interest would be futile. Father and daughter came up with a plan: Dick Cheney was a former Defense secretary, so together they would reach out to the nine other living former secretaries of Defense and ask them to sign a public letter urging a peaceful transition of power. “Efforts to involve the U.S. armed forces in solving election disputes,” , “would take us into dangerous, unlawful and unconstitutional territory.” As Liz Cheney prepared to return to Washington from Wyoming in January 2021, her father gave her a hug, and then, she wrote, “He looked at me and with steel in his voice, said, ‘Defend the republic, daughter.’ “ “I will, Dad,” she replied. “Always.” Unlike many of Cheney’s critics, I see nothing self-important or self-serving here. Liz Cheney is one of the few heroic, high-profile Republicans who were willing to do the right thing after the 2020 election, even if it meant sacrificing her job and her political prospects. Surprisingly, her book is not all grim. Early in Cheney’s first House term, she writes, the loathsome Rep. Jim Jordan of Ohio asked her to become a member of his ultra-right-wing Freedom Caucus. His pitch? “We don’t have any women and we need one.” “Tempting as this offer was,” she dryly notes, “I took a pass.” Her recollection of the debate among her colleagues about whether to kick her out of her leadership position for voting to impeach Trump is priceless. Rep. Elise Stefanik of New York wanted Cheney’s head because Stefanik’s constituents were writing letters to their local papers asking why their representative had not taken the same “principled” stand against Trump that Cheney had. (“Many of us who had known Elise since before she abandoned all principle were curious about how she had lost her sense of right and wrong,” Cheney writes.) A number of her House male colleagues simply did not appreciate Cheney’s . “Ralph Normal of South Carolina kept repeating that his problem with me was my attitude: ‘You’ve just got such a defiant attitude!’ ” (So unladylike!) Mike Kelly of Pennsylvania was hurt by Cheney’s early statement in favor of Trump’s impeachment. “It’s like playing in the biggest game of your life,” he whined, “and you see your girlfriend sitting on the opponent’s side.” Female members loudly objected. “Yeah,” Cheney said. “I’m not your girlfriend.” Related Articles On Jan. 6, 2022, one year after the attack by deeply misguided Trump supporters — for their crimes that day — there was a small ceremony and a moment of silence on the House floor. Only two Republicans showed up: Liz Cheney and her father. The following month, Cheney and Adam Kinzinger of Illinois, the two Republicans who served on the House Jan. 6 committee, were by the Republican National Committee for “participating in a Democrat-led persecution of ordinary citizens engaged in legitimate political discourse.” Cheney, as always, was unbowed. “I do not recognize those in my party who have abandoned the Constitution to embrace Donald Trump,” she responded at the time. “History will be their judge.” In her book, she reflects on the moment: “The resolution reflected a political party that had lost its principles and, frankly, seemed to be led by morons.” Sadly, it still is.",
        "pubDate": "2023-12-15 12:30:43",
        "image_url": "https://www.eastbaytimes.com/wp-content/uploads/2023/12/Capitol_Riot_Investigation_23200-1.jpg?w=1400px&strip=all",
        "source_id": "eastbaytimes",
        "source_priority": 17164,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      },
      {
        "article_id": "65d81284017fe41024eb412b148d3baf",
        "title": "Portable Solar Keeps Getting Lighter and More Compact, Fits Better In Emergency Kits",
        "link": "https://cleantechnica.com/2023/12/15/portable-solar-keeps-getting-lighter-and-more-compact-fits-better-in-emergency-kits/",
        "keywords": [
          "Batteries",
          "Clean Power",
          "Energy Storage",
          "Health",
          "Solar Energy"
        ],
        "creator": [
          "Jennifer Sensiba"
        ],
        "video_url": null,
        "description": "Over the last few years, I’ve been working on improving a portable emergency kit. The basic concept I follow is ... [continued] The post Portable Solar Keeps Getting Lighter and More Compact, Fits Better In Emergency Kits appeared first on CleanTechnica.",
        "content": "Over the last few years, I’ve been working on improving a portable emergency kit. The basic concept I follow is similar to what DHS recommends , with several days worth of food and water, plus some other odds and ends. I have a backpack for each member of the family, with extra supplies for everyone stored in adults and teenagers bags, and less in children’s bags. Everyone has some food and water, but people able to carry more have tarps, tiny tents, and supplies to share with smaller kids. Some readers may be unfamiliar with why a family should do this, so I’ll briefly explain it. In the event of a major disaster, it’s anticipated that an overwhelmed local and state government might not get sufficient amounts of federal aid to help everyone for around three days. Bungled responses like Hurricane Katrina show us that people could need basic emergency supplies for even longer if a government gets caught flat-footed enough. One thing I do in my bag is try to carry along some extra communications supplies. We probably wouldn’t need it for our family alone, but I want to be able to help other people in the event of a major disaster, too. If communications aren’t available for hundreds of miles, people could get a great sense of relief being able to let family members know that they’re OK. Or, in the worst case, it may be necessary to communicate with people hundreds of miles away just to get much-needed help. Here’s what my setup looked like to be able to do that in 2020: I had a 60-watt solar panel that folds up, a small charge controller, a small LiFePo4 battery, and would use all this to power a small laptop, a Yaesu FT-818 HF radio, and some gear to translate analog to digital. I also have a small handheld radio to put in the bag for local communications. The purpose of the HF radio is to be able to send signals over the horizon. Normally, VHF and UHF radio signals run into vegetation or mountains while stronger signals that don’t run into the earth tend to just go off into space. Anyone beyond line of sight can’t hear your signal because it simply can’t reach them. Mountaintop radio repeaters can help you extend your reach, but a major disaster might knock those out or they could end up being really crowded. But, there’s a special range of frequencies (generally between 2-30 MHz, aka High Frequency, “HF”, or “shortwave”) that can get around all of these problems with one weird trick: bouncing off the ionosphere. My little portable Yaesu radio is capable of transmitting and receiving on those frequencies. Using carefully processed digital modes, like JS8 , I can communicate around the world with as little as 1-3 watts of power. But, all of that equipment was pretty heavy still. The panel was pretty thick folded up. The battery was heavy. But, the rest of the gear wasn’t that bad. So, I’ve been experimenting with finding lighter gear over the last three years. The smallest power station I’ve come up with so far is the Gooloo GTX 280. It’s got 280 watt-hours of storage, and it has an inverter you can plug into it to power other things. It’s not very strong in output, but it’s got more than enough power for my laptop, radio, and other gear. Overall, it saved a lot of weight compared to a Jackery Explorer 300 I was trying to squeeze into the bag. Next, I needed to get the solar panel down in size and weight. 60 watts proved to be a lot more than I really needed, and the big, canvas sided cheap panel I bought from Amazon in 2020 was just too darned heavy and bulky. But, I decided to give Jackery’s smallest offering a try. I’m not doing a review of the panel here, but it suffices to say that it’s far smaller and lighter than my 60 watt panel while still producing around 35-40 watts of power. I only need 10-20 watts, so this works well for my needs. It works with any of the company’s Explorer 300 power stations, but I’ll likely use it with the Gooloo because it’s smaller and lighter. Folded up, the whole setup is a lot smaller, with the panel taking up less space than my emergency rations box. This allowed me to put the whole setup in a smaller bag that puts a lot less strain on my back. For people curious about what’s in the cardboard box, here’s a peek: To save weight and space, I use the little 3600-calorie emergency rations with a 5-year shelf life. They taste like graham crackers, and break into 400-calorie pieces. I have about 6 days worth of these rations in my bag. Add some water bottles, some toiletries, and a few other odds and ends, like a water filtration system, and I’m set up to suffer a lot less than someone who walks into the desert with just the clothes on their back. Eventually, I want to replace the cardboard box with something a little smaller, but for now it does the job of making it easy to remove the rations for times I just want to go play with the radio gear on hikes. I’m still working on ways to get this whole setup lighter and more power efficient. One thing I’m working on is replacing the whole laptop with a Raspberry Pi computer that my folding phone can connect to. This will save a ton of weight all by itself, while using less power. It can also make for easier on-the-go radio operating at some point. Next, I want to replace handheld radios we carry in our bags with Meshtastic networking nodes . These use a lot less power and can provide secure text messaging on unlicensed radio frequencies. I’m the only licenses amateur radio operator in the family, and getting people to get a license is like pulling teeth. So, coming up with a better solution that works with existing things like phones can really make a difference. So, there’s still plenty of work to be done improving the setup further! All images except the radio propagation diagram by Jennifer Sensiba. LinkedIn WhatsApp Facebook X Email Mastodon Reddit",
        "pubDate": "2023-12-15 12:30:17",
        "image_url": null,
        "source_id": "cleantechnica",
        "source_priority": 34282,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      },
      {
        "article_id": "aed86bdbcafa5273ef3d9951a0c460a4",
        "title": "Re: security and integration",
        "link": "https://www.techrepublic.com/forums/discussions/hashtag-generator-tools/#post-4204360",
        "keywords": null,
        "creator": [
          "kees_b"
        ],
        "video_url": null,
        "description": "Using Windows 11 with all updates is a good start. Increase employee awareness about what to do and what not to do is a good second step. What security programs to implement depends on the organisation and the software they run. It’s different for your local saloon or for, say, General Motors.",
        "content": "Tags: , , Hi everyone. How can organizations effectively optimize their use of Windows operating systems to enhance cybersecurity measures and ensure seamless integration with modern business applications?",
        "pubDate": "2023-12-15 12:25:54",
        "image_url": null,
        "source_id": "techrepublic",
        "source_priority": 8938,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      },
      {
        "article_id": "e1e2ff12a1e6533f64e8f199fc00da2c",
        "title": "Oil Prices on Track for First Weekly Rise in 2 Months",
        "link": "https://www.theepochtimes.com/business/oil-prices-on-track-for-first-weekly-rise-in-2-months-5547586",
        "keywords": [
          "Business & Markets",
          "Business & Markets News",
          "Economic Policies",
          "Economy",
          "Energy",
          "Gold and Commodities",
          "Stocks",
          "global",
          "Oil"
        ],
        "creator": [
          "Reuters"
        ],
        "video_url": null,
        "description": "LONDON—Oil prices rose on Friday, on track to notch their first weekly rise in two months after benefiting from a bullish forecast from the International Energy Agency (IEA) on oil demand for next year and a weaker dollar. Brent futures rose 21 cents to $76.82 a barrel at 0918 GMT. U.S. West Texas Intermediate (WTI) […]",
        "content": "LONDON—Oil prices rose on Friday, on track to notch their first weekly rise in two months after benefiting from a bullish forecast from the International Energy Agency (IEA) on oil demand for next year and a weaker dollar. Brent futures rose 21 cents to $76.82 a barrel at 0918 GMT. U.S. West Texas Intermediate (WTI) crude also climbed 21 cents, to $71.79. Both benchmarks were on course for a modest weekly gain, having been lifted by a mid-week announcement from the U.S. Federal Reserve that it could cut borrowing costs next year. The dollar fell to a four-month low on Thursday after the U.S. central bank indicated interest rate hikes have likely ended and lower borrowing costs are coming in 2024. The dollar index was broadly steady on Friday. A weaker dollar makes dollar-denominated oil cheaper for foreign purchasers. World oil consumption will rise by 1.1 million barrels per day (bpd) in 2024, the IEA said in a monthly report, up 130,000 bpd from its previous forecast, citing an improvement in the outlook for U.S. demand and lower oil prices. US Retail Investors Sold Stocks at Fastest Pace Since 2021 Despite Market Rally: S&P Global Stock Market Today: Wall Street Rises Again as the Dow Ticks to Another Record The 2024 estimate is less than half of the Organization of the Petroleum Exporting Countries' (OPEC) demand growth forecast of 2.25 million bpd. \"OPEC+ production cuts are likely to keep the oil market in balance at the start of 2024 despite weaker demand, which should allay current oversupply concerns,\" Commerzbank said. OPEC+, which groups OPEC and allies led by Russia, in late November agreed voluntary cuts of about 2.2 million bpd lasting throughout the first quarter. Weak economic data from Germany, Europe's biggest economy, and China, the world's biggest oil importer, weighed on prices, however. The HCOB German Flash Composite Purchasing Managers' Index (PMI), compiled by S&P Global, fell for the sixth consecutive month, declining to 46.7 in December from November's 47.8, below the 48.2 forecast by economists. Data released by China's statistics bureau on Friday showed refinery runs in November dropped to their lowest level since the start of 2023, as margin pressure on non-state owned refiners saw them cut back production, while sluggish diesel consumption weighed on national fuel demand. Despite ongoing woes in China's property market, the data also showed a better-than-expected performance in industrial output and improving retail sales, lending some relief to market sentiment amid the country's anaemic post-COVID economic recovery.",
        "pubDate": "2023-12-15 12:18:56",
        "image_url": null,
        "source_id": "theepochtimes",
        "source_priority": 10731,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      },
      {
        "article_id": "47dbe7acfd21c127821534bd28347468",
        "title": "Former Facebook executive pleads guilty to stealing $4 million from company",
        "link": "https://www.eastbaytimes.com/2023/12/15/former-facebook-executive-pleads-guilty-to-stealing-4-million-from-company/",
        "keywords": [
          "Business",
          "California News",
          "Crime and Public Safety",
          "Latest Headlines",
          "National News",
          "News",
          "Technology",
          "Crime",
          "Facebook - Meta",
          "Morning Wire"
        ],
        "creator": [
          "Cnn Com Wire Service"
        ],
        "video_url": null,
        "description": "According to the US Attorney, Barbara Furlow-Smiles used her Facebook expense account to live a luxurious lifestyle in California and Georgia.",
        "content": "An Atlanta woman pleaded guilty to stealing more than $4 million from Facebook while she was an executive at the company. Barbara Furlow-Smiles who worked as a lead strategist, global head of employee resource groups and diversity engagement at Facebook, Inc., now known as Meta, from about January 2017 to September 2021 according to U.S. Attorney Northern District of Georgia Ryan K. Buchanan’s Office. “This defendant abused a position of trust as a global diversity executive for Facebook to defraud the company of millions of dollars, ignoring the insidious consequences of undermining the importance of her DEI mission,” said Buchanan in a statement. According to the US Attorney, Furlow-Smiles used her Facebook expense account to live a luxurious lifestyle in California and Georgia. Furlow-Smiles fraudulently used Facebook funds to pay for numerous personal expenses including hair stylists, babysitters, and $18,000 to a preschool for tuition, according to Buchanan. Furlow-Smiles’ “scheme” was to link her company credit cards to PayPal, Venmo, and Cash App, then use those cards to pay others for services never performed, Buchanan says. Related Articles Friends, relatives, and associates who received the payments would then return some of the money to Furlow-Smiles as a kickback, according to Buchanan’s Office. Investigators say Furlow-Smiles would create inflated invoices to pay them, then those vendors would return a portion of the payment to Furlow-Smiles. Buchanan adds, “She even involved relatives, friends, and other associates in her crimes, all to fund a lavish lifestyle through fraud rather than hard and honest work.” Sentencing for Barbara Furlow-Smiles is scheduled for March 19, 2024. The-CNN-Wire™ & © 2023 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.",
        "pubDate": "2023-12-15 12:18:15",
        "image_url": "https://www.eastbaytimes.com/wp-content/uploads/2023/12/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbHE1cDk3MXYwMDA0M2I2aHRvaHVrZnl0-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NscTVvaHFubzAwMWsyNnFxZmhtemRnZjQ.jpg?w=1400px&strip=all",
        "source_id": "eastbaytimes",
        "source_priority": 17164,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      },
      {
        "article_id": "990a0ff9dce6876c25acc0f2151fdbfe",
        "title": "Tech Trends 2024: What’s Your Bold Prediction?",
        "link": "https://www.techrepublic.com/forums/discussions/tech-trends-2024-whats-your-bold-prediction/#post-4204357",
        "keywords": null,
        "creator": [
          "minvancemyer"
        ],
        "video_url": null,
        "description": "Predicting tech trends is always an exciting challenge, given the rapid pace of innovation. Here’s a bold prediction for tech trends in 2024: AI-Driven Personalized Virtual Experiences As we advance further into the digital age, artificial intelligence (AI) will play a pivotal role in shaping personalized virtual experiences for individuals across various domains. Virtual Personal Assistants Evolve: AI-driven virtual personal assistants will become even more sophisticated, anticipating user needs and preferences. These assistants will seamlessly integrate into daily life, managing tasks, schedules, and interactions with unprecedented levels of customization. Immersive Virtual Reality (VR) and Augmented Reality (AR) Experiences: VR and AR technologies will transcend current limitations, offering immersive experiences that blend seamlessly with the physical world. From enhanced gaming environments to practical applications in education, healthcare, and remote work, these technologies will redefine how we perceive and interact with our surroundings. AI-Curated Content: AI algorithms will take content curation to the next level, tailoring digital content such as news, entertainment, and social media feeds to individual preferences. This level of personalization will not only enhance user engagement but also challenge traditional notions of information consumption. Health Tech Revolution: The intersection of AI and healthcare will lead to revolutionary advancements. Personalized treatment plans, AI-assisted diagnostics, and predictive healthcare analytics will become commonplace, contributing to more effective and individualized patient care. Blockchain Integration in Everyday Life: Blockchain technology will extend beyond cryptocurrencies, finding applications in various industries. From secure, transparent supply chains to decentralized identity verification, the integration of blockchain will foster trust and efficiency in everyday transactions. Green Tech and Sustainability Solutions: Tech innovations will increasingly focus on sustainability. Smart cities powered by renewable energy, AI-driven environmental monitoring, and innovations in clean energy technology will contribute to a more sustainable future. Neurotechnology Breakthroughs: Advancements in neurotechnology will open new possibilities in brain-machine interfaces, enhancing communication between humans and machines. This could lead to breakthroughs in assistive",
        "content": "Tags: , , Hello Tech Enthusiasts! 👋 As we step into a new year, I’m curious to hear your bold predictions for tech trends in 2023. What innovations do you think will dominate the industry? Are there emerging technologies that you believe will reshape the way we live and work? Whether it’s AI, cybersecurity, blockchain, or any other exciting field, share your thoughts and let’s discuss the future of technology together. Feel free to back up your predictions with insights or trends you’ve observed. Let’s make some tech forecasts and see where the conversation takes us! 🚀💻",
        "pubDate": "2023-12-15 12:17:01",
        "image_url": null,
        "source_id": "techrepublic",
        "source_priority": 8938,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      },
      {
        "article_id": "14244c87cfcae200d6497db69db1a747",
        "title": "enhance cybersecurity measures",
        "link": "https://www.techrepublic.com/forums/discussions/hashtag-generator-tools/#post-4204356",
        "keywords": null,
        "creator": [
          "Hashtag MArk"
        ],
        "video_url": null,
        "description": "Hi everyone. How can organizations effectively optimize their use of Windows operating systems to enhance cybersecurity measures and ensure seamless integration with modern business applications?",
        "content": "Tags: , , Hi everyone. How can organizations effectively optimize their use of Windows operating systems to enhance cybersecurity measures and ensure seamless integration with modern business applications?",
        "pubDate": "2023-12-15 12:15:26",
        "image_url": null,
        "source_id": "techrepublic",
        "source_priority": 8938,
        "country": [
          "united states of america"
        ],
        "category": [
          "business"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702642526805052663"
  }