{
    "status": "success",
    "totalResults": 2409,
    "results": [
      {
        "article_id": "1ee1ebadf741939c05dc86d99d6ad1ef",
        "title": "‘We Dare to Dream’ Director Waad Al-Kateab and Producer Angelina Jolie Discuss Impact of Olympic Refugee Doc as Eurosport Acquires Streaming Rights (EXCLUSIVE)",
        "link": "https://variety.com/2023/awards/global/we-dare-to-dream-doc-angelina-jolie-waad-al-kateab-eurosport-1235840697/",
        "keywords": [
          "Awards",
          "Global",
          "News",
          "Angelina Jolie",
          "Waad al-Kateab",
          "We Dare to Dream"
        ],
        "creator": [
          "Nvivarelli"
        ],
        "video_url": null,
        "description": "Discovery-owned Eurosport has acquired streaming rights in 54 countries to Olympic refugee documentary “We Dare to Dream” by Waad Al-Kateab, the Oscar-nominated Syrian director of “For Sama.” “We Dare to Dream” is the story of the refugee Olympic team that competed at the 2020 games in Tokyo, which featured stateless athletes from Iran, Syria, South Sudan […]",
        "content": "Discovery-owned Eurosport has acquired streaming rights in 54 countries to Olympic refugee documentary “ We Dare to Dream ” by Waad Al-Kateab, the Oscar-nominated Syrian director of “For Sama.” “We Dare to Dream” is the story of the refugee Olympic team that competed at the 2020 games in Tokyo, which featured stateless athletes from Iran, Syria, South Sudan and Cameroon who swim, run and fight their way to safety in host nations across the world. It’s told through the personal prism of Al-Kateab while she is coming to terms with the reality that she can never return to Aleppo, where she shot “For Sama.” The doc premiered at the Tribeca Film Festival in June and had an Oscar-qualifying theatrical run at New York City’s IFC Center in October. After the doc premiered at Tribeca, Angelina Jolie joined “We Dare to Dream” as an executive producer to help with its Oscar push. Five months later, John Legend also signed on to exec produce with his Get Lifted Film banner co-founders Mike Jackson and Ty Stiklorious. Legend also wrote, composed and performed an original song for the doc, titled “Don’t Need to Sleep.” Peacock acquired U.S. rights to “We Dare to Dream” earlier this month. Peacock and NBC are official U.S. broadcasters of the Olympics, while Eurosport is home of the Olympic Games in Europe. Besides Eurosport play across Europe and beyond – the deal also includes some non-EU territories such as Turkey, Ukraine and Uzbekistan – streaming availability of “We Dare to Dream” will now also comprise Discovery+ in Austria, Denmark, Finland, Germany, Italy, Sweden, the Netherlands, Norway, the United Kingdom and Ireland. “I’m so grateful to Eurosport for bringing this film to 54 countries across the world,” said Al-Kateab in a statement. “I hope people will now be able to understand how the world’s refugees, like me, are not the crisis but rather a result of several global crises from political violence to climate change that are making millions of refugees, like me, face unimaginable challenges.” In her conversation with Jolie about “We Dare to Dream,” Al-Kateab notes that “the sports element is very important in the film; but it’s not about that. Even being refugees themselves, it was very important and played a big part, but [it] wasn’t about that at all. I think for me – what I really wanted people to take away from the film – is what comes after? What’s going to happen to these people after this experience?” Jolie said that “what brings displaced people together is so different and so extraordinary” and points out that there are “110 million people in the world that understand what it is to be forced from their homeland and to live displaced.” She continued, “I was very moved when I realized there was a refugee Olympic team, because to me it is a country in many ways.” Watch the full conversation below.",
        "pubDate": "2023-12-15 13:11:30",
        "image_url": "https://variety.com/wp-content/uploads/2023/12/We-Dare-to-Dream-2.jpg",
        "source_id": "variety",
        "source_priority": 186,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "021a05509793c8f3d30b65a734c414a4",
        "title": "The TODAY anchors reveal their Spotify Christmas playlists",
        "link": "https://www.today.com/popculture/music/spotify-christmas-playlists-today-anchors-rcna129494",
        "keywords": null,
        "creator": [
          "Anna Kaplan"
        ],
        "video_url": null,
        "description": "The anchors of the TODAY show revealed what songs are on their Spotify Christmas playlists this year.",
        "content": "Looking for some new holiday tunes? The TODAY anchors have you covered. TODAY anchors Savannah Guthrie, Hoda Kotb, Al Roker, Craig Melvin, Carson Daly, Sheinelle Jones, Dylan Dreyer and Jenna Bush Hager created their own holiday playlists on Spotify, meaning you're sure to find new gems amongst the classics across their eight handcrafted playlists. Check out all of their recommendations for rocking around the Christmas tree below, and visit TODAY's profile on Spotify . Savannah's playlist is the longest of the bunch, and features a mix of old and new favorites with songs from Ariana Grande to Bon Jovi (plus two songs by Celine Dion). Of course Hoda's first track is her holiday song she created with TODAY's own Jenna Bush Hager, \"Carefree Christmas.\" Hoda completed her playlist with selections from Jackson 5, Frank Sinatra, Donny Hathaway and more. Al picked out all the classics for his playlist — you just can't go wrong with \"All I Want for Christmas Is You\" and \"Linus and Lucy.\" Craig starts his playlist with his favorite Christmas song , \"Silent Night\" by The Temptations. His second favorite, Donny Hathaway's \"This Christmas,\" comes in at No. 3 on his playlist, and he rounds it out with a pick from Boys II Men. TODAY's resident musical expert Carson Daly picked 13 songs for his playlist, which features many holiday classics covered by current and former coaches on \"The Voice,\" like Blake Shelton, Reba McEntire, CeeLo Green and more. For those participating in Whamageddon : avoid Sheinelle's playlist. But picks from Faith Hill, Whitney Houston and more make hers pretty irresistible. Dylan topped her playlist with her own favorite holiday song , \"Christmas (Baby Please Come Home)\" by U2, while tracks from Bruce Springsteen, Mavis Staples and Run-DMC follow. Jenna also gave some love to \"Carefree Christmas,\" her holiday duet with Hoda , as well as picking out favorites from Justin Bieber, Carrie Underwood, Madonna and The Pogues, whose frontman, Shane MacGowan, died at 65 last month .",
        "pubDate": "2023-12-15 13:03:32",
        "image_url": "https://media-cldnry.s-nbcnews.com/image/upload/t_fit_1500w/rockcms/2023-12/today-anchors-2022-one-word-mc-1x1-4proxy-16c931.jpg",
        "source_id": "nbcnews",
        "source_priority": 175,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "af7d5935a5b5cbcd748924ad4366cb79",
        "title": "10 Essentials for the Perfect Capsule Winter Wardrobe in2024",
        "link": "https://www.vogue.com/article/winter-capsule-wardrobe",
        "keywords": [
          "Shopping",
          "Shopping / Fashion"
        ],
        "creator": [
          "Laura Jackson"
        ],
        "video_url": null,
        "description": "Fabulous faux furs, notable knitwear, and stompy lug-sole boots round out our list of capsule winter wardrobe pieces. Shop our must-haves now.",
        "content": "You can always count on an assortment of staples to put together a reliable uniform look. That’s the thing about everyday pieces, they can be worn with just about everything in your closet. When it comes to a capsule winter wardrobe, the same rules apply, though the are a bit different–more suited to braving strong winds and freezing temperatures. Capsule Winter Wardrobe Wishlist: A roster of versatile sweaters and foundational layering pieces like a turtleneck is key for cold days. And like your pleated trousers for spring and fall, a pair of tailored pants made from warmer materials (think: wool) will be your new go-to. You’ll also want to have a that can extend itself into many outfits, think: a great for a soirée and a snow day, plus that can comfortably sit atop even your heaviest layering. Our favorites include fabulous from Toteme and The Frankie Shop for instant chic, plus glossy From Tory Burch and The North Face that transition from the streets to the slopes seamlessly. Après-ski-approved from Leset and Uniqlo are easy yet elegant, whether tucked into a winter boot or worn underneath a baggy pair of corduroys as an extra base. We can’t forget about those classic winter accessories, either, like a chic leather glove from Banana Republic or Loewe’s fringed mohair . Did we also mention that either of these also make a this holiday season? Complete your capsule winter wardrobe with our guide to winter’s must-have style essentials, below. Fabulous Faux Fur Coats This winter’s ultimate is undoubtedly the fabulous faux fur coat, worn adoringly by both fashion girls and editors alike. Options from Toteme and H&M are true-to-the-classics, while belted faux furs from The Frankie Shop and Mackage offer up a cinched-waist silhouette that brings definition to an otherwise voluminous silhouette. Warming Winter Dresses A casual knit or wool is a one-and-done piece that makes everyday winter dressing effortless. Opt for Mango’s turtleneck dress or Toteme’s flannel frock, both of which go from commute-to-cocktail all too chicly. For more of a splurge, consider Khaite’s festive Fair Isle find or even Proenza Schouler’s striped style. Festive Fair Isle Sweaters The is never not in style. Khaite’s button-up cardigan is snuggly as it stylish, while Gap’s funnel-neck find is a great . With a pop of cherry red, Polo Ralph Lauren’s crewneck is sure to brighten up any winter blues, while &Daughter’s cardigan is a must-have. Puffer Jackets Padded-to-perfection, blanket-like puffer jackets from Banana Republic, Moncler, and The North Face are sure to fit your every winter dressing need. The latter is especially beloved by celebs and for its generously-sized, extra-warm design. Also on our winter wish list is Tory Burch’s bright red puffer, which comes complete with a glossy finish to standout on the slopes or the city streets. Cozy, Chic Corduroys A slouchy pair of is not only cozy, but super chic, too. Dark brown pairs from Agolde and Dries Van Noten can transition seamlessly from work to weekend, while options from J.Crew and Everlane will appeal to the trend-curious shopping on a budget. Stompy Lug-Sole Boots Beloved for its toothy rubber sole, the is ideal for navigating inclement weather. And while it does have roots in functionality, that doesn’t mean lug-soles aren’t great for everyday wear or even special occasions, say with a tailored trouser or knit dress. Highlights include Chloé’s shearling-lined pair, The Row’s zip boot—an editor favorite—and Ganni’s waterproof ankle bootie. Heavyweight Wool Trousers The pleated tailored trouser is still a wonderful option for the winter months, as it wears well with and sweaters. We recommend, however, styles in heavier and warmer fabrics like cozy flannels or brushed wool to keep the cold air out. Après-Ski-Approved Leggings A sleek pair of is a foundational layering essential in any . Classic ankle-grazing pairs from Toteme and Uniqlo are après-ski-approved, while Leset’s stirrup style is effortlessly cool for the workplace. We can’t forget about Nili Lotan’s cashmere leggings either, a stylishly warm staple. Slim-Fitting Turtlenecks Don’t start an outfit without one. A close-fitting soft cotton jersey or cashmere blend turtleneck will ensure a warm base with a stylish layering component underneath a . The Accessories Station No capsule winter wardrobe would be complete without a (or two…or three). You’ll find us slipping into Banana Republic’s burgundy leather gloves during the week, then Rag & Bone’s printed mittens on holiday. Complete your look with Loewe’s viral mohair-blend scarf and a chic cashmere beanie from Johnstons of Elgin.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://assets.vogue.com/photos/657b6b68f4f0d47ed9fe7e4a/master/pass/Toteme%201.jpeg",
        "source_id": "vogue",
        "source_priority": 4162,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "2fba36f6b94439efb2fb387e39c3bb61",
        "title": "36 Thoughts I Had While Rewatching Lifetime’s ‘William and Kate’",
        "link": "https://www.vogue.com/article/rewatching-william-and-kate-on-lifetime-36-thoughts-i-had",
        "keywords": [
          "Culture / Opinion",
          "Culture / TV & Movies"
        ],
        "creator": [
          "Emma Specter"
        ],
        "video_url": null,
        "description": "Hunting, then church? God, I would not be good as a royal consort.",
        "content": "The love story of “William Wales” (a.k.a. Prince William) and Kate Middleton hit Netflix this week via the final installment of Peter Morgan’s , but if you’re in the market for an even schlockier, more made-for-TV version of that royal romance, you’re in luck. , the Lifetime movie starring Nico Evers-Swendell and Camilla Luddington, is currently available to stream on . In order to determine who wore it best, royal-biopic-wise, I rewatched the Lifetime film…and boy, am I glad I did. Below, find all the thoughts I had while revisiting :",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://assets.vogue.com/photos/657bb33a476d8287662eab27/master/pass/GettyImages-808934178.jpg",
        "source_id": "vogue",
        "source_priority": 4162,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "b74a9b539cf708e656c76af4bd8759e9",
        "title": "The Best Memes of 2023",
        "link": "https://www.vogue.com/article/best-memes-of-2023-so-far",
        "keywords": [
          "Culture"
        ],
        "creator": [
          "Abrigail Williams"
        ],
        "video_url": null,
        "description": "Considering how fast-paced the world of social media can be, you’d be forgiven for not remembering every viral tweet or trend that had you chuckling this year. To help jog your memory, we’ve rounded up the best memes of 2023.",
        "content": "Another rotation around the sun means another year stacked with memes. But considering how fast-paced the world of social media can be, you’d be forgiven for not remembering viral tweet or trend that had you chuckling under the covers at odd hours of the morning this year. So, to help jog your memory, has rounded up the best memes of 2023. Whether you’re here to relive the glory days of the Barbenheimer phenomenon or experience another level of second-hand cringe at the words follow along as we unveil the best memes of the year. Gag City What’s Gag City, you ask? Ahead of releasing , tweeted a captioned “Approaching Gag City.” Quick to respond (and start a new meme), the Barbz conjured images of the rose-tinted metropolis using AI—even going so far as to assign political leadership to it (with Minaj, of course, the leader). Pingu Dead-Staring to Mozart The likes of Mozart and Beethoven could not have possibly imagined their compositions backing silly little videos of animated penguins on billions of phones across the world. The thought makes it all the funnier when I see Pingu, a kids’ show character, staring wide-eyed as Mozart’s “Lacrimosa” plays. HUH Cat Who doesn’t love a cat meme? When you don’t understand something, or just can’t hear the person talking to you and need them to repeat themselves for the third time in a row, referencing the “HUH?” cat will get your point across. I’m Just a Girl To clarify, no, this is not a play on Julia Roberts’s monologue. “I’m just a girl” emerged as a reaction to the crushing burdens of modern womanhood, justifying a certain kind of indulgence. Why are you tired between 3 and 5 p.m.? Why do you deserve a coffee and sweet treat in the middle of the day,? Because you’re just a girl trying to make it all work. Squirtle Playing the Saxophone That’s it! That’s the meme. It’s a Pokémon with sunglasses, blowing away on the saxophone to the tune of “Run Away” by SunStroke Project. The mirrors a of “Epic Sax Guy” doing the same, and it’s just a mood. Who’s That Wonderful Girl? Could She Be Any Cuter? Thank you to whoever started this meme for forcing me to listen to some positive affirmations. The viral clip comes from , an old Canadian children’s show. DJ Khalid Says the Darndest Things Call me Tiger Woods, because I’m about to drive this point home: I’ve been reprimanded far too many times for saying “LET’S GO GOLFING” in the tone of DJ Khalid, and it’s all because of this internet meme. Someone out there thought it was a good idea to “bring out the whole ocean” of DJ Khalid’s most out-of-pocket, out-of-context sayings, and the result is perfect: Usher, EryKah Badu, and Quavo Front Row at Marni What’s better than one star’s masterclass in fashion-week dressing? A group serve. The three performers were front row at Marni’s spring 2024 show in head-turning ’fits—and once the images hit the web, they immediately took off. Vince McMahon Tearing Up Not much needs to be said about this meme except it’s too real. The clip comes from a documentary in which former WWE CEO Vince McMahon is asked how much wrestling champion The Undertaker meant to him. Overwhelmed with emotion, McMahon motions to cut the cameras. Online, users coopted the moment for their own objects of nostalgic longing. Josh Hutcherson Rick Rolls the Internet Move over, Rick Astley, because Gen-Z Netizens have officially dubbed this of Josh Hutcherson the modern Rickroll. As a die-hard fan who witnessed the birth of videos like these in real time (#TeamPeeta), it’s no surprise a piece of fan history has reclaimed its rightful place at the forefront of internet virality. AI Cartoons Characters in Their Feelings Social media users have found all kinds of creative uses for artificial intelligence. What began—controversially—with some using AI to make their favorite artists sing songs from other musicians (or even rap original music), the internet has moved on to depicting their favorite cartoon characters in their feelings, at the top of their game, or simply balling out. This Stock Photo of Kevin James Caption a photo of Kevin James dressed as his character from , looking sheepishly at the camera with his hands in his pockets, and you have yourself a viral meme. Video of Jeremy Allen White Since became a hit, many started pulling clips of from his days. One went viral simply for the off-centered stare White gives the camera. Cats at the Met Gala The Met Gala always attracts attention online, as people breathlessly check how their favorite stars interpreted the theme. At this year’s event, Doja Cat and Lil Nas X seemed to take the cake with their glittery feline ensembles. Ariana DeBose at the BAFTAs The star’s monologue-rap at the BAFTAs sparked a number of cringe-filled reactions, but one thing viewers couldn’t seem to forget was the vague lyric “Angela Bassett did the thing.” Dylan Sprouse and Barbara Palvin Marry When photos of went viral online, users congratulated the couple in a funny, nostalgic way, citing Sprouse’s days promoting the when he was a Disney Channel star. All Gen-Z kids can remember trying—and failing—to win. When Everyone Started Dissecting the Physics of A lot of hilarious internet discourse ensues when one user poses a question that goes absolutely viral. In this case, it was when @KevOnStage , “What was the moment Fast and Furious abandoned reality.” The internet had a lot to say—and a lot of content to work with, since the franchise is at 10 films and counting. Taylor Swift Fans Take Ticketmaster Down “Ticketmaster-gate” will go down in history as the time Swifties toppled Ticketmaster; fans sued the company after they were unable to buy tickets to Swift’s Eras Tour. The fracas garnered a from Taylor Swift herself, and not only resulted in a lawsuit but also . Breaks the Internet Shoutout to ’s marketing team for their master class in social media mayhem ahead of the film’s July release. For a period of time, you couldn’t go online without seeing something related to the bleach-blonde doll; from memes like “Hi Barbie” to “She’s everything, he’s just Ken,” ’s relevance lasted years in internet terms. When posters for the film were first revealed, the internet wasted no time casting their own favs into the mix. After fans learned that and would be released on the same day, they joked about watching the two back to back, citing the humorously stark contrast between the rose-colored feel-good film and serious historical biopic. Then fans then started comparing Barbenheimer to with seemingly opposite vibes. One ticket to and anyone? Even Margot Robbie and Cillian Murphy seemed to get in on the fun… fans also meme-d about the funny character dynamics in the film, specifically between Barbie, with her capacity to be and do everything, and…Ken. This format went viral, too: Twitter Is Now “X” When Elon Musk announced Twitter’s rebrand to “X,” many users weren’t happy, clowning on the change that no one signed up for. Astro Boy Boots Is this where the trend started? Once the internet caught wind of these cartoonish red boots from MSCHF, the memes sort of wrote themselves. Stop Normalizing the Grind… Romanticizing anything that resembled the quiet life—a cozy-girl mentality, a sleepy woodland animal—became a trend. Because, frankly, there something beautifully aspirational about a picture of Winnie the Pooh wrapped up in a blanket drinking tea. Iterations of the meme also come in the form of “the sexual tension between me and [insert cozy activity here],” and “the feminine urge to…” Honk Shoo-ing In the vein of romanticizing coziness, the vibe of the SleepyTime Tea Bear became universally coveted this year. “Honk shoo,” the sound a fictional bear might make while passed out in an armchair, appeared in almost every tweet that described emulating the tea bear’s sensibility. Some even took it a step further, and tried to “steal his look”—making outfit breakdowns a part of the meme too. Pedro Pascal and Nicholas Cage This clip from went viral, as social media users latched on to Pedro Pascal’s wholesome demeanor and Nicholas Cage’s outrageous stare. They’re Playing Football During a Rihanna Concert Considering Rihanna’s Super Bowl Halftime show was the halftime performance of all time, it’s not a surprise that the internet was in a frenzy before, during, and after what people jokingly called a Rihanna concert…with some football.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://assets.vogue.com/photos/65493f0e65d0f178a0071558/master/pass/GettyImages-1584249148.jpg",
        "source_id": "vogue",
        "source_priority": 4162,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "1dc8864f47d75e5c26edd9d2718de557",
        "title": "Hugh Grant's best performances, ranked from least to most unhinged",
        "link": "https://www.avclub.com/hugh-grant-performances-roles-ranked-1851101308",
        "keywords": [
          "hugh grant",
          "unhinged",
          "four weddings and a funeral",
          "jane austen",
          "notting hill",
          "entertainment culture",
          "david cassidy",
          "martine mccutcheon",
          "anna scott",
          "wickham",
          "four weddings and a funeral",
          "richard curtis",
          "bridget jones",
          "emma thompson",
          "elinor dashwood",
          "drew barrymore",
          "nicholas hoult",
          "billy bob thornton",
          "forge fitzwilliam",
          "julia roberts",
          "daniel cleaver",
          "streep",
          "alan rickman",
          "sandra bullock",
          "rhys ifans",
          "paul king",
          "mike newell",
          "florence foster jenkins",
          "renee zellweger",
          "the englishman who went up a hill but came down a mountain",
          "love actually",
          "music and lyrics",
          "beryl bainbridge",
          "jay leno",
          "charles",
          "oscar",
          "an awfully big adventure",
          "andie macdowell",
          "pride and prejudice",
          "sense and sensibility",
          "nick hornby",
          "scandal",
          "two weeks notice",
          "human interest",
          "his edward ferrars",
          "georgina cates",
          "dungeons dragons"
        ],
        "creator": [
          "Cindy White"
        ],
        "video_url": null,
        "description": "When you’ve been in the moviemaking business for as long as Hugh Grant has, you’ve earned the right to take whatever kinds of chances you want in the roles you choose. If that means poking a little fun at your own image as an aging, curmudgeonly actor whose best roles may be behind him (though we’d argue that’s…Read more...",
        "content": "As we prepare for the sight of Hugh Grant as an Oompa Loompa, here's a look back at his career arc from romantic leading man to whatever it is he's doing now When you’ve been in the moviemaking business for as long as Hugh Grant has, you’ve earned the right to take whatever kinds of chances you want in the roles you choose. If that means poking a little fun at your own image as an aging, curmudgeonly actor whose best roles may be behind him (though we’d argue that’s certainly not true) or going completely off the rails as a digitally created Oompa Loompa in the new film, that’s your prerogative. After years of struggling to get away from the kinds of romantic roles he was being offered after his breakthrough performance in , it’s been fascinating to track the progression of Grant’s projects as he continues to push boundaries on his own terms. If he ever cared what audiences thought of him, he certainly doesn’t anymore. And lately it seems as if he’s found a new sort of niche that suits him. That doesn’t mean we love his performances in beloved rom-coms like and any less. He’s an actor of many talents. Here, then, are our favorite Hugh Grant performances ranging from the most stable characters to the most delightfully unhinged. 2 / 17 15. (1999) 15. (1999) Hugh Grant’s humble London-based bookseller Will in is as stable as they come—that’s the whole point of the character (it’s Rhys Ifans who gets to be truly unhinged here as his flatmate Spike). Will is a grounding presence in the looking-glass Hollywood life of American superstar Anna Scott (Julia Roberts). Despite a conscious effort to play against type in the years following his breakout role in , Grant reunited with screenwriter Richard Curtis after reading the script for , which was too good to turn down. Even now, two and a half decades later, it hasn’t lost any of its unapologetically romantic charm. 3 / 17 14. (1995) 14. (1995) If 1994’s solidified Hugh Grant’s status as a romantic lead, the Jane Austen adaptation , released the following year, showed audiences that he could do it even better in period dress. His Edward Ferrars makes an enchanting first impression, but disappears for a good chunk of the film, reappearing only at the climax to haltingly reveal his true feelings to Emma Thompson’s Elinor Dashwood. That brief scene, and both Grant’s and Thompson’s performance in it, is the perfect capper to a bright and bountiful film full of memorable moments. 4 / 17 13. (1995) 13. (1995) The unhinged length of this film’s title alone should indicate a non-zero level of whimsy without knowing anything else about it. And that’s not too far from the truth. With his star on the rise after hits like and , Grant appeared in the quaint little indie as a cartographer who travels to a Welsh village during World War I to assess whether the local geological feature qualifies as a hill or a mountain. Surrounded by colorful local characters, he does exactly what was expected of him at this point in his career. He’s a bit stiff, a bit flustered, and a bit charming, often all at the same time. 5 / 17 12. (1994) 12. (1994) Unless you lived through it, it’s hard to explain the cultural impact that had on the mid-1990s. It was . And so was Hugh Grant, stumbling through a love confession to Andie MacDowell through the words of David Cassidy (when he was still with The Partridge Family). It was the first of what turned out to be several immensely successful collaborations between Grant and screenwriter Richard Curtis that catapulted him from a relatively unknown British actor to a worldwide star. As Charles, his boyish good looks are undercut by his social awkwardness, dry wit, and plenty of self-deprecation. The role would shape his career, for better or worse, for the following decade. 6 / 17 11. (1988) 11. (1988) Before he became a recognizable star, Hugh Grant was making some real offbeat choices in film projects. Take for example, the late ’80s cult classic , in which he plays a British aristocrat whose ancestral Derbyshire home happens to be situated next to a cavern inhabited by an ancient serpentine creature and the immortal priestess who serves it. Directed by Ken Russell and loosely based on a lesser-known Bram Stoker novel, it’s as bonkers as you might expect. As the plucky young hero, Grant doesn’t get to have as much campy fun as the baddies in the one, but based on some of his later performances, he was clearly taking notes. 7 / 17 10. (2002) 10. (2002) Based on the book by Nick Hornby, manages to be heartfelt without ever losing its edge. Grant’s layered performance as Will, an independently wealthy bachelor who forms an unexpected connection with a tragically uncool middle schooler (played by a babyfaced Nicholas Hoult), is a big part of why the film succeeds as well as it does. Will isn’t as romantically idealistic as some other characters Grant has played—he can be duplicitous and manipulative—but his heart’s ultimately in the right place. It feels like just the right balance of sweet and salty for Grant at this stage of his career. 8 / 17 9. (1995) 9. (1995) might be best remembered for a fluke of timing. It came out around the same time Grant was famously arrested for soliciting a sex worker near the Sunset Strip. The proximity of the two events meant that he had to do the press tour for the film while the scandal was unfolding in the tabloids in real-time, leading to an iconic in which Grant defused the situation with his trademark self-effacing humor. That might have been his best performance of the year, though he’s not bad in the film as an increasingly nervous father-to-be. That said, we had to throw in a few extra points towards the unhinged end of the scale just for that extremely floppy hairdo. 9 / 17 8. (2003) 8. (2003) In a film overstuffed with too many characters and intertwining plots, Grant’s storyline as the newly elected Prime Minister who falls for a junior staffer (played by Martine McCutcheon) has always stood out as a fan-favorite in . Chalk it up to another successful team-up with screenwriter Richard Curtis. Grant now talks about how much he dreaded filming the famous scene when his character celebrates his political triumph over the American president (Billy Bob Thornton), but if he didn’t want the image of him dancing through 10 Downing Street to The Pointer Sisters forever burned into our brains, he shouldn’t have done such a good job at it. Afraid it’s too late now, sir. 10 / 17 7. (2007) 7. (2007) Some of the best bits in were the scenes where the film played up the concept of Hugh Grant as a 1980s pop star, both in his heyday and as a washed-up has-been. It’s a fun metatextual angle that directly references Grant’s status as a romantic lead in a late-career rom-com. The big age gap between him and his co-star love interest Drew Barrymore could have been an insurmountable obstacle, but the two actually have a good amount of on-screen chemistry that works in the film’s favor. Perhaps the musical talents he showcased here led to more opportunities to make use of them in films like and . 11 / 17 6. (2001) 6. (2001) According to Hugh Grant, screenwriter Richard Curtis always found it amusing that he was so often cast as such nice, affable blokes when he’s quite the opposite in real life. That public-private contrast clearly factored into his role in as Daniel Cleaver, a modern equivalent of ’s dastardly Mr. Wickham. You can easily see why Bridget (Renée Zellweger) would fall for him, and when his true nature is revealed, it’s devastating. Grant’s performance makes Daniel’s turn from handsome heartthrob to loathsome slimeball seem all too real. 12 / 17 5. (2002) 5. (2002) After Grant made the transition from nice guy to jerk in , he did the reverse as Sandra Bullock’s love interest and boss in . He plays a rich, self-important real estate developer who hires Bullock as his Chief Counsel and becomes so reliant on her for his every need, she gets fed up and quits. It’s during the two weeks after she gives notice that the two of them realize they might actually like each other for real. The movie itself is a fairly standard by-the-numbers rom-com, but Grant and Bullock’s performances elevate it with an acidic chemistry that makes it fun to watch. Two rom-com giants at the top of their game. 13 / 17 4. (1995) 4. (1995) Twenty years before he played drama king Phoenix Buchanan in , Hugh Grant sleazed it up as a predatory theatrical director in , a heavy drama (don’t be fooled by the cheery tone of the trailer) based on the acclaimed novel by Beryl Bainbridge. Grant has played his share of villains over the years, but Meredith Potter might be the most despicable, because of how true to life his sociopathy feels. Reuniting with director Mike Newell, Grant seems desperate to shake off the shackles of typecasting with this film, set in dreary post-World War II Liverpool. Meredith is a monster who callously uses his position of power to prey on boys, girls, or anyone who shows the slightest interest. It’s a supporting role, but he nearly steals the show from co-star Alan Rickman (not an easy thing to do) and a young Georgina Cates. 14 / 17 3. (2016) 3. (2016) In seeking to distance himself from the kinds of romantic roles he played earlier in his career, Grant has perhaps stumbled into another archetype that might suit him even better (and he would probably agree)—the overly theatrical narcissist. His character in is another variation on that theme, and was acclaimed as one of the best performances of his career up to that point. Based on the true story of a wealthy socialite (Meryl Streep, who was nominated for an Oscar in the role) who believed she had talent as an opera singer because no one would dare tell her otherwise, Grant plays Florence’s husband and manager, St. Clair Bayfield. He’s a character with murky motivations, having given up his own acting career to support his untalented wife, and Grant lets you see all the interesting facets within him, even (and especially) the flaws. 15 / 17 2. (2023) 2. (2023) Perhaps all the acclaim Grant received for his campy, over-the-top performance in inspired him to take on another baddie in From the moment we meet slippery rogue Forge Fitzwilliam, his arc from ally to adversary to the grandstanding Lord of Neverwinter is fairly predictable, but that doesn’t mean it isn’t tons of fun to watch Grant chew every bit of scenery within reach. Now that he’s fully in the DGAF phase of his career (just listen to any of his recent interviews), we’d encourage the directors of his future projects to let him off the leash more often. The results are frequently dazzling. 16 / 17 1. (2017) 1. (2017) When filmmaker Paul King first sent the script to Hugh Grant, the character of Phoenix Buchanan, a “washed-up narcissistic old actor” (in Grant’s words), was called Hugh. Grant could have chosen to take that personally and refused to have anything to do with the project, but instead, he embraced it. The performance he gives in the film is one of his best and one of his most unhinged. In a quest to hunt down a hidden treasure using clues from a pop-up book in Paddington’s possession, he employs a series of eccentric disguises to trick the poor, innocent bear. If Grant didn’t have a blast making the film, he did a fine job of making it look as though he did. 17 / 17",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/ad6d02dac224c19342ffac22349b830b.jpg",
        "source_id": "theavclub",
        "source_priority": 2320,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "426dc94f6f623def50cfd144f2362e3d",
        "title": "Reacher Season 2: Is Willa Fitzgerald’s Roscoe in the New Season?",
        "link": "https://www.comingsoon.net/guides/news/1445491-reacher-season-2-willa-fitzgerald-roscoe-back-return",
        "keywords": [
          "Guides",
          "Amazon Prime Video",
          "reacher",
          "Streaming",
          "TV Guides",
          "willa fitzgerald"
        ],
        "creator": [
          "Abdul Azim Naushad"
        ],
        "video_url": null,
        "description": "Reacher Season 2 has just dropped and fans are curious about whether or not Willa Fitzgerald’s Roscoe Conkin from the first season will be in the new season. Here is all you need to know. Is Willa Fitzgerald’s Roscoe in Reacher Season 2? No, Willa Fitzgerald’s Roscoe is not in Season 2. The reason for […] The post Reacher Season 2: Is Willa Fitzgerald’s Roscoe in the New Season? appeared first on ComingSoon.net - Movie Trailers, TV & Streaming News, and More.",
        "content": "Reacher Season 2: Is Willa Fitzgerald’s Roscoe in the New Season? By has just dropped and fans are curious about whether or not from the first season will be in the new season. Here is all you need to know. Is Willa Fitzgerald’s Roscoe in Reacher Season 2? The reason for Roscoe’s absence in the second season is that Jack Reacher has moved out of Margrave, Roscoe’s hometown. Additionally, due to Reacher staying faithful to the books and closely following the story laid out by it, Roscoe’s absence is a given, evidenced by how she is not in the books after Killing Floor, the book adapted by the first season of the show. Why isn’t Roscoe in Season 2? Moreover, Reacher and Roscoe, who developed romantic feelings for each other, parted ways after realizing their relationship would not work due to Reacher’s status as a drifter who is constantly on the move and Roscoe’s dedication to staying in Margrave and making it a better place. However, as seen at the end of the first season, Reacher and Roscoe parted ways on good terms, with the Reacher suggesting Roscoe run for mayor and Roscoe giving Reacher her number and telling him to call her anytime he felt like doing so. Roscoe’s absence and exit from the series after the first season was not a shock to the actress behind her, Willa Fitzgerald, who revealed in an interview with that she was always aware that her character would only have a story arc for one season. In entertainment elsewhere, . Also, . Abdul Naushad is a Contributing SEO Writer for ComingSoon. A Mass Comm graduate from Symbiosis University with a specialization in Audio-Visual communication, he finds himself rooting for Spider-Man or Batman in every battle. When he's not writing about SEO content, Abdul can be seen watching movies, aimlessly browsing YouTube and playing single player, story-driven video games. Share article Subscribe to our Newsletter Related",
        "pubDate": "2023-12-15 12:54:37",
        "image_url": "https://www.comingsoon.net/wp-content/uploads/sites/3/2023/12/reacher-season-2-Willa-Fitzgerald-roscoe-back-return.jpg?w=1024",
        "source_id": "comingsoon",
        "source_priority": 3031,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "e9b8712d844c61651531f544386ece43",
        "title": "Kanye West Asked Nicki Minaj To Clear A ‘Vultures’ Song, Minutes Before He Was Supposed To Release The Album, And She Said No",
        "link": "https://uproxx.com/music/kanye-west-nicki-minaj-clear-vultures-song-new-body/",
        "keywords": [
          "Home Page",
          "Music",
          "Kanye West",
          "New Body",
          "Nicki Minaj",
          "Vultures",
          "Ye"
        ],
        "creator": [
          "Derrick Rossignol"
        ],
        "video_url": null,
        "description": "Getty Image Kanye West and Ty Dolla Sign's new album 'Vultures' was expected to drop at midnight, but it's still not out yet.",
        "content": "As of this post, it’s nearly 8 a.m. ET, and and Ty Dolla Sign their collaborative album , which was expected to drop at midnight ET. Given West’s history of album delays and working on projects until the last possible second, this isn’t particularly surprising. This isn’t even the first time has faced a delay, as . As for why the album isn’t out yet, it looks like West was trying to cross some T’s and dot some I’s before the final buzzer. At 10:23 p.m. ET last night (December 14), 97 minutes before the album was presumably set for a midnight release, West tweeted a screenshot of a text he supposedly sent to Nicki Minaj, which read, “Hi it’s ye. May I call you about clearing new body on the new album.” . — ye (@kanyewest) , Minaj gave Kanye’s request a public “no.” During an Instagram Live broadcast last night, she said, “Child, that train has left the station, OK? No disrespect in any way. I just put out a brand new album. Now why would I put out a song that has been out for three years? Come on, guys. You know?” Nicki Minaj says she will NOT be clearing her verse to Kanye West’s “New Body” for his new album. – “That train has left the station.” — She’s Fishy ➐ (@ShesFishy) , Minaj said of “New Body,” a demo of which leaked back in 2018, “The public adored ‘New Body.’ ‘New Body’ is the biggest hit record that never came out. So what I thought was interesting was that Kanye made me write my ‘New Body’ verse four times over in order to fit into where he was creatively and spiritually in his life. […] I missed it by a year, I guess. Had ‘New Body’ been out when he was not in his gospel era, then it would’ve seen the light of day. But, it didn’t, so it wasn’t meant to be. Everybody knows that’s the hit that got away. […] I think the ship has sailed for ‘New Body,’ everybody has come to love the original way they heard it.” All that said, it is still December 15 right now, so West and Ty still have well over half a day to get everything in order and release before the weekend if that’s something they’re committed to doing.",
        "pubDate": "2023-12-15 12:48:47",
        "image_url": "https://uproxx.com/wp-content/uploads/2023/05/kanye-west-1.jpg?w=1024&h=436&crop=1",
        "source_id": "uproxx",
        "source_priority": 3298,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "9e8cbd85c2327cea3acc1a82ef773915",
        "title": "‘Young and the Restless’ star Peter Bergman opens up about Billy Miller’s ‘heartbreaking’ death",
        "link": "https://nypost.com/2023/12/15/entertainment/young-and-the-restless-peter-bergman-on-billy-millers-suicide/",
        "keywords": null,
        "creator": [
          "Chuck Arnold"
        ],
        "video_url": null,
        "description": "\"It is literally like losing a member of your family.\" — Peter Bergman",
        "content": "Playing Jack Abbott — the patriarch of the Abbotts, the first family of “The Young and the Restless” — for 34 years, Peter Bergman has grown to have a second set of kin. “Those people get a very special place in my heart,” Bergman, who is up for Outstanding Lead Actor in a Drama Series for the 24th time at the 50th Daytime Emmy Awards on Friday — which will broadcast on CBS and stream on Paramount+ live at 9 p.m. ET. So the three-time Daytime Emmy winner took it hard, right along with the rest of the “Y&R” cast, when Billy Miller — who played Jack Abbott’s younger half-brother, Billy Abbott, from 2008 to 2014, died by suicide at 43 in September after years of battling bipolar depression . “It is absolutely heartbreaking,” Bergman, 70, told The Post. “It is literally like losing a member of your family. In fact, the “Y&R” cast planned to remember Miller at their holiday party on Thursday, the day before the Daytime Emmys , in Los Angeles. “We still care about it. We’re still talking about it.” Miller was born in Tulsa, Oklahoma, and also starred on “General Hospital” as Jason Morgan and Drew Cain from 2014 to 2019. After his 592-episode run on the ABC daytime soap opera, Miller appeared on “Suits,” “Truth Be Told” and “NCIS.” After playing Dr. Cliff Warner on “All My Children” for 10 years, Bergman has now been at “The Young and the Restless” since 1989. But because of his sense of family at “AMC,” it was a tricky transition for him. “My job at ‘All My Children’ ended before I was ready,” said Bergman, whose supercouple romance with Taylor Miller’s Nina had ended. “They kind of decided, ‘If Nina is not going to be here, why do we need Cliff?’ So they decided to let me go. “It was heartbreaking,” he continued. “That was my first daytime family, and I was so invested in it all. And I got this job on ‘Young and the Restless,’ but my heart was still in Pine Valley [with [‘AMC’].” But after the first of his 24 Daytime Emmy nominations was for “All My Children,” Bergman went on to amass 23 more at “The Young & the Restless.” Now he is the big daddy of Y&R” — the highest-rated of the three soap operas remaining on network TV (along with “The Bold and the Beautiful” and “General Hospital” ) — which celebrated its 50th anniversary in March. “I have a kind of deep responsibility for my family members on the show,” he said. “The same way Jack does.”",
        "pubDate": "2023-12-15 12:47:37",
        "image_url": "https://nypost.com/wp-content/uploads/sites/2/2023/12/daytime-emmy-nominee-peter-bergman-73770577.jpg?quality=90&strip=all",
        "source_id": "nypost",
        "source_priority": 109,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "7615e9cf6be488a6560201490f4218d4",
        "title": "By: Erica Barr",
        "link": "https://viralnova.com/ice-cream-truck-treats/#comment-63302",
        "keywords": null,
        "creator": [
          "Erica Barr"
        ],
        "video_url": null,
        "description": "Spellbinding brilliance! Your blog's fusion of intellect and creativity is truly remarkable. Explore the wonders at https://tinyurl.com/totomidas-toto-midas",
        "content": "As a kid, the sound of an ice cream truck sent you running down the street with the hope of getting your hands on a yummy treat. Now that we’re adults, you can save yourself the embarrassment of sprinting down the road by creating your favorite ice cream delights in your very own kitchen. These super-simple recipes will make you feel like a kid again. Sorry, ice cream man, but you’ve definitely been replaced.",
        "pubDate": "2023-12-15 12:47:01",
        "image_url": null,
        "source_id": "viralnova",
        "source_priority": 85554,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702644421505831098"
  }