{
    "status": "success",
    "totalResults": 127,
    "results": [
      {
        "article_id": "a2b19ea605c1bea440ba616a7ea07282",
        "title": "First Alert Weather: Temperatures warm up to highs in mid-50s; Yellow Alert this weekend",
        "link": "https://www.cbsnews.com/newyork/news/first-alert-weather-temperatures-warm-up-to-highs-in-mid-50s-yellow-alert-this-weekend/",
        "keywords": [
          "Weather",
          "Connecticut News",
          "New Jersey News",
          "New York News"
        ],
        "creator": [
          "Justin Lewis"
        ],
        "video_url": null,
        "description": "After another cold morning, it will be mostly sunny and nearly 15 degrees warmer with highs in the mid-50s.",
        "content": "Yellow Alert Sunday night into Monday for a coastal storm that will produce heavy rain and gusty winds. Today: Another cold one this morning... feels like 30s and 20s. Pick of the Week: Mostly sunny and nearly 15° warmer with highs in the mid 50s. Tonight: Still a chill... low 40s in the city with 30s across our suburbs. Tomorrow: The better half of the weekend: Still mild with highs in the low 50s. Sunday: PM showers/rain. Highs in the 50s. Sunday Night: Heavy rain and gusty winds. Localized flooding possible. Monday: Rain and gusty winds, especially in the AM. Highs in the 50s.",
        "pubDate": "2023-12-15 12:06:55",
        "image_url": "https://assets2.cbsnewsstatic.com/hub/i/r/2022/03/11/7d97a873-83ac-4c8d-8de9-b5023e7f7c89/thumbnail/1024x576/e41dff909577244ce644287861105c66/first-alert-weather-sunny.png?v=5382e209c94ee904b3a96a69f8ca0ce0",
        "source_id": "newyorkcbslocal",
        "source_priority": 237564,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      },
      {
        "article_id": "1cfa68053f066829bea8d59a87943129",
        "title": "Passenger trains could help combat climate change — if rail can actually get built",
        "link": "https://thehill.com/policy/energy-environment/4361262-passenger-trains-climate-change-building-hurdles/",
        "keywords": [
          "Energy & Environment",
          "Policy",
          "Transportation"
        ],
        "creator": [
          "Rachel Frazin"
        ],
        "video_url": null,
        "description": "The Biden administration is investing billions in passenger rail, giving a boost to a potentially important tool for mitigating climate change. However, significant hurdles could slow efforts to get more rail online. Last week, President Biden announced $8.2 billion in Bipartisan Infrastructure Law funding for 10 passenger rail projects, including what the White House described as the “first world-class...",
        "content": "The Biden administration is investing billions in passenger rail, giving a boost to a potentially important tool for mitigating climate change. However, significant hurdles could slow efforts to get more rail online. Last week, President Biden in Bipartisan Infrastructure Law funding for 10 passenger rail projects, including what the White House described as the “first world-class high-speed rail projects in our country’s history.” The funded projects include a line connecting California to Las Vegas — which alone is expected to carry 11 million passengers each year and prevent 400,000 tons of carbon dioxide from entering the atmosphere — as well as lines serving California’s Central Valley, North Carolina and a line connecting Washington, D.C., and Richmond, Va. Experts, the rail industry and environmentalists say that passenger trains could be an important tool for getting people out of cars and planes, thereby helping the planet. “As long as it helps get people from Point A to Point B, we will see less car trips on the road,” said Rebekah Whilden, deputy director of Sierra Club’s Clean Transportation for All campaign. She added that a reduction in travel in personal vehicles is “ultimately what we need to see to see the emissions reductions that we need.” Nick Little, director of railway education at Michigan State University’s Center For Railway Research and Education, said there is potential to grow more rail in the U.S., but only in “selective” locations. He said that opportunities exist in the northeastern U.S., as well as to connect the Dallas-Fort Worth area to Houston and Austin in Texas and Chicago to cities including Detroit, Grand Rapids, Mich., and Minneapolis. However, the future of rail may not look like the ambitious high-speed rail maps that , illustrating fantasies of connecting the entire nation: Such ideas are a “pipe dream,” Little said. The U.S. Department of Transportation has its for passenger trains. It identifies parts of the Northeast and California as places for “frequent trains at 125-250+ mph in the nation’s densest and most populous regions” and parts of the Midwest as areas for regional service connecting large and midsize cities as well as “feeder” services to connect communities to the rail network. Christopher Barkan, professor and director of the Rail Transportation and Engineering Center at the University of Illinois Urbana-Champaign, said that he expects rail to grow in the years ahead, noting that there’s already significant work underway. He said he mostly expects it to crop up in corridors between 100 and 400 miles in length. “It’s a combination of population density and suitable distances where both conventional and high-speed passenger [rail] can be competitive,” Barkan said. Andy Kunz, president of the U.S. High Speed Rail Association, said “the prognosis is really good” for the future of high-speed rail. “The really good thing is, the Brightline West one, which will connect Las Vegas and Los Angeles, that one will be up and running in four short years,” Kurz said. “It’ll make the case much sooner to the American people how great of a transportation mode this actually is,” he added, saying that another California project is expected to take longer to build. However, he said that building out high-speed rail in the Northeast is “going to be one of the harder ones to build because they’ll have to build a whole new set of tracks” in order to handle the high speeds. Meanwhile, Little said that he particularly expects to see more frequent trains on existing routes going forward because it’s “an easy thing to do, relatively,” since the trains themselves are the only additional expense. But for new rail, there are still hurdles to overcome. Barkan said the nation’s environmental review process — sometimes known as permitting — is one hurdle. “The initial thing that takes time is the environmental permitting,” he said. “That’s actually one of the things I think the United States needs to improve is to accelerate its environmental permitting process for projects such as this.” Permitting is also a hot topic on Capitol Hill — where lawmakers have sought to make a deal to speed up energy and other infrastructure projects. As part of a deal to lift the debt ceiling, some changes such as shorter federal environmental reviews were approved earlier this year, but lawmakers do not appear to have moved closer on a broader agreement. Kunz said that not having enough funding for rail projects is the “No. 1 reason” for delays. “Not having the money readily available early, the project ends up slowing down or actually stopping and waiting for the money to come in,” he said. This, in turn, drives up the bill for projects because of inflation and increased costs. Barkan said the grants announced last week will be “a significant help,” but more is needed. “We’re not done yet, but it’s a huge step forward.” Whilden, with the Sierra Club, said the nation’s rail system might be able to get a boost not only from money allocated by the Bipartisan Infrastructure Law, but also through more in the Inflation Reduction Act. “Municipalities and states can apply for it, and basically the only kind of checkbox is that it has to lower … pollution emissions, and so rail could be seen as being able to be used for that sort of grant,” Whilden said.",
        "pubDate": "2023-12-15 10:30:00",
        "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/12/Rail_121523_Photo_AP.png?w=900",
        "source_id": "thehill",
        "source_priority": 393,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      },
      {
        "article_id": "c38f07c635fb9f5df3ba4dab39279767",
        "title": "A hurricane-proof town? Florida community may be a test case",
        "link": "https://phys.org/news/2023-12-hurricane-proof-town-florida-community-case.html",
        "keywords": [
          "Environment"
        ],
        "creator": null,
        "video_url": null,
        "description": "When Hurricane Ian churned past her home in southwest Florida last year, Mary Frisbee shrugged off worries. She watched TV and surfed the internet.",
        "content": "December 15, 2023 This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked reputable news agency proofread by Gerard MARTINEZ When Hurricane Ian churned past her home in southwest Florida last year, Mary Frisbee shrugged off worries. She watched TV and surfed the internet. That's because she and her husband live in Babcock Ranch, a town near the US Gulf Coast that was created with two imperatives: homes have to be built sustainably, and must be able to withstand hurricanes, a constant menace. The community takes nature deeply into account. To avoid flooding caused by storms, Babcock Ranch is built some nine meters (30 feet) above sea level. Town planners also preserved wetlands in the area, which act as sponges for excess water. Local lakes are interconnected with the wetlands by a system of pumps that prevent overflows. And if they do occur, water floods the streets, roads and ponds, not the houses. The first test came in September 2022 with Ian, a powerful category 4 hurricane, and it was a success. No resident suffered major damage, there were no power outages and only a few trees fell. Babcock Ranch seems lifted from a postcard. Homes with perfect lawns overlook lakes. Bike paths and forest roads wend through the community. In the parks, kids ride bikes or climb on swings, supervised by parents or grandparents. The town, which opened in 2018, has 7,200 residents, but continues to expand with new neighborhoods. Eventually it is expected to have a population of about 50,000. Syd Kitson, a retired professional US soccer player, is the developer. In 2005, his company paid $700 million for a 372 square kilometer (92,000 acre) ranch, most of which it sold to the state of Florida, which wanted to establish a nature reserve there. On the land he kept—some 72 square kilometers (18,000 acres)—Kitson conceived his dream city: a place with housing, stores and schools that would attract young families and retirees choosing to make their home in the Florida sun. On the outskirts, 680,000 solar panels make the city the first in the United States to run entirely on solar. Power lines are buried underground to protect them from wind and prevent outages during storms. On paper, everything looked good. But then on September 28, 2022, Ian came roaring through. And the trust that homeowners like Mary Frisbee or Donald Bishop, a 78-year-old neighbor who had already lost a house in Mississippi to a hurricane, had placed in Babcock Ranch was put to the test. Kitson said he couldn't sleep on the night of the storm. \"We hadn't been tested yet, so you never know. At the time, there were about 5,000 people living here, neighbors who I had told, 'You can shelter at home.' I felt this really strong responsibility,\" Kitson recalled. He was relieved to find that Ian, which churned ashore with 150 mile-per-hour winds and torrential rains that devastated neighboring Fort Myers and left nearly 150 dead, barely damaged his town. Elsewhere in the state, damages were estimated at over $110 billion. Most Floridians can't have the protections afforded the residents of Babcock Ranch. They live on lower ground. Of the state's 19.6 million people, 15 million live in coastal areas , the US government's Office for Coastal Management says. Still, Kitson believes that the ideas put into practice at Babcock Ranch can provide an example to others. It is a view shared by Yoca Arditi-Rocha, executive director of the environmental NGO the Cleo Institute, who believes the biggest lesson from the community is that \"we need to build our cities and our communities with a climate change of mind.\" That may be especially true in Florida, the fastest-growing US state yet one that is acutely vulnerable to disasters such as rising seas and hurricanes. Babcock Ranch \"proves that when you build and you plan ahead, and you invest in those resilience components, you get the return on investment in the end,\" Arditi-Rocha told AFP. The activist says such planned communities are not a panacea, though, because the cost of housing is only affordable for a few. Kitson said he took that into account at Babcock Ranch. Some rental apartments go for $1,500 a month while home prices can start at $300,000, he said. \"You have to have a variety of housing and prices,\" he said. \"That's very important. It's not a real city unless you can do that.\" © 2023 AFP",
        "pubDate": "2023-12-15 09:20:44",
        "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/babcock-ranch-in-south.jpg",
        "source_id": "phys",
        "source_priority": 6461,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      },
      {
        "article_id": "84a52cbf0b5b6bb703eda167a99e1878",
        "title": "US-Mexico border wall threatening rare wildlife",
        "link": "https://phys.org/news/2023-12-us-mexico-border-wall-threatening-rare.html",
        "keywords": [
          "Environment"
        ],
        "creator": null,
        "video_url": null,
        "description": "Jaguars don't understand borders, but where the United States meets Mexico, they are having to adapt to them.",
        "content": "December 15, 2023 This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked reputable news agency proofread by Paula RAMON Jaguars don't understand borders, but where the United States meets Mexico, they are having to adapt to them. Once the master of the Sonoran Desert, the animal is now struggling to survive in a landscape cut in two by a wall. The barrier, which former US president Donald Trump boasted he would make \"impenetrable,\" does little to discourage the thousands of people from Latin America, Asia, Africa and Eastern Europe who arrive in the country every day, fleeing poverty and persecution. But, say conservationists, the fencing erected by successive administrations in Washington is deadly to wildlife. \"One of the most important things for the health of ecosystems is habitat connectivity ,\" says Laiken Jordahl from the Center for Biological Diversity. \"Animals need to be able to roam, to find food, water, to find mates. Having wide expanses of connected landscape is critical.\" A metal fence rises 30 feet (9 meters) at the southern edge of the Buenos Aires National Wildlife Refuge, a 117,000-acre (47,000-hectare) home for threatened and endangered plants and animals in Arizona. The barrier marks the end of the United States, but not the end of the habitat for dozens of species, including American antelope, mule deer, lynx, mountain lions and jaguars. \"This wall is clearly going to sever this entire ecosystem from all of the wild lands in Mexico that will make animals on this side and that side of the wall more vulnerable to drought, to climate change , to inbreeding,\" Jordahl said. Scientists think there are about 150 jaguars on the Mexican side; there have been only seven documented sightings on the American side in recent decades. \"One individual jaguar can roam hundreds or thousands of acres, they can walk hundreds of miles in a matter of days. They need massive landscapes available to them,\" said Jordahl. \"Jaguars are coming up to Arizona from Sonora in Mexico, but a lot of them are being met with a solid border wall.\" 'Undercutting' A physical barrier at the US-Mexico border has been in the works for decades along stretches of the 2,000-mile (3,000-kilometer) frontier. It is present in national parks , nature reserves and on indigenous lands in Texas, New Mexico, Arizona and California, ending a few yards (meters) out into the Pacific Ocean. Each piece of the jigsaw reveals the administration that put it there—Trump's section of wall, for example, stands the highest, a reflection of the Republican's signature pledge to shutter the border. Trump's White House repealed or circumvented rules designed to lessen environmental impacts, causing \"irreparable\" damage in nature reserves and on indigenous lands, according to a report released in September by the Government Accountability Office, the auditing arm of Congress. Democrat Joe Biden halted the expansion of the wall when he came to office in 2021, but in October his administration authorized the closing of some gaps, mainly in Arizona. For Jordahl, the rush to erect the barrier undermined years of careful conservation work by the government. \"The federal government has put hundreds of millions of dollars into protecting landscapes around the border, into recovering animals like the Mexican gray wolf and the jaguar. \"But at the same time, they're undercutting all of those goals by building this impermeable structure that stops... migrations dead in their tracks. \"Essentially, we're pulling thread after thread out of this patchwork that is the intact ecosystem,\" said Jordahl. \"It's only a matter of time until it all does start to unravel.\" © 2023 AFP",
        "pubDate": "2023-12-15 09:20:16",
        "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/this-aerial-picture-ta.jpg",
        "source_id": "phys",
        "source_priority": 6461,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      },
      {
        "article_id": "005d1128212c4f8a0afbc0e7a6683c99",
        "title": "First Alert Forecast: CBS2 12/14/23 Nightly Weather",
        "link": "https://www.cbsnews.com/newyork/video/first-alert-forecast-cbs2-121423-nightly-weather/",
        "keywords": [
          "CBS2 News At 11",
          "Weather",
          "Spoken Word WCBSTV",
          "Weather Forecast"
        ],
        "creator": [
          "CBS New York"
        ],
        "video_url": null,
        "description": "CBS New York's Lonnie Quinn has your First Alert Forecast for December 14 at 11 p.m.",
        "content": "CBS New York's Lonnie Quinn has your First Alert Forecast for December 14 at 11 p.m.",
        "pubDate": "2023-12-15 04:57:00",
        "image_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/12/15/81451942-b4a6-4d9e-b8a8-ac79d352bb89/thumbnail/1024x576/9949b6d59f0e5780b9b238439e808806/161b598df766e2788aaefa9d4371d278.jpg?v=5382e209c94ee904b3a96a69f8ca0ce0",
        "source_id": "newyorkcbslocal",
        "source_priority": 237564,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      },
      {
        "article_id": "59fbddde86216f16d90d7df2357781fb",
        "title": "First Alert Weather Thursday night forecast 12-14-23",
        "link": "https://www.cbsnews.com/sanfrancisco/video/first-alert-weather-thursday-night-forecast-12-14-23/",
        "keywords": [
          "Weather"
        ],
        "creator": [
          "CBS San Francisco"
        ],
        "video_url": null,
        "description": "Meteorologist Darren Peck has the Bay Area microclimate forecast.",
        "content": "Meteorologist Darren Peck has the Bay Area microclimate forecast.",
        "pubDate": "2023-12-15 01:26:00",
        "image_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/12/15/7cb290a5-192b-477f-bd4f-ae3a8370d1e7/thumbnail/1024x576/0eee356043d0502e28e36cf3bad4f181/1abeb04a99b58be1c6551cea492ad4de.jpg?v=5382e209c94ee904b3a96a69f8ca0ce0",
        "source_id": "sanfranciscocbslocal",
        "source_priority": 237564,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      },
      {
        "article_id": "b10176fc8db3f5cca90c19dda226e63a",
        "title": "How an overlooked study over a century ago helped fuel the Colorado River crisis",
        "link": "https://phys.org/news/2023-12-overlooked-century-fuel-colorado-river.html",
        "keywords": [
          "Earth Sciences Environment"
        ],
        "creator": null,
        "video_url": null,
        "description": "When it comes to the Colorado River, history often repeats itself—but it doesn't have to. That's the take-home message from CU Boulder hydrologist Shemin Ge, who will present a little-known piece of history from the river this Thursday at the American Geophysical Union (AGU) meeting in San Francisco.",
        "content": "December 14, 2023 This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked trusted source proofread by University of Colorado at Boulder When it comes to the Colorado River, history often repeats itself—but it doesn't have to. That's the take-home message from CU Boulder hydrologist Shemin Ge, who will present a little-known piece of history from the river this Thursday at the American Geophysical Union (AGU) meeting in San Francisco. The story of hydrologist Eugene Clyde La Rue, Ge said, may help to explain the current water crisis facing many states in the American West. Ge's presentation centers around a decision made in 1922 when the seven men who made up the Colorado River Commission came to an agreement to divvy up water on the Colorado River. This waterway winds over 1,450 miles and through seven states. The commission relied on an estimate from the U.S. Reclamation Service suggesting that 16.4 million acre-feet of water ran through the river at Lees Ferry, Arizona, every year. (An acre-foot equals the amount of water you'd need to submerge an acre of land to a depth of 1 foot). But, Ge said, the commission also failed to consider a second, less convenient study from 1916. Relying on his own field data, La Rue, working for the U.S. Geological Survey, had calculated that the Colorado River discharged just 15 million acre-feet of water . \"It's intriguing how such good work at the time was ignored, whether it was intentional or just out of ignorance,\" said Ge, professor in the Department of Geological Sciences at CU Boulder. She worries it may be happening again. In 2022, Lake Mead and Lake Powell, the two main reservoirs on the Colorado River, dried up to levels never seen before, raising concerns that they could be heading for a \"dead pool\" state—in which water could flow in but not out of the reservoirs. Currently, the seven states within the Colorado River Compact are working to revise a suite of agreements and guidelines by 2026. Ge hopes that this time, leaders will work closely with scientists and a range of community members, particularly Indigenous groups—all to build a Law of the River that accounts for how much water actually exists in the West, now and in the future. That will become more important, she said, as climate change continues to melt the West's dwindling snowpacks. \"There's so much we can learn from history to improve how we're managing our water,\" Ge said. \"Right now, I don't think we're doing enough.\" She first learned about La Rue's story from the 2019 book, \" Science Be Dammed \" by Eric Kuhn and John Fleck. She and her colleagues wrote about their insights this summer in the magazine \"Eos.\" Think of it as a tale of two estimates. Beginning in 1914, La Rue hiked across much of the river and its tributaries, collecting first-hand data on the flow of water. That included taking measurements of the depth of the river and its flow speed. \"We still do this in our Intro to Geology courses,\" Ge said. \"It's very low-tech, but elegant.\" To come to its 16.4 million acre-feet assessment, in contrast, the Colorado River Commission, led by Secretary of Commerce and future President Herbert Hoover, relied on a much less rigorous study: measurements taken at just one site near Yuma, Arizona, hundreds of miles south of Lees Ferry. \"They took the larger number,\" Ge said. \"A larger number probably made the allocations easier to negotiate because there was more water to divvy up.\" The 40 million people who depend on the Colorado River for their water today may be paying the price. Today, research pegs the flow of the Colorado River at around 13 million acre-feet per year, making even La Rue's modest estimates seem like a fantasy. The Colorado River Compact, however, continues to allot water based on the 16.4 million acre-feet value: Colorado, New Mexico, Utah, and Wyoming together claim 7.5 million acre-feet. Arizona, California, and Nevada get the same, and Mexico supposedly draws 1.4 million. Ge hopes that, in the lead-up to 2026, those seven states will do what Hoover couldn't—draw on the best available science to develop realistic estimates of how much water will likely flow down the river decades from now. She added that Indigenous groups need to be an important part of that process. Several tribes hold some of the most senior rights to water in the western U.S. but lack the infrastructure to access much of their share. \"We're not talking enough about how much water is in the Colorado River,\" Ge said. \"We talk about droughts, infrastructure, and water conservation. But shouldn't the first order of business be to see how much water we actually have? It's much less than we think.\" More information: Abstract: Learning from history in reallocating the Colorado River Provided by University of Colorado at Boulder",
        "pubDate": "2023-12-15 01:00:01",
        "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/colorado-river-1.jpg",
        "source_id": "phys",
        "source_priority": 6461,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      },
      {
        "article_id": "4d4af9f41ed0a2defe0f9cfa768a4a3e",
        "title": "NEXT Weather: 6 p.m. report from Dec. 14, 2023",
        "link": "https://www.cbsnews.com/minnesota/video/next-weather-6-p-m-report-from-dec-14-2023/",
        "keywords": [
          "Weather",
          "Weather Forecast"
        ],
        "creator": [
          "CBS Minnesota"
        ],
        "video_url": null,
        "description": "Friday will be cloudy and cooler, with precipitation moving in later in the day.",
        "content": null,
        "pubDate": "2023-12-15 00:26:00",
        "image_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/12/15/2a204faa-5a3a-4c6a-912f-e370ca6d19a2/thumbnail/1024x576/d5f883d527257868cd131e849994b059/9ecffbeb650fff99328b07b60cfbde48.jpg?v=5382e209c94ee904b3a96a69f8ca0ce0",
        "source_id": "minnesotacbslocal",
        "source_priority": 237564,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      },
      {
        "article_id": "f06f7c1985d288db0a25f4e0afa8910c",
        "title": "Next Weather: WBZ Forecast For December 14, 2023",
        "link": "https://www.cbsnews.com/boston/video/next-weather-wbz-forecast-for-december-14-2023/",
        "keywords": [
          "News",
          "Weather",
          "Top Story",
          "Local News",
          "Weather Forecast",
          "Spoken Word WBZTV"
        ],
        "creator": null,
        "video_url": null,
        "description": "Eric Fisher has an updated weather forecast.",
        "content": null,
        "pubDate": "2023-12-14 23:31:00",
        "image_url": "https://assets1.cbsnewsstatic.com/hub/i/r/2023/12/14/865f3d05-8237-47cd-8553-96958a0be83d/thumbnail/1024x576/b8c3c5b86019fbb5879392e1b35a3503/cb30e192558c28ae04a45f67e14ce6fb.jpg?v=5382e209c94ee904b3a96a69f8ca0ce0",
        "source_id": "bostoncbslocal",
        "source_priority": 237564,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      },
      {
        "article_id": "5bd3f3c5a55acacfdcf3b0f024376d9e",
        "title": "NEXT Weather: 5 p.m. forecast from Dec. 14, 2023",
        "link": "https://www.cbsnews.com/minnesota/video/next-weather-5-p-m-forecast-from-dec-14-2023/",
        "keywords": [
          "Weather",
          "Weather Forecast"
        ],
        "creator": [
          "CBS Minnesota"
        ],
        "video_url": null,
        "description": "WCCO meteorologist Chris Shaffer says you can expect another mild night tonight with clouds and a few isolated sprinkles of rain moving into the area. Tomorrow will be cloudy and cooler with rain moving in later in the day. The steadiest rain will fall late tomorrow into the overnight. It will be cool enough to the north and west for a wet snow to fall…and accumulate.",
        "content": null,
        "pubDate": "2023-12-14 23:20:00",
        "image_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/12/14/b8c7c3b5-17cb-41af-aee5-0d3b1c059216/thumbnail/1024x576/3949bf90bffddbe00cfe56ca5bbc3cf8/debf1f86570766f77268c6abfdd933fa.jpg?v=5382e209c94ee904b3a96a69f8ca0ce0",
        "source_id": "minnesotacbslocal",
        "source_priority": 237564,
        "country": [
          "united states of america"
        ],
        "category": [
          "environment"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702596000761806387"
  }