{
    "status": "success",
    "totalResults": 53,
    "results": [
      {
        "article_id": "cd258bf40044c631d33b7f76f031e6a2",
        "title": "My First Time at TGI Fridays",
        "link": "https://thetakeout.com/tgi-fridays-first-time-order-menu-taste-test-review-1851096420",
        "keywords": [
          "tgi fridays",
          "eater",
          "potato skins",
          "small plates",
          "virtual restaurant",
          "hells kitchen",
          "rice",
          "hospitality recreation",
          "lo hoang",
          "appetizers",
          "texas roadhouse"
        ],
        "creator": [
          "Danny Palumbo"
        ],
        "video_url": null,
        "description": "Earlier this week, I went to TGI Fridays for the very first time. I wasn’t there to eat ironically, lambaste the food, or disparage the place outright. Rather, there was something that brought me to TGIF specifically, and it’s the financial data suggesting chain restaurants are once again on the rise.Read more...",
        "content": "Earlier this week, I went to TGI Fridays for the very first time. I wasn’t there to eat ironically, lambaste the food, or disparage the place outright. Rather, there was something that brought me to TGIF specifically, and it’s the financial data suggesting chain restaurants are once again on the rise. I’ve read the op-eds and essays. , says Eater citing figures that show ’s sales are up, as are . Texas Roadhouse is the in the world, and many fast-casual are trending upward as well. I’m fascinated by this surge in mid-tier chain restaurant dining. Eater puts it this way: Getting good food at a reasonable price isn’t all that easy here in Los Angeles. It’s why eating out for me these days usually involves burritos, , tacos, and . But a sit-down affair? A few drinks and some appetizers? That puts you north of $40 . Hell, finding a mixed drink under $13 is a near impossibility in this sun-soaked city. Still, it’s not necessarily a binary, where your only choices are potato skins or steak au poivre. But Fridays would love for you to see it that way. , it seems like the restaurant wants to showcase its value first and foremost. I wanted to see if that translated to a good meal. I went to Fridays with a friend, chef , around 2 p.m. on a Monday. This particular Fridays is —a giant dining area with a wrap-around bar easily seating 20 people, and plenty of TVs. Fridays is ready to accommodate large parties, throngs of happy hour attendees, and groups of bros eager to watch sporting events. Two o’clock is an odd time to eat and drink, but it’s also the most stress-free time to go to any restaurant. The emptiness was comforting, but the physical space of Fridays is where the words “empty” and “comfort” stop finding common ground. The prices at Fridays are, at face value, mind-blowingly good: $3.79 for truffle tot-chos, chips and jalapeño ranch for $3, mozzarella sticks for $5.59, and buffalo chicken slammers for $5.99, to name a few. The chain has a huge menu, full of subsections like small plates, appetizers, shareables, entrées, burgers and sandwiches, wings, salads, soups, bowls, a sushi and Asian-inspired section called Krispy Rice, and an expansive drink menu. Previously, I had thought that “small plates,” “appetizers,” and “shareables” were all words used interchangeably, but at Fridays, the menu clarifies the distinctions: Small plates serve 1 person, appetizers serve 2-3, and shareables serve 4-6. The clear, recommended feeding portions is refreshing. You don’t have to worry about over- or under-ordering. Despite the wealth of options, I have always assumed that Fridays is all about appetizers, and the best thing I ate was surely the mozzarella sticks. Though the cheese itself tasted barely of anything, the low-moisture mozzarella pull was absolutely delightful. Look how happy the pull made me. This is what food is supposed to do. The mozzarella sticks were the highlight, however, because most of the food just didn’t taste like it’s supposed to. The meatballs tasted remarkably unlike beef. I have never tasted meat that tastes less like meat in my life. This isn’t some gate-keeping review of TGI Fridays, but yes, words like “rubbery,” “bland,” and “greasy” come to mind. The two tiny meatballs cost $4.99. That’s not a good deal. The truffle tot-chos were crunchy and fun, but also absolutely fumigated with truffle oil. They smell toxic—these little croquettes should come with a gas mask. Is that harsh? Pretentious? Maybe, but look pal, I’m not the one using truffle oil here. Fridays’ use of truffle oil reminds me of the first time my nephew called me a shithead. It was funny once, and yes, my own behaviors taught you to do this, but knock it off right now, man. What’s a buffalo chicken slammer? Essentially, it’s a fried chicken tender stuffed into a mini lobster roll bun. This is a really fun idea, and the type of thing that would have been delicious if executed well. But the slammers were a disappointment because the presentation suggested the promise of delicious, fucked-up whimsy. Instead, they were just bland, and again, the price for portion wasn’t that great here. You know what else I can get for $6? Two amazing al pastor tacos, or one of the best slices of in the city. The one saving grace at Fridays was the booze. I ordered an espresso martini, which was so intensely sugary it tasted like it was intended for children. Still, it’s not the worst espresso martini I’ve had by a long shot, and for $10, it’s a damn good deal. Drinks at Fridays are cheap, which is great, because you should be very drunk there. All of the food I ate at Fridays was unseasoned, taste-avoidant, and unsatisfying. These harsh criticisms raise questions within myself. Am I an asshole for wanting the food to be better? When did I suddenly set a high bar for Fridays? I reckon the moment I walked through the door. Whether it’s a chain or not, there exist certain expectations for restaurant-quality food the moment you sit down to enjoy a meal, and that’s true no matter what type of establishment it is. I’ve been searching for some sort of profound thing to say after eating at Fridays, some sort of meaning to glean from the experience itself, and I think it’s this: It’s totally fine to like things, but it’s also okay to hate things. It’s okay to hate a restaurant’s food as long as that hate comes from a place of actually wanting to improve it. I don’t begrudge anybody for enjoying Fridays, and I have no interest in dunking on it for sport. But I do want everyone to have their fair share of seasoning. Affordable, flavorful food should be an option for everybody. To accept that it only exists when corporate dining overlords decide it’s comfortably within their margins is less than we deserve. Sometimes, you need a meal to wash down a meal. After Fridays, Lo and I went to , a celebrated taco truck a few miles away. What we received there wasn’t a bounty of photo-ready fried appetizers, but it was delicious, satisfying, expertly made, and cheap. Two shrimp tacos and six freshly shucked oysters cost $18. “There is a reason it’s loved in the community,” said Lo. People know they can go to Mariscos Jalisco for a reasonably priced meal, and they won’t even have to decode the difference between appetizers and shareables to get it.",
        "pubDate": "2023-12-15 12:30:00",
        "image_url": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/8d9693e659cec56e565cb9a9a7073097.jpg",
        "source_id": "thetakeout",
        "source_priority": 9440,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      },
      {
        "article_id": "e547d208cca69b163416eede326348d4",
        "title": "USDA rule isn’t to prevent future infant shortages as much as to protect WIC when they do occur",
        "link": "https://www.foodsafetynews.com/2023/12/usda-rule-isnt-to-prevent-future-infant-shortages-as-much-as-to-protect-wic-when-they-do-occur/",
        "keywords": [
          "Food Policy & Law",
          "Government Agencies",
          "Access to Baby Formula Act",
          "infant formula",
          "infant formula crisis",
          "Rule-published",
          "USDA Food and Nutrition Service (FNS)",
          "WIC"
        ],
        "creator": [
          "Dan Flynn"
        ],
        "video_url": null,
        "description": "Since the federal government took an “All the King’s horses and All the King’s men” approach to overcoming the 2022 infant formula shortage, it’s a little surprising that there is still something major to do about it. But there is. The USDA’s Food and Nutrition Service (FNS) is publishing a final rule to implement the... Continue Reading",
        "content": "Since the federal government took an “All the King’s horses and All the King’s men” approach to overcoming the 2022 infant formula shortage, it’s a little surprising that there is still something major to do about it. But there is. The USDA’s Food and Nutrition Service (FNS) is publishing a final rule to implement the so-called “Access to Baby Formula Act.” It was signed into law on May 21, 2022. The Formula Act was part of the months-long, whole-of-government response to the “recall-driven” infant formula shortages in 2022, The new law is supposed to provide access to the formula for WIC participants, even in unforeseen circumstances like disasters and emergencies, in addition to supply chain disruptions. FNS’s Special Supplemental Nutrition Program for Women, Infants, and Children (WIC) is the largest purchaser of infant formula in the United States. WIC’s market dominance, at the time when shortages became severe, contributed to the multi-billion dollar industry being controlled by just four companies that controlled 90 percent of the market. One of those four was Abbott Nutrition, which temporarily shut down out of concern for food safety. FNS claims to take its role in caring for families exceptionally seriously, including ensuring the people served by our programs, including WIC, have access to the safe, healthy foods they need to thrive. FNS also says it’s been working since the Access to Baby Formula Act was passed to implement the law as a final rule to strengthen and guide its response to any future baby formula-related challenges. This final rule will implement permanent, expanded authority for the Secretary of Agriculture to waive or modify specific legal requirements to help ensure the continuity of WIC services during emergencies and supply chain disruptions with an impact on WIC. It also adds requirements for WIC state agencies to include language in their WIC infant formula cost containment contracts that describe flexibilities available to WIC state agencies in case of an infant formula recall and how an infant formula manufacturer would protect against disruption of access to infant formula. Further, the final rule ensures that WIC state agencies anticipate and prepare for events that may disrupt normal program operations to reduce impacts on participants when an event does happen. The rule was scheduled to be published on Dec. 14 and will be open for public comment for 60 days, closing on Feb. 12. FNS is requesting comments on this rule through Feb. 12, 2024, to inform it of any future rules, policies, and guidance related to infant formula to ensure its best support of the WIC population regardless of what circumstances arise. The infant formula shortage lasted for months, leaving many parents on their own to find supply, sometimes across multiple states. Recalls for Cronobaqcter sakazakii illnesses associated with powdered infant formula contributed to the national shortage. The national shortage forced the Biden Administration to open its domestic formula market to the supply from imports. Almost no foreign formula was allowed into the U.S. previously. (To sign up for a free subscription to Food Safety News, click here .)",
        "pubDate": "2023-12-15 05:05:00",
        "image_url": null,
        "source_id": "foodsafetynews",
        "source_priority": 21076,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      },
      {
        "article_id": "d8b96bd871b6fd50f0e106223f325dee",
        "title": "Patient count nears 300 in outbreak linked to North Carolina sushi restaurant",
        "link": "https://www.foodsafetynews.com/2023/12/patient-count-nears-300-in-outbreak-linked-to-north-carolina-sushi-restaurant/",
        "keywords": [
          "Foodborne Illness Investigations",
          "Foodborne Illness Outbreaks",
          "norovirus",
          "sushi",
          "Sushi Nine"
        ],
        "creator": [
          "News Desk"
        ],
        "video_url": null,
        "description": "There are now 241 complaints from patrons of a sushi restaurant in Raleigh, NC, about foodborne illnesses. The complaints against Sushi Nine began Nov. 28, according to local health department officials. The suspected pathogen is norovirus, with at least three restaurant customers testing positive. The number of sick people is growing quickly with 100 more... Continue Reading",
        "content": "There are now 241 complaints from patrons of a sushi restaurant in Raleigh, NC, about foodborne illnesses. The complaints against Sushi Nine began Nov. 28, according to local health department officials. The suspected pathogen is norovirus, with at least three restaurant customers testing positive. The number of sick people is growing quickly with 100 more reporting becoming sick since the previous update on Dec, 9. Wake County Public Health and Wake County Environmental Services are investigating the outbreak. “Unfortunately, norovirus can spread very easily, especially during holiday gatherings and parties, which include a lot of meal prep and catering,” Wake County Public Health Director Rebecca Kaufman said. “We continue to work closely with customers who visited Sushi Nine, restaurant staff and our partners with NCDHHS (North Carolina Department of Health and Human Services) to determine the source and extent of the outbreak.” Owners of Sushi Nine closed the restaurant for two days for cleaning, but it has since reopened. About norovirus Symptoms of norovirus infection may include vomiting and/or diarrhea, nausea, muscle aches, fever, and headache, according to the Centers for Disease Control and Prevention. Symptoms typically start 12 to 48 hours after exposure and can last for one to three days. Most people recover without treatment, however some may need medical attention for dehydration. People with norovirus infections can spread the infection easily to others. The virus can live on surfaces for long periods of time. (To sign up for a free subscription to Food Safety News, click here)",
        "pubDate": "2023-12-15 05:03:00",
        "image_url": null,
        "source_id": "foodsafetynews",
        "source_priority": 21076,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      },
      {
        "article_id": "1eed7d214f1044a248d2455bcb72df5e",
        "title": "FSA steps up response to Salmonella in Polish poultry products",
        "link": "https://www.foodsafetynews.com/2023/12/fsa-steps-up-response-to-salmonella-in-polish-poultry-products/",
        "keywords": [
          "Enforcement",
          "Foodborne Illness Outbreaks",
          "World",
          "Animal and Plant Health Agency",
          "animal contact",
          "E coli O157",
          "E. coli O26",
          "eggs",
          "Food Standards Agency (FSA)",
          "Poland",
          "poultry products",
          "Salmonella",
          "salmonellosis"
        ],
        "creator": [
          "Joe Whitworth"
        ],
        "video_url": null,
        "description": "More information has been shared by the Food Standards Agency (FSA) about Salmonella in poultry meat and eggs from Poland. There have been 200 cases of salmonellosis this year in the United Kingdom caused by different strains of Salmonella Enteritidis linked to such products. FSA has investigated more than 90 incidents in the past two... Continue Reading",
        "content": "More information has been shared by the Food Standards Agency (FSA) about Salmonella in poultry meat and eggs from Poland. There have been 200 cases of salmonellosis this year in the United Kingdom caused by different strains of Salmonella Enteritidis linked to such products. FSA has investigated more than 90 incidents in the past two years, with two outbreaks linked to eggs and three to poultry meat from Poland this year. The FSA, Food Standards Scotland (FSS), and the UK Health Security Agency (UKHSA) recently told consumers to take care when handling and cooking chicken, turkey, and duck products at home. Catering sites are using the majority of imported eggs. Repeated problems frustrate FSA Emily Miles, FSA chief executive, and Christine Middlemiss, chief veterinary officer, wrote a letter to the European Commission and the chief veterinary officer in Poland to flag the rise in cases involving Polish poultry and eggs. Information on the number of establishments involved was shared with Polish authorities. “Each time we have detected a specific food safety concern we have acted promptly to keep consumers safe, but we are unhappy about the repeated occurrences,” said Miles. An incident management group has been created to coordinate activities across government departments, including Defra and UKHSA, to move efforts from responding on a case-by-case basis to a more holistic approach. FSA said the Poland problem comes when it is experiencing an unexpected spike in other incidents and outbreaks. As part of the Border Target Operating Model (BTOM), pre-notifications would be required for EU commodities beginning at the end of January. Physical checks are planned beginning in April. However, it is possible to use existing regulations to do additional controls earlier if necessary. The British Poultry Council (BPC) wants to see authorities checking every load from Poland and rejecting those not meeting requirements. Richard Griffiths, BPC chief executive, said: “We have long established and rigorous processes to deal with Salmonella, and we follow these to the letter to produce food people trust and value. It is disappointing that Poland cannot do the same and is willing to export its hygiene problems instead of dealing with them.” The UK Office for Sanitary and Phytosanitary (SPS) Trade Assurance is undertaking an audit of Poland in April 2024 to evaluate the controls in place. In November, the UK hosted the annual Trade Specialised Committee on Sanitary and Phytosanitary Measures under the EU/UK Trade and Co-operation Agreement. FSA requested discussions on improving cooperation and information sharing on food safety incidents. Talks are expected to be held in early 2024. E. coli outbreak due to animal contact Meanwhile, the Animal and Plant Health Agency (APHA) was part of a team investigating a Shiga-toxin-producing E. coli (STEC) human outbreak that was epidemiologically linked to an animal-contact visitor attraction. In a report covering activities from July to September, the agency said STEC O157 and STEC O26 were behind the outbreak. Environmental sampling at the premises detected STEC O26 in a children’s play area; other areas were also positive for STEC. E. coli was confirmed in all 32 samples of animal feces taken. Although some STECs were detected, they were not O157 or O26. The site closed voluntarily after being told of human illnesses. Local authority and APHA visits identified deficiencies in compliance with the relevant industry code of practice. The most common issues at animal contact attractions include suboptimal handwashing facilities, poor supervision of animal contact, contamination of walkways with soiled animal bedding or feces, and unclear marking of animal contact versus non-contact areas. Work at the premises to rectify deficiencies improved the situation before a phased reopening. APHA also said there were no cryptosporidiosis investigations during the third quarter of 2023. (To sign up for a free subscription to Food Safety News, click here . )",
        "pubDate": "2023-12-15 05:02:00",
        "image_url": null,
        "source_id": "foodsafetynews",
        "source_priority": 21076,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      },
      {
        "article_id": "691360af760dec4a9b7072d5709b6897",
        "title": "Citizens of two more countries share food safety insights",
        "link": "https://www.foodsafetynews.com/2023/12/citizens-of-two-more-countries-share-food-safety-insights/",
        "keywords": [
          "Consumer Education",
          "World",
          "Bosnia and Herzegovina",
          "consumer survey",
          "Eurobarometer",
          "European Food Safety Authority (EFSA)",
          "Kosovo"
        ],
        "creator": [
          "News Desk"
        ],
        "video_url": null,
        "description": "Food safety was either the top or the second most important thing when buying food for people in Bosnia, Herzegovina, and Kosovo. In Kosovo, 57 percent said food safety was the main factor, with cost being second. In Bosnia and Herzegovina, cost was first with 64 percent, followed by food safety with 54 percent. It... Continue Reading",
        "content": "Food safety was either the top or the second most important thing when buying food for people in Bosnia, Herzegovina, and Kosovo. In Kosovo, 57 percent said food safety was the main factor, with cost being second. In Bosnia and Herzegovina, cost was first with 64 percent, followed by food safety with 54 percent. It is the first Eurobarometer food safety poll to include people’s views in Bosnia, Herzegovina, and Kosovo. Albania, Montenegro, North Macedonia, Serbia, and Turkey also took part in the survey, commissioned by the European Food Safety Authority (EFSA), in 2019. These seven countries are aiming to join the EU at some point in the future. Bosnia and Herzegovina findings The survey in Bosnia and Herzegovina and Kosovo was carried out between May and June 2023, with more than 2,000 respondents from different social and demographic groups being interviewed face-to-face in their language. Overall, 69 percent of respondents in Bosnia and Herzegovina said they were personally interested in food safety, compared to the EU average of 70 percent. People had mainly heard about additives like colors, preservatives, or flavorings used in food or drinks and food poisoning from items contaminated by bacteria, viruses, and parasites. The latter was also a major concern of citizens, alongside genetically modified ingredients. The top reason given not to engage with food safety was “I know enough to avoid or mitigate food risks.” Barbara Gallani, head of EFSA’s communications and partnership department, said: “Together with our partners in EU member states and in pre-accession countries our cooperation on communication has benefitted from generating insights from social research like the Eurobarometer. “We can better understand the concerns and needs of audiences to help make our communications more impactful. This collaboration is already bearing fruit for use in campaigns we run jointly and as input for our national partners when they need to communicate directly with their citizens.” Kosovo results A total of 78 percent of respondents in Kosovo said they were interested in the topic of food safety, which was above the EU average. Participants mainly had heard and were concerned about food poisoning from items contaminated by bacteria, viruses, and parasites. Reasons not to engage with food safety were split between taking it for granted food was safe, knowing enough to avoid or mitigate risks, and finding food safety information highly technical and complex. A recent assessment of food safety control systems by the European Commission found Bosnia and Herzegovina had a way to go to meet EU standards. While Kosovo had made progress, the country’s food agency needed more financial and human resources. EFSA is also running a tender process to help pre-accession countries build capacities to address future food-related crises. These nations include Albania, Bosnia and Herzegovina, Kosovo , Montenegro, North Macedonia, Serbia and Turkey. One of the objectives is to develop annual training plans and materials, covering two-day workshops in 2024, 2025, and 2026 with different training formats such as case studies, desktop exercises, and mock exercises, plus a simulation covering an urgent response to a multi-country animal or public health outbreak related to biological hazards, animal health and welfare, plant health, and chemical hazards. Expected outcomes of the training are enhanced urgent response capacities in risk assessment and risk communication and improved crisis preparedness procedures. The tender process is open until Jan. 2, 2024. (To sign up for a free subscription to Food Safety News, click here .)",
        "pubDate": "2023-12-15 05:01:00",
        "image_url": null,
        "source_id": "foodsafetynews",
        "source_priority": 21076,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      },
      {
        "article_id": "3ea83a9e949364b4782398a50e1ed06c",
        "title": "Follow These 12 Golden Rules of Decluttering",
        "link": "https://www.popsugar.com/smart-living/Declutter-Rules-34388673",
        "keywords": [
          "Home Organization",
          "Productivity",
          "Cleaning"
        ],
        "creator": [
          "Emily Co"
        ],
        "video_url": null,
        "description": "Has your place been looking a little . . . clogged up lately? Well, it may be time to do some organizing! The new year is the perfect time to declutter, streamline, and organize your space so that you can tackle all the other goals you have for 2024. If you want some help to get started, look no further: we've got the 12 golden rules of decluttering all laid out for you below. 1. Get rid of duplicates If you have duplicates lying around, get rid of them if they are not necessary. Keep the better duplicate and trash or donate the other. 2. Get rid of things you haven't used in a year So you keep telling yourself that you'll use it eventually. But if you haven't touched it in a year, chances are that you're not going to in the near future. Do your home a favor and get rid of the items that aren't getting any use. 3. Digitize nostalgic items Do you have too many nostalgic items that you can't seem to get yourself to give away? Take photos of them and then get rid of them - you'll be able to keep them around forever without cluttering up your space. 4. Don't keep items out of guilt I'm sure you have a thing or two around the house that you keep out of guilt. Perhaps it's a sweater sweet aunt Betty knitted for you for Christmas that you never wear or that fancy dress you splurged way too much on. Time to be brutal and get rid of them all. 5. Put things back where they belong It's easy to just leave things lying around, but that's how clutter builds up. After you're done using something, immediately put it back where it belongs so you won't procrastinate. 6. And find a home for them Make sure every item in your home has a place, whether it's a plastic container or an under-the-bed organizer. And remember: a pile of items is not a true place for your things. 7. Sell, give away, donate, upcycle, or throw away When assessing things you want to get rid of, start by seeing if you can make some of your money back by selling it. If you don't think it's worth the effort to sell, give it away to people you know who will use it. Perhaps to your family and friends, or even your Facebook network. You can also choose to donate it to get a tax write-off. 8. Don't keep items you wouldn't buy now Are there some items you have that you would never buy now? Perhaps you should take a good hard look at them and figure out why you need them now and if you can do without them. 9. Opt for covered furniture If you have a clutter problem, choose furniture that is covered, such as a closet with a sliding door instead of open shelves. This will help your place look cleaner and more organized. 10. Don't forget storage under your bed There's a lot of real estate in your home that's not being put to good use; one that people often forget about is under-the-bed storage. 11. Think tall Use up all the space in your home to make the most of it, including the vertical space. The more space you have for your stuff, the less likely it's going to get cluttered up. 12. Evaluate your spending If you're buying things you don't need, take a hard look at your spending. Perhaps you need to take part in a 30-day spending hiatus to motivate yourself. Related: This 30-Day Challenge Will Get Your House Organized, Clean, and Clutter-Free",
        "content": "Has your place been looking a little . . . clogged up lately? Well, it may be time to ! The new year is the perfect time to declutter, streamline, and organize your space so that you can tackle all the other goals you have for 2024. If you want some help to get started, look no further: we've got the 12 golden rules of decluttering all laid out for you below. If you have duplicates lying around, get rid of them if they are not necessary. Keep the better duplicate and trash or donate the other. So you keep telling yourself that you'll use it eventually. But if you haven't touched it in a year, chances are that you're not going to in the near future. Do your home a favor and get rid of the items that aren't getting any use. Do you have too many nostalgic items that you can't seem to get yourself to give away? Take photos of them and then get rid of them — you'll be able to keep them around forever without cluttering up your space. I'm sure you have a thing or two around the house that you keep out of guilt. Perhaps it's a sweater sweet aunt Betty knitted for you for Christmas that you never wear or that fancy dress you splurged way too much on. Time to be brutal and get rid of them all. It's easy to just leave things lying around, but that's how clutter builds up. After you're done using something, immediately put it back where it belongs so you won't procrastinate. Make sure every item in your home has a place, whether it's a plastic container or an under-the-bed organizer. And remember: a pile of items is not a true place for your things. When assessing things you want to get rid of, start by seeing if you can make some of your money back by selling it. If you don't think it's worth the effort to sell, give it away to people you know who will use it. Perhaps to your family and friends, or even your Facebook network. You can also choose to donate it to get a tax write-off. Are there some items you have that you would never buy now? Perhaps you should take a good hard look at them and figure out why you need them now and if you can do without them. If you have a clutter problem, choose furniture that is covered, such as a closet with a sliding door instead of open shelves. This will help your place look cleaner and more organized. There's a lot of real estate in your home that's not being put to good use; one that people often forget about is under-the-bed storage. Use up all the space in your home to make the most of it, including the vertical space. The more space you have for your stuff, the less likely it's going to get cluttered up. If you're buying things you don't need, take a hard look at your spending. Perhaps you need to take part in a to motivate yourself.",
        "pubDate": "2023-12-14 23:40:04",
        "image_url": "https://media1.popsugar-assets.com/files/thumbor/jObRRkS_aeBIVA2j7tw664xuvs8/fit-in/160x160/filters:format_auto-!!-:strip_icc-!!-/2014/09/18/988/n/1922441/30839912430bbbfe_thumb_temp_image8452581411048818.jpg",
        "source_id": "popsugar",
        "source_priority": 598,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      },
      {
        "article_id": "39c6cc23d2a927c675ef421ba56ec291",
        "title": "FDA releases retailer lists for stone fruit linked to deadly Listeria outbreak",
        "link": "https://www.foodsafetynews.com/2023/12/fda-releases-retailer-lists-for-stone-fruit-linked-to-deadly-listeria-outbreak/",
        "keywords": [
          "Food Recalls",
          "Foodborne Illness Investigations",
          "Foodborne Illness Outbreaks",
          "Aldi",
          "Food Lion",
          "H.E.Butt",
          "Listeria",
          "nectarines",
          "peaches",
          "plums",
          "Sam's Club",
          "Sprouts Farmers Market",
          "stone fruit",
          "Walmart"
        ],
        "creator": [
          "News Desk"
        ],
        "video_url": null,
        "description": "Retailer lists are now available for peaches, nectarines and plums linked to a Listeria outbreak that has killed one person and sickened others. Samples from sick people were collected from Aug. 22, 2018, to Aug. 16, this year. The outbreak is considered ongoing by the Centers for Disease Control and Prevention. The sick people are... Continue Reading",
        "content": "Retailer lists are now available for peaches, nectarines and plums linked to a Listeria outbreak that has killed one person and sickened others. Samples from sick people were collected from Aug. 22, 2018, to Aug. 16, this year. The outbreak is considered ongoing by the Centers for Disease Control and Prevention. The sick people are spread across seven states and all of them have required hospitalization. Whole genome sequencing has allowed public health officials to match patients across several years, all with the outbreak strait of Listeria monocytogenes. The Food and Drug Administration has also found the pathogen on samples of peaches from the producer. Anyone who ate recalled peaches, plums or nectarines in recently should monitor themselves for seven weeks after eating the fruit for signs of Listeria infection. Symptoms are listed below. The FDA continues to work to find out what retailers may have received recalled fruit associated with this outbreak. The agency has released a list of retailers and the states where the recalled fruit has been distributed. The fruit is past its sell-by date, but there is concern that consumers may have frozen some of it for future use. The recalled fruit was distributed to the following stores and states: In response to this investigation, HMC Farms has voluntarily recalled all of its peaches, plums, and nectarines sold in retail stores from May 1, 2022, through Nov. 15, 2022, and from May 1, 2023, through Nov. 15, 2023. The recalled fruit was sold at retail stores as individual pieces of fruit bearing PLU stickers or in consumer packaging; however, the recalled fruit is no longer available for sale and any previously purchased fruit should be past shelf life. If you previously purchased recalled fresh peaches, plums and nectarines and then froze them, you should throw them away if they are part of the recall or if you cannot tell if they are part of the recall. Fresh whole peaches, plums, and nectarines currently available for sale at retail are not included in this recall. About Listeria infections Food contaminated with Listeria monocytogenes may not look or smell spoiled but can still cause serious and sometimes life-threatening infections. Anyone who has eaten any of the recalledfruitand developed symptoms of Listeria infection should seek medical treatment and tell their doctors about the possible Listeria exposure. Also, anyone who has eaten any of the recalled products should monitor themselves for symptoms during the coming weeks because it can take up to 70 days after exposure to Listeria for symptoms of listeriosis to develop. Symptoms of Listeria infection can include vomiting, nausea, persistent fever, muscle aches, severe headache, and neck stiffness. Specific laboratory tests are required to diagnose Listeria infections, which can mimic other illnesses. Pregnant women, the elderly, young children, and people such as cancer patients who have weakened immune systems are particularly at risk of serious illnesses, life-threatening infections, and other complications. Although infected pregnant women may experience only mild, flu-like symptoms, their infections can lead to premature delivery, infection of the newborn, or even stillbirth. (To sign up for a free subscription to Food Safety News, click here)",
        "pubDate": "2023-12-14 23:11:00",
        "image_url": null,
        "source_id": "foodsafetynews",
        "source_priority": 21076,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      },
      {
        "article_id": "a7e502dc2220a9dc9f7caac874f063e0",
        "title": "Glamorous near-century-old SF rooftop bar is finally making its return",
        "link": "https://www.sfgate.com/food/article/starlight-room-sf-returns-18554470.php",
        "keywords": null,
        "creator": [
          "Madeline Wells"
        ],
        "video_url": null,
        "description": "The Union Square rooftop bar once known as the Starlight Room is being reborn.",
        "content": null,
        "pubDate": "2023-12-14 21:47:05",
        "image_url": null,
        "source_id": "sfgate",
        "source_priority": 1360,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      },
      {
        "article_id": "b950132a9105ae690e92db8196351b5b",
        "title": "The world now has a roadmap for food and climate. But it’s missing a few things",
        "link": "https://www.salon.com/2023/12/14/the-world-now-has-a-roadmap-for-and-climate-but-its-missing-a-few-things_partner/",
        "keywords": [
          "All Salon",
          "Food",
          "climate",
          "Food",
          "Grist",
          "partner"
        ],
        "creator": [
          "Max Graham"
        ],
        "video_url": null,
        "description": "“Industrial food systems are locked into fossil-fuel dependency\"",
        "content": null,
        "pubDate": "2023-12-14 21:00:02",
        "image_url": "https://media.salon.com/2021/02/cattle-at-pasture-0210211.jpg",
        "source_id": "salon",
        "source_priority": 3715,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      },
      {
        "article_id": "d4a24fb5464c6b8a0030e5aec6382938",
        "title": "A beloved 67-year-old Calif. general store might close permanently",
        "link": "https://www.sfgate.com/food/article/california-market-closure-fieldbrook-18554706.php",
        "keywords": null,
        "creator": [
          "Nico Madrigal-Yankowski"
        ],
        "video_url": null,
        "description": "The Humboldt County market specializes in burgers, sandwiches and ramen.",
        "content": null,
        "pubDate": "2023-12-14 20:42:09",
        "image_url": null,
        "source_id": "sfgate",
        "source_priority": 1360,
        "country": [
          "united states of america"
        ],
        "category": [
          "food"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702586529446641148"
  }