{
    "status": "success",
    "totalResults": 298,
    "results": [
      {
        "article_id": "08fdef5b0b9c77327dedea548d8d914e",
        "title": "Big Meat just can’t quit antibiotics",
        "link": "https://www.vox.com/future-perfect/2023/1/8/23542789/big-meat-antibiotics-resistance-fda",
        "keywords": null,
        "creator": [
          "Kenny Torrella"
        ],
        "video_url": null,
        "description": null,
        "content": "The US Food and Drug Administration (FDA) knew that America’s meat industry had a drug problem. For decades, evidence had amassed that the widespread use of antibiotics to make livestock grow faster — and survive the crowded, unsanitary conditions of factory farms — was causing bacteria to mutate and develop resistance to antibiotics used in human medicine. Over time, once easily treatable human infections, such as urinary tract infections and tuberculosis, became to treat. A foundational component of modern medicine was starting to crumble. But it wasn’t until the mid-2010s that the FDA finally took the basic steps of requiring farmers to get veterinary prescriptions for antibiotics and banning the use of antibiotics to make animals grow faster — steps that some European regulators had taken a decade or more prior. Thanks to those two actions alone, sales of medically important antibiotics for livestock plummeted 42 percent from 2015 to 2017. But in a concerning course reversal, antibiotic sales for use in livestock have ticked back up, increasing 12 percent from 2017 to 2022, per a new . Sales increased 4 percent in 2022 alone. In 2022, the chicken industry’s antibiotics purchasing slightly declined, but in every other major sector — cattle, pork, and turkey — antibiotic sales rose. “Antibiotic sales to meat producers continue to increase despite efforts that the FDA has made,” Louis Sokolow, a policy associate with Frontier Group, a public health and sustainability research organization, told Vox. “The status quo of these small increases year over year is not enough to protect people from antibiotic-resistant bacteria.” According to an published in September by the Natural Resources Defense Council and One Health Trust, medically important antibiotics are increasingly going to livestock instead of humans. In 2017, the meat industry purchased 62 percent of the US supply. By 2020, it rose to 69 percent. It’s a sobering turn of events with life-and-death implications. In 2019, antibiotic-resistant bacteria directly killed over globally, including , and more than 5 million others across the world died from diseases where antibiotic resistance played a role — far more than the global toll of HIV/AIDS or malaria, leading the World Health Organization to antibiotic resistance “one of the biggest threats to global health, food security, and development today.” Public health advocates want to see the FDA take the threat much more seriously, and often point to Europe as a . From 2011 to 2022, antibiotic sales for use in livestock fell across the European Union, and use per animal is now that of the US. Last year, the EU implemented perhaps its most significant reform yet: banning the routine use of antibiotics to prevent disease, reserving their use for only when animals are actually sick. It’s unlikely the FDA will follow in Europe’s footsteps any time soon. Asked about an EU-style ban on preventive use of antibiotics, an FDA spokesperson responded, “The laws in the US and our livestock population are not the same as that of the EU or other countries. The FDA’s initiatives to promote judicious use and reduce AMR [antimicrobial resistance] were devised specifically for the US and the conditions we face with the aim of maximizing effectiveness and cooperation of drug sponsors, veterinarians, and animal producers.” The FDA and the US food industry have proven that they can make progress on the issue — but to keep antibiotics working, they need to do a lot more. That will require them to tackle beef and pork, two of the more stubborn and complex sectors of America’s meat system that just can’t seem to quit antibiotics, since doing so could demand substantive changes to how animals are farmed for food. The American antibiotic-free revolution that wasn’t It wasn’t just the FDA’s new rules that caused antibiotic sales for livestock to plunge in a two-year period — Big Chicken played a part too. In the early 2000s, the nation’s fourth-largest chicken producer began efforts to wean its birds off antibiotics, which it achieved in 2016 by changing chickens’ diets and replacing antibiotics with vaccines and probiotics. At first, chicken raised without antibiotics cost 50 percent more, but the company says it has since been able to all but close the cost differential. In the mid-2010s, while Perdue was making progress, activists leveraged the momentum and McDonald’s to source chicken raised without medically important antibiotics which contributed to a domino effect in which producers and restaurants made further pledges to reduce antibiotics in poultry. By 2020, a little of America’s 9 billion chickens farmed for meat were raised without antibiotics, according to an . The sea change in chicken production demonstrated it was possible to quickly scale down antibiotics in farming, but it didn’t do much to reduce overall use, as the chicken industry only used 6 percent of antibiotics in agriculture in 2016. And the momentum didn’t spread to other parts of the meat business, like beef and pork, which together account for over of medically important antibiotics fed to farmed animals. Some of the lack of progress in beef and pork comes down to the simple fact that pigs and cattle are raised differently than chickens. Chickens are slaughtered at just six or seven weeks old, so the chance they’ll get sick is lower than pigs, who are slaughtered at six months old, or cattle, slaughtered at around three years of age. The chicken industry is also vertically integrated, meaning a company like Tyson or Perdue controls virtually every link in the supply chain, so making big changes like cutting out antibiotics is easier than in the more decentralized supply chain of beef. For example, the typical steer will change hands several times before slaughter, going from a breeder to pasture grazing to a feedlot, all of which make it harder to coordinate an antibiotic-free regimen. In the last few months of their life cattle are also fed a high-grain diet that they aren’t adapted to digest, which increases the chance they’ll develop a , a condition that’s prevented with antibiotics. The pork sector, like poultry, is also vertically integrated, but the industry has largely opposed , , and reforms. Antibiotics in pig production shot up from 2017 to 2022. There’s also no pork or beef giant that’s taken the antibiotic-free leap like Perdue did for chicken. That could change in the years ahead: McDonald’s, the world’s largest beef purchaser, at the end of 2022 that it plans to reduce antibiotic use in its beef supply chain. However, the announcement didn’t come with a timeline, which . Although voluntary change can move the needle, without regulation, industry has little incentive to make the dramatic reductions needed to safeguard antibiotics. While the FDA has prohibited meat producers from using antibiotics to speed up growth— their in agriculture — some of the that , like tylosin, are still allowed for disease prevention. Matthew Wellington, formerly of the Public Interest Research Group, or PIRG, told Vox this is a that disincentivizes producers from reducing antibiotics: “Our concern has always been that they’re just putting a different name on the same kind of use, which is a problem.” (This story was originally published in January 2023; Wellington has since left PIRG). In response to this concern, an FDA spokesperson said, “Veterinarians are on the front lines and as prescribers, they’re in the best position to ensure that both medically important and non-medically important antimicrobials are being used appropriately.” Aside from outright banning the routine use of medically important antibiotics to prevent disease, PIRG would like to see the FDA take three actions: set a target of reducing antibiotic use by 50 percent by the end of 2025 (based on 2010 levels); publish data on antibiotic use, not just sales; and limit the duration of antibiotic courses for farmed animals. An FDA spokesperson said specific reduction targets weren’t possible because the agency doesn’t know how many antibiotics farmers are using: “We cannot effectively monitor antimicrobial use without first putting a system in place for determining [a] baseline and assessing trends over time.” The agency right now only collects sales data, and it’s been exploring a to collect and report real-world use data. Some states haven’t waited on federal regulators: have both restricted the use of antibiotics on farms. How the Europeans — and some Americans — are quitting antibiotics on the farm Just because it’s difficult to reduce antibiotics in beef and pork production doesn’t mean it’s impossible, as the story of Iowa pig farmers Tim and Deleana Roseland demonstrates. In 2005, they switched from raising pigs in the conventional manner — tightly cramped and fed a steady diet of antibiotics — to raising pigs for Niman Ranch, a higher-welfare meat company now owned by Perdue. That required the Roselands to ditch the routine use of antibiotics. “I was nervous about it at first but as it turned out, it was no big deal whatsoever,” Tim Roseland said. But he added that it wouldn’t have been possible with his old setup: “There’s too much overcrowding, small pens, too many pigs crammed into a little area.” Their newer system gives each pig more space in larger pens, and bedding that they root through and chew on, instead of, when they’re packed into factory farms, chewing on each other. They also give the pigs more vaccines and feed them probiotics. And there’s a lot to learn from Denmark, Europe’s pork producer. From 1992 to 2008, antibiotic use per pig fell by over 50 percent, and while pig mortality went up in the short term, by 2008 it had dropped back to near-1992 levels. The small country’s transformation wasn’t a matter of rocket science, but a suite of smart : more frequent barn cleaning, better ventilation, later piglet weaning, more space per pig, , and experimenting with feed and additives. All this comes with difficult tradeoffs: antibiotic-free pork costs more and requires more land, which increases its carbon footprint. But we can’t expect to have cheap meat forever without a cost to public health, an uncomfortable truth that’s led many environmental and public health groups to champion a message of meat. “I think the fact that Denmark, despite very low antibiotic use since 1995, is still one of the biggest pork exporters in the world, already speaks for itself,” said Francesca Chiara, a director at the University of Minnesota’s Center for Infectious Disease Research and Policy. Given the of global antibiotic sales for agriculture, Denmark’s example may not be speaking loudly enough. But it’s time we listen — nothing less than the future of human medicine is at stake.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://cdn.vox-cdn.com/thumbor/KeisDNwx0XG3IGlSeK887CqPOJo=/444x0:4000x2667/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71839246/GettyImages_957346802.0.jpg",
        "source_id": "vox",
        "source_priority": 889,
        "country": [
          "united states of america"
        ],
        "category": [
          "health",
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "bb44b46fe1ac127357c81e83db7ad155",
        "title": "A new approach to measuring what’s going on in our minds",
        "link": "https://www.vox.com/future-perfect/2023/12/15/24001424/consciousness-complexity-neuroscience-mental-health",
        "keywords": null,
        "creator": [
          "Oshan Jarow"
        ],
        "video_url": null,
        "description": null,
        "content": "Sometimes when I’m looking out across the northern meadow of Brooklyn’s Prospect Park, or even the concrete parking lot outside my office window, I wonder if someone like Shakespeare or Emily Dickinson could have taken in the same view and seen I don’t mean making out blurry details or more objects in the scene. But through the lens of their minds, could they encounter the exact same world as me and yet have a richer experience? One way to answer that question, at least as a thought experiment, could be to compare the electrical activity inside our brains while gazing out upon the same scene, and running some statistical analysis designed to actually tell us whose brain activity indicates more richness. But that’s just a loopy thought experiment, right? Not exactly. One of the newest frontiers in the science of the mind is the consciousness’s “complexity,” or how diverse and integrated electrical activity is across the brain. Philosophers and neuroscientists alike that more complex brain activity signifies “richer” experiences. The idea of measuring complexity stems from — a mathematical approach to understanding how information is stored, communicated, and processed —which doesn’t provide wonderfully intuitive examples of what more richness actually means. Unless you’re a computer person. “If you tried to upload the content onto a hard drive, it’s how much memory you’d need to be able to store the experience you’re having,” , a professor of machine learning and data science at the University of Sussex, told me. Another approach to understanding richness is to look at how it changes in different mental states. Recent studies have found that are lowest in patients under general anesthesia, higher in ordinary wakefulness, and higher still in psychedelic trips, which can notoriously turn even the most mundane experiences — say, my view of the parking lot outside my office window — into . Increasing richness isn’t just like cranking up the color saturation of a picture or getting a bigger hard drive. It seems to imply an increase in the depth of how we experience the world. Complexity is what you see in the equations, richness is what that feels like in the mind. Although measuring brain complexity is still in relative infancy, the nascent ability to gauge something like richness is a pretty incredible development — not only for but for how we think about well-being more broadly. With innovations like these, we can go beyond the , which doesn’t have an accepted neurological measure that can translate across social and cultural differences, and ask more targeted questions, like whether our experiences are richer. As these approaches mature, scientists might develop a deeper understanding of all the different, tractable ways that consciousness can change for the better. From staining neurons black to measuring the brain’s complexity In the 1800s, scientists studying the mind didn’t yet know what a neuron looked like, let alone how they worked. That breakthrough came in , when physician Camillo Golgi discovered that by immersing brain tissue in a potassium dichromate solution and then dunking it in a bath of silver nitrate, the neuron would turn black, making it visible under a microscope. The Spanish neuroscientist Santiago Ramón y Cajal, when observing newly stained neural tissue in 1887, discovered that contrary to the reigning reticular theory (which held that the nervous system was a continuous network of cells smushed together with no gaps), neurons were indeed separated from each other. Sprouting from the neuron’s edges were spindly little axons and dendrites, but they didn’t seem to create permanent bridges between the neurons, leading him to conclude that communication between neurons likely wasn’t all that important in explaining their main functions. Instead, individual neurons were taken as the nervous system’s fundamental units, or building blocks, an idea that solidified into “the .” Through the 20th century, developments in electrophysiology led to a sharper understanding of the connections between neurons, and the importance of the little electrical impulses that travel across synapses. But the basic perspective of focusing on neurons themselves, rather than the holistic electrical processes that they’re conduits for, remained dominant. This approach has gotten quite good at breaking the brain into distinct parts and explaining how they contribute to specific functions, like vision or controlling your fingers. The downside is that many theories of consciousness struggle with what’s called the — the question of how all the separate parts fit back together to generate a unified conscious experience. Recent improvements to electroencephalography (EEG, those skull caps with a bunch of electrodes that measure the brain’s electrical activity) made it possible to look deeper inside the workings of the brain, opening the way for neuroscientist Giulio Tononi and biologist Gerald Edelman’s 1998 paper: . Their publication was the first to propose a direct measure of the complexity of brain activity, an idea that matured into , or IIT. According to IIT, consciousness arises where the underlying neural activity is both “integrated” and “differentiated.” Integration refers, roughly, to how synchronized electrical activity is across the brain. Differentiation is the diversity of that activity. You can think of them in terms of weaving a tapestry. Integration is how many different threads are woven in, while differentiation is the variety of colors used. Together, these two determine the complexity of a given state of consciousness. That, in turn, approximates its richness. In theory, anyway. At the time, the idea ran ahead of technology. “It became apparent over the years that it’s quite hard to measure those two things simultaneously,” Barrett told me, “and it turned out that the differentiation aspect alone, without thinking about integration, did quite well at being able to distinguish between different states of consciousness.” That said, our measures are improving quickly. Barrett co-authored released as a pre-print last week that compared a new measure of complexity — what they call “statistical complexity” — to Lempel-Ziv complexity, which was first in 1976 and is still the field’s leading measure. While Lempel-Ziv captures only the differentiation aspect, their findings suggest that the new measure successfully brings integration back into the mix, affording greater precision. As progress continues, IIT may creep closer to its grand ambition: constructing an equation that can measure and describe the richness of conscious experience in any physical system, whether human, animal, or machine. “That fails at the moment,” said Barrett, “but I’m very interested in seeing if we could come up with a plausible equation. That’s sort of the holy grail for me.” So what do we make of richness? If a plausible equation isn’t the kind of thing that occupies your dreams, a concrete measure for something like richness could bring some sorely needed innovation to our ideas around . The Diagnostic and Statistical Manual of Mental Disorders (the DSM-5) contains diagnoses to help clinicians classify just about every shade of mental disorder they might encounter. When it comes to the positive dimensions of mental health, however, our language is comparatively sparse. “Happiness” is a very nebulous idea, especially when you . We in the West, unlike the Buddhists, have not developed rigorous taxonomies for all the rungs on the mental ladder — from our default modes to the ecstasies, grades of zest, or senses of “ ” that lurk in the (reportedly, anyway). If we can quantify the richness of our minds, maybe it could jumpstart the process of finding other tractable dimensions we can add to our conceptions of well-being. Of course, quantifying something important always (à la : when a measure becomes a target, it ceases to be a good measure), and being wise about how to make sense of these new ideas will be bumpy. It’s tempting, for example, to simply think that when it comes to richness, more is always better. But researchers, like 50 honoree , believe that the brain evolved to hold levels of complexity below a threshold called “criticality,” rather than just maximize it. In information theory, criticality marks the optimal balance of complexity for processing information, a perch between order and chaos. Or in terms of the mind, between the rigidity and flexibility of mental habits. Too much complex activity pushes the brain over the edge. That might offer a temporarily exciting state of mind (as psychedelic trips can), but in terms of efficiently processing information to be successful creatures in the world, a never-ending acid trip is probably not the ideal state. “A brain at criticality may be a ‘happier’ brain,” Carhart-Harris . If criticality means greater well-being calls for a particular balance of complexity, not just as much as we can muster, that doesn’t mean that we’re all, by default, naturally tuned to that balance. As our measures and technologies improve, maybe we’ll get better at identifying when someone’s ordinary brain activity is below criticality, and a burst of complexity could serve as a boon to well-being. Maybe we’ll develop new ways of growing richer, not just in our bank accounts (though that may help), but in the ways that we experience the world.",
        "pubDate": "2023-12-15 12:00:00",
        "image_url": "https://cdn.vox-cdn.com/thumbor/TNK1daUQuXbAdowaleGb0vQaPFY=/22x0:5295x3955/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/72965618/GettyImages_152195326.0.jpg",
        "source_id": "vox",
        "source_priority": 889,
        "country": [
          "united states of america"
        ],
        "category": [
          "health",
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "640dcb9b067b5f6fb7550d8c956701eb",
        "title": "It's been 50 years since homosexuality was removed from a list of mental illnesses",
        "link": "https://www.npr.org/2023/12/15/1219512050/its-been-50-years-since-homosexuality-was-removed-from-a-list-of-mental-illnesse",
        "keywords": null,
        "creator": [
          "Steve Inskeep"
        ],
        "video_url": null,
        "description": "It's been 50 years since the American Psychiatric Association removed homosexuality from its list of mental disorders, a milestone that helped change the perception of LGBTQ+ people in America.",
        "content": "It's been 50 years since the American Psychiatric Association removed homosexuality from its list of mental disorders, a milestone that helped change the perception of LGBTQ+ people in America.",
        "pubDate": "2023-12-15 11:56:58",
        "image_url": "https://media.npr.org/include/images/tracking/npr-rss-pixel.png?story=1219512050",
        "source_id": "npr",
        "source_priority": 118,
        "country": [
          "united states of america"
        ],
        "category": [
          "health"
        ],
        "language": "english"
      },
      {
        "article_id": "d89448cadc71037c4972cf6f7a4d044a",
        "title": "5 Exercises to Counter the Bizarre Symptoms of Raynaud’s Phenomenon",
        "link": "https://www.theepochtimes.com/health/5-exercises-to-counter-the-bizarre-symptoms-of-raynauds-phenomenon-5515639",
        "keywords": [
          "uncategorized",
          "Raynaud's syndrome",
          "circulation"
        ],
        "creator": [
          "Kevin Shelley"
        ],
        "video_url": null,
        "description": "Raynaud's phenomenon is characterized by abrupt, unsettling, and painful symptoms. Specific exercises have been shown to reduce these symptoms.",
        "content": "In this series, occupational therapist Kevin Shelley focuses on common types of arthritis and simple exercises to improve joint mobility and reduce pain. She suddenly found it difficult to use her fingers and was shocked to see a pale, bluish-white flush spread across them from her fingertips all the way up to her fingers' middle joints. She simultaneously experienced several sensations: numbness coupled with prickly, tingling pain. Later, when her fingers morphed from the pale, bluish-white pallor into a bright, rosy redness, they burned incessantly. This was her first experience with Raynaud’s phenomenon. \"Only one in 10 seeks treatment,\" the association's website reads. Chronic Hand Pain: Often Caused by Overuse, a Therapist's Top 6 Exercises for Relief Rheumatoid Arthritis Relief: This Ancient Therapy's Benefits for Pain and Swelling Raynaud’s phenomenon (also known as Raynaud’s disease or syndrome) is characterized by abnormal vasoconstriction of the small blood vessels of the fingers and toes. It most often affects the fingers and, in rare cases, the ears and nose. Primary: This is the most common form and isn’t a result of another medical condition. When mild, many people don’t seek treatment. Secondary: This is associated with another health condition, such as rheumatoid arthritis, lupus, scleroderma, or Sjogren’s syndrome. Medications can also play a role. Certain blood pressure, migraine, and attention-deficit/hyperactivity disorder medications can exacerbate Raynaud’s syndrome. Smoking is also a risk factor because it narrows the blood vessels. Although exposure to cold temperatures remains the most common cause of flare-ups, repetitive actions or vibrations (such as using jackhammers, typing, or playing the piano) can also trigger bouts of Raynaud’s. Bouts of Raynaud’s syndrome are generally temporary, but some people can have episodes frequent enough or long enough to develop skin ulcers and even gangrene in affected areas. Daily exercise to boost cardiovascular health to ensure maximal circulation throughout your body Exercises to address acute episodes, especially for people who have frequent or sustained Raynaud’s presentations Palm-to-Palm Palm-to-Dorsum (Back of Hand) Dorsal Presentation (Palm up on Bottom Arm) Ventral Presentation (Palm Down on Bottom Arm) Palm-to-Palm Palm-to-Dorsum (Back of Hand) Closing and opening your hands counts as one repetition. Perform 20 repetitions per set and a total of three sets. Although the overall management of Raynaud’s phenomenon is best conducted under medical supervision, these exercises can help decrease the severity and duration of acute Raynaud’s vasoconstriction episodes. Next: Rheumatoid arthritis is an autoimmune disorder that affects the joints. Exercise is key to reducing symptoms and improving joint function and flexibility.",
        "pubDate": "2023-12-15 11:00:58",
        "image_url": null,
        "source_id": "theepochtimes",
        "source_priority": 10731,
        "country": [
          "united states of america"
        ],
        "category": [
          "health"
        ],
        "language": "english"
      },
      {
        "article_id": "021e2998319008e5b4281dd2360e9d13",
        "title": "Research shows a big increase in children taking melatonin",
        "link": "https://www.npr.org/2023/12/15/1219513833/research-shows-a-big-increase-in-children-taking-melatonin",
        "keywords": null,
        "creator": [
          "Maria Godoy"
        ],
        "video_url": null,
        "description": "New research shows a big increase in children taking melatonin to help with sleep. Pediatricians warn the long-term effects of the hormone supplement aren't known.",
        "content": "New research shows a big increase in children taking melatonin to help with sleep. Pediatricians warn the long-term effects of the hormone supplement aren't known.",
        "pubDate": "2023-12-15 10:17:01",
        "image_url": "https://media.npr.org/include/images/tracking/npr-rss-pixel.png?story=1219513833",
        "source_id": "npr",
        "source_priority": 118,
        "country": [
          "united states of america"
        ],
        "category": [
          "health"
        ],
        "language": "english"
      },
      {
        "article_id": "d26005111975c1e382082446e91a16cf",
        "title": "Experience: I fell off a 40ft cliff",
        "link": "https://www.theguardian.com/lifeandstyle/2023/dec/15/experience-i-fell-off-a-40ft-cliff",
        "keywords": [
          "Epilepsy",
          "Life and style",
          "Health & wellbeing"
        ],
        "creator": [
          "Angharad Elliot"
        ],
        "video_url": null,
        "description": "My mum saw me from above, lying in a pool of water, a deep shade of crimson lapping around my earsMy life has been ruled by epilepsy since I was a teenager. At 14, I suddenly started experiencing severe seizures as a result of a stroke I’d suffered at birth. At some points, I’d have up to 20 a week – many so violent that I’d break my own nose by punching myself in the face.I rely heavily on the support of my family – I’m now 24, but I’ve never been able to move out from our home in Warwickshire, or stay overnight without them, as there’s always a risk that I might suffer a dangerous seizure without warning. Continue reading...",
        "content": "M y life has been ruled by epilepsy since I was a teenager. At 14, I suddenly started experiencing severe seizures as a result of a stroke I’d suffered at birth. At some points, I’d have up to 20 a week – many so violent that I’d break my own nose by punching myself in the face. I rely heavily on the support of my family – I’m now 24, but I’ve never been able to move out from our home in Warwickshire, or stay overnight without them, as there’s always a risk that I might suffer a dangerous seizure without warning. In October 2021, when I was 21, we were on holiday in Cornwall, enjoying walks and steaming-hot pasties. I remember browsing in a jewellery shop in St Ives and buying a painting, but then my mind goes blank. I woke up in a hospital bed 10 days later, bones broken and unable to communicate. My family spent months helping me piece together what had happened. After walking around St Ives, we’d gone on a short hike along the cliffs from Land’s End. At one point, the coastal path narrows and is only about three metres from the rugged cliff edge. My dad saw me suddenly drop off the side of the cliff. I’d had an epileptic fit and fell 40ft, my body ricocheting off the rocks below. My mum saw me from above, lying in a pool of water, a deep shade of crimson lapping around my ears. I had suffered a cardiac arrest, lost three litres of blood and technically died for several minutes Mum somehow managed to climb down the cliff face and found me breathing, though she says my skull had caved in. With the help of a passerby and two paramedics, I was hoisted on to a higher rock to stop me being swept away by the rising tide. After a couple of hours, we were lifted away in a helicopter, and I woke up days later in Treliske hospital in Truro. I had suffered a cardiac arrest, lost three litres of blood and technically died for several minutes. A senior nurse told my family they wouldn’t be able to save me. I still have to stop myself dwelling on that in order to focus on the future. As well as a fractured skull, I had three spinal injuries, both my lungs had collapsed and my pelvis was in multiple pieces. I had a degloving injury on my bottom, where my tissues were ripped from the underlying muscle, which eventually led to me developing sepsis. The only reason I’ve been able to walk again is because my feet were partially protected by my Doc Martens – an orthopaedic doctor told me my left heel had turned to dust. My boots are completely battered, but I’ll keep them for ever. My memories of the first few weeks are hazy: a speech therapist feeding me trifle to see if I could swallow; my sister, Beth, sitting at the side of my bed drinking a smoothie; the searing pain in my head and back. Due to the trauma to my brain, over the 10 months I was in hospital, I would regularly forget why I was there. I’m used to having blanks in my memory because of my epilepsy, but it’s still upsetting when I can’t remember. My mum made a photo diary, but it felt like I was looking at pictures of someone else. This summer I went to visit the team that saved me, but I had no memory of them. I felt awkward in a way, but it was important for me to thank them. skip past newsletter promotion Sign up to Inside Saturday Free weekly newsletter The only way to get a look behind the scenes of the Saturday magazine. Sign up to get the inside story from our top writers as well as all the must-read articles and columns, delivered to your inbox every weekend. Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Experience: I was attacked by a snake and a hawk at the same time Read more What I do know is that it’s nothing short of a miracle that I’m alive. Most people thought I’d have to rely on a wheelchair after my accident, but, although moving is painful, I can walk quite well now. And my memory is better than expected – I managed to watch Pulp Fiction and understand the plot, which was a huge milestone. It’s about celebrating the small victories. In a surreal twist, although my body was badly damaged by the accident, my epilepsy has started to get better. Doctors think the cardiac arrest starved my brain of oxygen long enough to “dampen” the parts causing epilepsy – but not long enough to cause major brain damage – and I’m now only having five or six seizures a month. Before, my epilepsy was so bad that I didn’t really have any quality of life. The day I almost died has turned out to be the day I got my life back, and I’m determined to keep living it. As told to Heather Main Do you have an experience to share? Email experience@theguardian.com",
        "pubDate": "2023-12-15 10:00:26",
        "image_url": "https://i.guim.co.uk/img/media/dba2af2e51e163f83696396ce09dda2661355338/0_196_5906_3545/master/5906.jpg?width=140&quality=85&auto=format&fit=max&s=cb297dc5861cb096f610c7fdaff94768",
        "source_id": "theguardian",
        "source_priority": 106,
        "country": [
          "united states of america",
          "canada",
          "australia",
          "united kingdom"
        ],
        "category": [
          "health"
        ],
        "language": "english"
      },
      {
        "article_id": "fdc5a7c9551447b7b63f1ec99d80cc2a",
        "title": "Artist helps seniors capture precious memories in works of art: 'They bring their life experiences'",
        "link": "https://www.foxnews.com/health/artist-helps-seniors-capture-precious-memories-works-art-they-bring-life-experiences",
        "keywords": [
          "c36c04af-2ea5-587e-94df-5df17325d212",
          "fnc",
          "Fox News",
          "fox-news/health",
          "fox-news/health/geriatric-health",
          "fox-news/health/mental-health",
          "fox-news/lifestyle",
          "fox-news/health/healthy-living/longevity",
          "fox-news/good-news",
          "fox-news/entertainment/genres/arts",
          "fox-news/health/nervous-system-health/alzheimers",
          "fox-news/health",
          "article"
        ],
        "creator": null,
        "video_url": null,
        "description": "Erin Finley, an award-winning artist in Canada, is the creator of Memory Drawing, a program that helps older adults tap into their memories and express them in vibrant color.",
        "content": "close Video Fox News Flash top headlines for December 14 Fox News Flash top headlines are here. Check out what's clicking on Foxnews.com. For many aging seniors , memories are precious and fleeting. Now, one Canadian artist is helping some of them capture their favorite scenes in lasting works of art. Erin Finley is an award-winning artist who teaches at OCAD University in Canada. She's the creator of Memory Drawing, a program that helps older adults tap into their memories and express them in vibrant color. Each month, Finley visits a large long-term care facility in Toronto, where she guides residents through the process of creating unique pieces through drawing, coloring and painting. PICKLEBALL HELPS BOOST SENIORS’ MENTAL HEALTH, OFFERING 'ADAPTABILITY AND ACCESSIBILITY,' SURVEY FINDS The residents range from intrepid, seasoned artists to beginners who are a bit nervous at first, Finley told Fox News Digital in a video interview. Regardless of their skill level, there's a lot to gain from the sessions, she said. Finley is pictured with one of the artists she works with at the long-term care center. Each week, she visits a long-term care facility in Toronto, where she guides residents through the process of creating their own unique pieces. (Erin Finley) \"I love that they all bring their own life experiences and their own bodies of work that they develop through memory drawing activities,\" she said. Finley first got the idea for Memory Drawing during the COVID-19 pandemic , when she saw \"heartbreaking images\" of people in long-term care facilities who couldn't be with their loved ones. MOST SENIORS IN AMERICA CAN’T AFFORD NURSING HOMES OR ASSISTED LIVING, STUDY FINDS \"I thought, 'What can I do? I'm not in health care , but I want to do something,'\" she said. The artist started contacting local facilities pitching her idea — and the program was born. ‘Self-guided and eager’ For each session, Finley brings some prompts for those who need a little more direction — but she pointed out that some of the seniors are \"very self-guided and eager to tap into their own imaginations.\" Seasonal elements are a popular prompt. In the fall, for example, Finley encourages the seniors to think about the crinkly sound of leaves, the changing colors and the trees moving in the wind. In spring, they might create art based on their favorite flowers. One of the artists at the senior center shows off her artwork at left. At right, Finley is pictured in her art studio. (Erin Finley) As they draw and paint, the group talks about the memories that inspired their work, which often involve favorite people, places and things, Finley said. Sometimes an artist brings a photo of a beloved person or object to recreate. One of the artists is a Corvette enthusiast, for example — so he creates art inspired by the memories of cars he drove and loved as a young man. CAN YOU REDUCE ALZHEIMER’S RISK BY SEEING A HEALTH COACH? COGNITIVE STUDY SUGGESTS IT’S POSSIBLE For residents with cognitive decline , Finley said the art sessions can help spark and sharpen memories, particularly when the seniors focus on texture or touch. For one of the artists, Finley usually starts the drawing and lets him finish. \"I love that they all bring their own life experiences and their own bodies of work that they develop through memory drawing activities,\" Finley said. She's shown here working with a group of artists. (Erin Finley) \"I'll draw half of a maple leaf and he draws the other half,\" she said. \"It adds an interactive component.\" Overall, she said she tries to \"be nimble\" and \"give the residents what they need and what brings them joy.\" ‘So inspired’ Finley said she is constantly inspired by the creativity the seniors exhibit. \"One of the artists takes watercolor paint, which is a dry medium, adds water to it and paints with his thumb,\" she said. \"The end result looks like a beautiful oil painting .\" \"It's uplifting for me. It makes me feel like I'm making a difference and helping in some regard.\" \"The ingenuity is just mind-boggling, and I'm so inspired by it every time I visit.\" As each piece is completed, Finley presents it to the group and celebrates the accomplishment. \"I might lift up the work and say, ‘This is what Lester has done today.’ And then we have a kind of cool gallery moment and we celebrate.\" SENIORS WITH DEMENTIA ARE TREATED TO 'BABY SHOWER' WITH DOLLS TO HELP RELIEVE STRESS: 'SENSE OF PURPOSE' One of the residents is deaf, Finley said, and so the individual communicates only through drawing. \"She'll pass me an image and I'll pass one back — it's beautiful.\" The finished pieces are sometimes displayed in the nursing home or given to loved ones . \"Sometimes they are kind of understood to be legacy pieces, so when a family member passes on, they become the prized belongings of the adult children and the remaining family,\" Finley told Fox News Digital. Finley is shown in her art studio displaying one of her creations. An award-winning artist, she teaches at OCAD University in Canada. (Erin Finley) \"This can be a difficult time for some of the adult children of the seniors I work with, but I get to go in and help them access these memories and create something wonderful for them to enjoy.\" Beyond helping the seniors tap into their own memories, Finley said she herself has also benefited. \"It's uplifting for me,\" she said. \"It makes me feel like I'm making a difference and helping in some regard.\" \"Engaging in artistic activities stimulates certain areas of the brain, helping to keep the mind sharp and active.\" There is also a community-building aspect to the Memory Drawing project, Finley noted, as it brings people out of their isolated spaces and into a collaborative, creative environment for the 90-minute sessions. \"The residents are socializing with each other more than they might have before,\" she said. \"While enacting a painting, we have conversations that are outside the realm of their regular daily routines.\" next Image 1 of 3 An artist at the long-term care facility is pictured with his artwork. (Erin Finley) prev next Image 2 of 3 An artist works on her project during one of the sessions. (Erin Finley) prev Image 3 of 3 One of the artists works on a Christmas-themed drawing. (Erin Finley) Looking ahead, Finley hopes to expand her program to include more nursing homes. \"Maybe the next phase will be enlisting specific artists to be instructors and hold art encounters,\" she said. Benefits of art for seniors Dr. John Whyte, a practicing physician in Washington, D.C. , and chief medical officer of WebMD, shared with Fox News Digital some of the mind-boosting benefits of art for older adults. \"Engaging in artistic activities stimulates certain areas of the brain, helping to keep the mind sharp and active,\" he said. \"This mental stimulation may delay the onset of cognitive decline associated with aging .\" In terms of cognitive health, a doctor noted that artistic activities stimulate neuroplasticity, which is the brain's ability to reorganize itself by forming new neural connections. (Erin Finley) Creating art can also improve seniors’ motor skills, he noted. \"Artistic activities require fine motor skills and hand-eye coordination, which can maintain or improve these abilities in seniors,\" said Whyte. \"Those skills are important for the activities of daily living.\" Art also encourages emotional expression, he noted, which is especially beneficial for seniors who may face social isolation or emotional challenges. 10 TIPS TO LIVE TO BE 100: ‘FAR MORE THAN WISHFUL THINKING,' SAY LONGEVITY EXPERTS \"The act of creating art can be therapeutic and meditative , reducing stress and promoting a sense of calm and relaxation,\" Whyte said. In terms of cognitive health, the doctor noted that artistic activities stimulate neuroplasticity, which is the brain's ability to reorganize itself by forming new neural connections. \"Art projects require attention to detail and concentration.\" Creating art can also trigger memories and stimulate storytelling, he said, \"aiding in the recall of past events and strengthening memory pathways.\" CLICK HERE TO SIGN UP FOR OUR HEALTH NEWSLETTER The activity also builds the ability to focus, Whyte said. \"Art projects require attention to detail and concentration, which can enhance these cognitive abilities in seniors.\" Finley is pictured in her art studio. \"The ingenuity is just mind-boggling, and I'm so inspired by it every time I visit,\" she said of her Memory Drawing project. (Erin Finley) The very act of recalling and capturing memories can have an array of benefits, even if those recollections aren’t always accurate, Whyte pointed out. \"This activity can be a powerful tool for reminiscence therapy, helping seniors with memory loss to connect with forgotten experiences,\" he said. CLICK HERE TO GET THE FOX NEWS APP \"Reflecting on personal history through art also helps seniors maintain a sense of self and personal identity, which can be particularly important in battling conditions like dementia or Alzheimer's .\" For more Health articles, visit www.foxnews.com/health . Melissa Rudy is health editor and a member of the lifestyle team at Fox News Digital.",
        "pubDate": "2023-12-15 10:00:16",
        "image_url": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2023/12/931/523/erin-artist-split.jpg?ve=1&tl=1",
        "source_id": "foxnews",
        "source_priority": 59,
        "country": [
          "united states of america"
        ],
        "category": [
          "health"
        ],
        "language": "english"
      },
      {
        "article_id": "55bf3855847636a8115d2dd9cb5f0ba8",
        "title": "‘Until It Is Fixed’: Congress Ramps Up Action on Social Security Clawbacks",
        "link": "https://kffhealthnews.org/news/article/senator-ron-wyden-social-security-administration-monthly-meetings/",
        "keywords": [
          "Aging",
          "Health Care Costs",
          "Health Industry",
          "Multimedia",
          "Disabilities",
          "Investigation",
          "Legislation",
          "Overpayment Outrage",
          "U.S. Congress",
          "Video"
        ],
        "creator": [
          "David Hilzenrath and Jodie Fleischer, Cox Media Group"
        ],
        "video_url": null,
        "description": "Sen. Ron Wyden (D-Ore.), chair of the Senate Finance Committee, vowed to meet monthly with Social Security officials until the problems surrounding overpayment demands are fixed.",
        "content": "The Senate Finance Committee is ramping up oversight of Social Security’s overpayment problem and plans to meet with the agency every month “ .” This story is part of the “Overpayment Outrage” series on TV stations. It can be Do you have an experience with Social Security overpayments you’d like to share? to contact our reporting team. Social Security has been overpaying billions of dollars to people, many on disability — then demanding the money back, even if the government made mistakes, an investigation by KFF Health News and Cox Media Group revealed. The reporting has triggered harsh criticism in Congress and led to an investigation by the agency. The Social Security Administration assured lawmakers in the past that it had been addressed, but “what you all found in your reporting is that the problem hadn’t been fixed,” Finance Committee Chair Ron Wyden (D-Ore.) said in an interview. Wyden was referring to by KFF Health News and Cox Media Group television stations reporting how the agency has been issuing billions of dollars in overpayments — benefits it claims people never should have received — and then, sometimes years later, the money back. “Millions of these individuals are walking an economic tightrope, balancing their food bill against the fuel bill, the fuel bill against the rent bill,” Wyden said. “And they have one of these overpayments and it just hits them like a wrecking ball.” Meanwhile, congressional legislation that would raise asset limits for millions of Social Security recipients for the first time in decades has been gaining support. The amounts the agency alleges people owe the government often total tens of thousands of dollars. The recipients include many of the nation’s most vulnerable — people who are disabled and have minimal savings and incomes. Often the overpayments result from errors or lapses on the part of the Social Security Administration. The agency has been sending overpayment notices to a year, according to a government document KFF Health News and CMG obtained through a request under the Freedom of Information Act. The notices typically ask recipients to repay the government within 30 days. They also explain how to appeal or request that the government waive the debt. The Finance Committee oversees Social Security. Wyden spoke with KFF Health News and CMG on Dec. 12 in his first interview with the news organizations since they began reporting on Social Security overpayments and clawbacks months ago. He was elaborating on a statement the committee posted last week. “As the point person for getting this fixed, I’m committing to getting this turned around,” Wyden said. “Your reporting has just been invaluable in terms of kind of opening up a lot of visibility and awareness to something that needs to be fixed.” Wyden is co-sponsor of a Senate bill that would address one of the root causes of overpayments. (WSB-TV, Atlanta) In the Supplemental Security Income program, which provides monthly checks to people who have little or no income or assets and are over 65 or disabled, asset limits for beneficiaries haven’t been adjusted since the 1980s. Those limits stand at $2,000 for individuals and $3,000 for couples. The bill, spearheaded by Sens. Sherrod Brown (D-Ohio) and Bill Cassidy (R-La.), to $10,000 and $20,000, respectively, and adjust them for inflation in the future. The bill has seven other , including recent additions Lisa Murkowski (R-Alaska) and Sen. Patty Murray (D-Wash.), chair of the Appropriations Committee. Chief executives of several major Wall Street firms, including Bank of America, Citigroup, Goldman Sachs, and Morgan Stanley, expressed support for the bill at a recent hearing, . At a September news conference on Capitol Hill, a representative of JPMorgan Chase, which also backs the proposal, said the asset limits often prevent employees from participating in a 401(k) retirement plan to which the firm makes matching contributions. A in the House of Representatives has 10 lawmakers behind it. “With growing bipartisan support in Congress and among the business and faith communities, we have a good chance to finally get this done,” Brown said in a statement for this article. Subscribe to KFF Health News' free Morning Briefing. Legislation to raise the asset limits could be included in a government funding bill early next year, Brown spokesperson Kevin Donohoe said. Wyden said he hopes the legislation becomes a campaign issue in the election year and that candidates are asked whether they support it. The monthly meetings with the Social Security Administration will begin when a new commissioner is in place, Wyden said. President Joe Biden’s nominee to head the agency, former Maryland Gov. Martin O’Malley (D), cleared the Finance Committee and is awaiting a confirmation vote by the full Senate. In a recent hearing, O’Malley said accounts of people facing clawbacks were “heartbreaking” and promised to make the issue a priority. Wyden said he expects the oversight meetings will include the top Republican on the Finance Committee, Sen. Mike Crapo of Idaho. A spokesperson for Crapo, Mandi Critchfield, said he “is committed to addressing the overpayments issue, and looks forward to working with Senator Wyden to conduct proper oversight.” One of the goals for those meetings, Wyden said, is to find out whether the agency can do more about overpayments using the legal powers it already has, including the authority to waive debts. Wyden said he has discussed Social Security overpayments and clawbacks with officials at the White House. In the interview, Wyden also addressed a recent report by KFF Health News and CMG that, according to the results of a public records request, the SSA has been sending overpayment notices to over a than the agency’s acting commissioner, Kilolo Kijakazi, . “When you have Social Security officials not telling the truth — and that’s how I would characterize that report on the number of people for whom there was actually a problem — it really damages this incredibly important program’s credibility,” Wyden said. The news organizations obtained a copy of a piece of paper from which Kijakazi read aloud some numbers but not others at the October hearing. SSA spokesperson Nicole Tiggemann said last week the agency could not confirm the accuracy of the counts — those Kijakazi presented at the hearing and those she left out. Meanwhile, senior Democrats on the House Ways and Means Committee issued a statement this week on overpayments and clawbacks. “Recent news reports have highlighted that the harm and unfairness Social Security beneficiaries experience after unknowingly being overpaid is more widespread than previously thought,” Reps. John B. Larson of Connecticut and Danny K. Davis of Illinois said. Larson is the ranking Democrat on the Ways and Means Subcommittee on Social Security, and Davis is the ranking Democrat on the Subcommittee on Work and Welfare. “The need for action is clear,” they said. “There must be a fundamental overhaul of Social Security’s overpayment process – one that puts seniors and Americans with severe disabilities first.” While the government is at fault for some overpayments, others result from beneficiaries failing to comply with requirements, intentionally or otherwise. That can include failing to keep the SSA updated about items such as earnings, assets, and in-kind support — for example, whether family members are giving the beneficiary food or a place to stay. Systemic problems also contribute. The SSA has relied on manual systems, and those are subject to human error. Rules are complex and difficult for SSA staff and beneficiaries alike to follow. People who receive yet try to work can easily run afoul of restrictions not only on how much they are allowed to save but also on how much they are allowed to earn. For individuals who aren’t blind, the is $1,470. The SSA relies heavily on beneficiaries to report changes in income, assets, and the like. For instance, the agency has been slow to implement systems that would automatically tap payroll data from outside sources. Beneficiaries and advocates for Social Security recipients say the agency frequently loses information they submit. Getting through to humans at the agency can be extremely difficult, they say. Wait times are long, and calls get dropped. O’Malley, the nominee for commissioner, recently told the Senate Finance Committee that the agency has a “ .” “The current wait times, backlogs, and delays are simply unacceptable,” O’Malley wrote. The agency has cited staffing and funding. In the 2023 fiscal year, “we began to rebuild our workforce after ending FY 2022 with the lowest staffing level in 25 years,” the acting commissioner said in an October statement to a congressional subcommittee. The agency closed field offices during the pandemic. That made it more difficult for beneficiaries to communicate with the SSA, and it caused problems to pile up. The agency checks benefits retrospectively, which , researchers at the Urban Institute have said. Regardless of who was originally at fault, by the time the SSA issues an overpayment notice, years can pass and the alleged overpayment total can balloon. Under federal law, the agency must try to recover overpaid amounts, Kijakazi said in her October statement, and there is no statute of limitations. To collect debts, the SSA can reach back decades and across generations.",
        "pubDate": "2023-12-15 10:00:00",
        "image_url": "https://kffhealthnews.org/wp-content/uploads/sites/2/2023/12/GettyImages-1659532110-resized.jpg?w=1024",
        "source_id": "kffhealthnews",
        "source_priority": 28152,
        "country": [
          "united states of america"
        ],
        "category": [
          "health"
        ],
        "language": "english"
      },
      {
        "article_id": "49e635c038ec0bf2bf4a58048a2f9559",
        "title": "Children First: Important volunteer group at Valley Children's",
        "link": "https://abc30.com/children-first-valley-childrens-hospital-babies-cuddlers-group/14184195/",
        "keywords": [
          "Health & Fitness,children first"
        ],
        "creator": [
          "Amanda Aguilar"
        ],
        "video_url": null,
        "description": "Valley Children's is always looking for helpers to meet the needs of patients and families, but there's one volunteer opportunity that's one of the most coveted.",
        "content": "MADERA, Calif. (KFSN) -- Every Wednesday morning, Jill Campbell scrubs in for her shift at Valley Children's Hospital in Madera. Even after teaching for 40 years, Campbell still wanted retirement to include kids. Campbell is one of about 50 volunteer cuddlers at Valley Children's. It's a position she takes seriously. \"I just love being with the babies,\" she said. \"I love knowing that I can hold the babies when their parents can't be here - and not every family can be here all the time, so that's where I come in. I get to love their babies while they're not here.\" Cuddlers hold, rock and soothe the hospital's tiniest, most critical patients. \"These babies are babies who are usually about three pounds or more,\" says Stacie Venkatesan with Valley Children's. \"We also have a large population of very big babies who have surgical needs, and they often are with us a long time recuperating from their surgeries.\" Campbell will walk the halls of the Neonatal Intensive Care Unit, listening for a baby who needs some extra care. Cuddlers are trained by neonatal nurses on how to properly hold the infants. Campbell says she can't imagine a better way to spend her day than loving on a precious little boy or girl. \"It is something that gives me purpose,\" she said. Whether it's five minutes or maybe two hours, volunteers' comforting cuddles do serve a purpose. Not only does it allow nurses to provide care to other babies, cuddlers help them develop into healthy babies. \"Their sight and their hearing are all part of being held and being interacted with in a positive way,\" Venkatesan said. Since cuddlers are dealing with some of the most medically-fragile patients, Valley Children's is selective about who can become one. Candidates are promoted from the Patient Pal volunteer group, and there's usually a waitlist to become a cuddler. Campbell ends each shift knowing she made a difference in the lives of the littlest patients - leaving her more fulfilled every day. \"I think everybody should do it,\" she said. For news updates, follow Amanda Aguilar on Facebook , Twitter and Instagram .",
        "pubDate": "2023-12-15 06:38:51",
        "image_url": "https://cdn.abcotvs.com/dip/images/14186277_121423-kfsn-6p-children-first-vid.jpg",
        "source_id": "abc30",
        "source_priority": 6954,
        "country": [
          "united states of america"
        ],
        "category": [
          "health"
        ],
        "language": "english"
      },
      {
        "article_id": "94fc492390ee50f11aec11cb7a0cf2df",
        "title": "South Korea expands telemedicine pilot and more briefs",
        "link": "https://www.healthcareitnews.com/news/asia/south-korea-expands-telemedicine-pilot-and-more-briefs",
        "keywords": null,
        "creator": [
          "apmarketing@himss.org"
        ],
        "video_url": null,
        "description": "South Korea expands telemedicine pilot Starting 15 December, the South Korean Ministry of Health and Welfare will be introducing additional measures to its national telemedicine pilot. According to a media statement, the programme is now allowing the conduct of telemedicine services at night and on holidays. Patients who have had face-to-face treatment within the past six months from a clinic can now also access telemedicine. About 100 islands and remote areas where health services remain inaccessible have also been designated as \"medically vulnerable areas\" where telemedicine can also be provided. Moreover, the programme prohibits downloading original prescriptions through a telemedicine application to prevent falsification. Recently, it was brought to the ministry's attention that some providers had prescribed commonly abused medications, violating the telemedicine rule. Synapxe integrates Lunit AI CXR into 2 SingHealth hospitals Singapore General Hospital and Changi General Hospital, both under SingHealth, have recently adopted the AI-based chest X-ray solution from Lunit. Synapxe, Singapore's national health tech agency, has integrated the Lunit INSIGHT CXR into the clinical radiology workflow of the two hospitals through the AimSG, the national AI platform for medical imaging. The integration was initiated through Lunit's partnership with NTT DATA Singapore, which is also part of the AimSG project. It is expected that Lunit's AI will help enhance the hospitals' ability to interpret and diagnose chest diseases. Lunit to buy AI mammography solution Volpara In other related news, Lunit also announced that it is buying New Zealand-based AI mammography solution company Volpara Health Technologies for $193 million. The acquisition will support Lunit's expansion in the United States where Volpara is adopted in over 2,000 medical sites. Absorbing Volpara's repository of over 100 million high-quality mammogram images will also \"supercharge\" the company's AI capabilities, it said. Enterprise Taxonomy: TelehealthInvestingClinical decision supportAIPatient AccessBusinessQuality CareAnalytics",
        "content": "Photo: Recep Buyukguzel/Getty Images .",
        "pubDate": "2023-12-15 05:43:56",
        "image_url": null,
        "source_id": "healthcareitnews",
        "source_priority": 121785,
        "country": [
          "united states of america"
        ],
        "category": [
          "health"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702619036720955713"
  }