{
    "status": "success",
    "totalResults": 495,
    "results": [
      {
        "article_id": "08fdef5b0b9c77327dedea548d8d914e",
        "title": "Big Meat just can’t quit antibiotics",
        "link": "https://www.vox.com/future-perfect/2023/1/8/23542789/big-meat-antibiotics-resistance-fda",
        "keywords": null,
        "creator": [
          "Kenny Torrella"
        ],
        "video_url": null,
        "description": null,
        "content": "The US Food and Drug Administration (FDA) knew that America’s meat industry had a drug problem. For decades, evidence had amassed that the widespread use of antibiotics to make livestock grow faster — and survive the crowded, unsanitary conditions of factory farms — was causing bacteria to mutate and develop resistance to antibiotics used in human medicine. Over time, once easily treatable human infections, such as urinary tract infections and tuberculosis, became to treat. A foundational component of modern medicine was starting to crumble. But it wasn’t until the mid-2010s that the FDA finally took the basic steps of requiring farmers to get veterinary prescriptions for antibiotics and banning the use of antibiotics to make animals grow faster — steps that some European regulators had taken a decade or more prior. Thanks to those two actions alone, sales of medically important antibiotics for livestock plummeted 42 percent from 2015 to 2017. But in a concerning course reversal, antibiotic sales for use in livestock have ticked back up, increasing 12 percent from 2017 to 2022, per a new . Sales increased 4 percent in 2022 alone. In 2022, the chicken industry’s antibiotics purchasing slightly declined, but in every other major sector — cattle, pork, and turkey — antibiotic sales rose. “Antibiotic sales to meat producers continue to increase despite efforts that the FDA has made,” Louis Sokolow, a policy associate with Frontier Group, a public health and sustainability research organization, told Vox. “The status quo of these small increases year over year is not enough to protect people from antibiotic-resistant bacteria.” According to an published in September by the Natural Resources Defense Council and One Health Trust, medically important antibiotics are increasingly going to livestock instead of humans. In 2017, the meat industry purchased 62 percent of the US supply. By 2020, it rose to 69 percent. It’s a sobering turn of events with life-and-death implications. In 2019, antibiotic-resistant bacteria directly killed over globally, including , and more than 5 million others across the world died from diseases where antibiotic resistance played a role — far more than the global toll of HIV/AIDS or malaria, leading the World Health Organization to antibiotic resistance “one of the biggest threats to global health, food security, and development today.” Public health advocates want to see the FDA take the threat much more seriously, and often point to Europe as a . From 2011 to 2022, antibiotic sales for use in livestock fell across the European Union, and use per animal is now that of the US. Last year, the EU implemented perhaps its most significant reform yet: banning the routine use of antibiotics to prevent disease, reserving their use for only when animals are actually sick. It’s unlikely the FDA will follow in Europe’s footsteps any time soon. Asked about an EU-style ban on preventive use of antibiotics, an FDA spokesperson responded, “The laws in the US and our livestock population are not the same as that of the EU or other countries. The FDA’s initiatives to promote judicious use and reduce AMR [antimicrobial resistance] were devised specifically for the US and the conditions we face with the aim of maximizing effectiveness and cooperation of drug sponsors, veterinarians, and animal producers.” The FDA and the US food industry have proven that they can make progress on the issue — but to keep antibiotics working, they need to do a lot more. That will require them to tackle beef and pork, two of the more stubborn and complex sectors of America’s meat system that just can’t seem to quit antibiotics, since doing so could demand substantive changes to how animals are farmed for food. The American antibiotic-free revolution that wasn’t It wasn’t just the FDA’s new rules that caused antibiotic sales for livestock to plunge in a two-year period — Big Chicken played a part too. In the early 2000s, the nation’s fourth-largest chicken producer began efforts to wean its birds off antibiotics, which it achieved in 2016 by changing chickens’ diets and replacing antibiotics with vaccines and probiotics. At first, chicken raised without antibiotics cost 50 percent more, but the company says it has since been able to all but close the cost differential. In the mid-2010s, while Perdue was making progress, activists leveraged the momentum and McDonald’s to source chicken raised without medically important antibiotics which contributed to a domino effect in which producers and restaurants made further pledges to reduce antibiotics in poultry. By 2020, a little of America’s 9 billion chickens farmed for meat were raised without antibiotics, according to an . The sea change in chicken production demonstrated it was possible to quickly scale down antibiotics in farming, but it didn’t do much to reduce overall use, as the chicken industry only used 6 percent of antibiotics in agriculture in 2016. And the momentum didn’t spread to other parts of the meat business, like beef and pork, which together account for over of medically important antibiotics fed to farmed animals. Some of the lack of progress in beef and pork comes down to the simple fact that pigs and cattle are raised differently than chickens. Chickens are slaughtered at just six or seven weeks old, so the chance they’ll get sick is lower than pigs, who are slaughtered at six months old, or cattle, slaughtered at around three years of age. The chicken industry is also vertically integrated, meaning a company like Tyson or Perdue controls virtually every link in the supply chain, so making big changes like cutting out antibiotics is easier than in the more decentralized supply chain of beef. For example, the typical steer will change hands several times before slaughter, going from a breeder to pasture grazing to a feedlot, all of which make it harder to coordinate an antibiotic-free regimen. In the last few months of their life cattle are also fed a high-grain diet that they aren’t adapted to digest, which increases the chance they’ll develop a , a condition that’s prevented with antibiotics. The pork sector, like poultry, is also vertically integrated, but the industry has largely opposed , , and reforms. Antibiotics in pig production shot up from 2017 to 2022. There’s also no pork or beef giant that’s taken the antibiotic-free leap like Perdue did for chicken. That could change in the years ahead: McDonald’s, the world’s largest beef purchaser, at the end of 2022 that it plans to reduce antibiotic use in its beef supply chain. However, the announcement didn’t come with a timeline, which . Although voluntary change can move the needle, without regulation, industry has little incentive to make the dramatic reductions needed to safeguard antibiotics. While the FDA has prohibited meat producers from using antibiotics to speed up growth— their in agriculture — some of the that , like tylosin, are still allowed for disease prevention. Matthew Wellington, formerly of the Public Interest Research Group, or PIRG, told Vox this is a that disincentivizes producers from reducing antibiotics: “Our concern has always been that they’re just putting a different name on the same kind of use, which is a problem.” (This story was originally published in January 2023; Wellington has since left PIRG). In response to this concern, an FDA spokesperson said, “Veterinarians are on the front lines and as prescribers, they’re in the best position to ensure that both medically important and non-medically important antimicrobials are being used appropriately.” Aside from outright banning the routine use of medically important antibiotics to prevent disease, PIRG would like to see the FDA take three actions: set a target of reducing antibiotic use by 50 percent by the end of 2025 (based on 2010 levels); publish data on antibiotic use, not just sales; and limit the duration of antibiotic courses for farmed animals. An FDA spokesperson said specific reduction targets weren’t possible because the agency doesn’t know how many antibiotics farmers are using: “We cannot effectively monitor antimicrobial use without first putting a system in place for determining [a] baseline and assessing trends over time.” The agency right now only collects sales data, and it’s been exploring a to collect and report real-world use data. Some states haven’t waited on federal regulators: have both restricted the use of antibiotics on farms. How the Europeans — and some Americans — are quitting antibiotics on the farm Just because it’s difficult to reduce antibiotics in beef and pork production doesn’t mean it’s impossible, as the story of Iowa pig farmers Tim and Deleana Roseland demonstrates. In 2005, they switched from raising pigs in the conventional manner — tightly cramped and fed a steady diet of antibiotics — to raising pigs for Niman Ranch, a higher-welfare meat company now owned by Perdue. That required the Roselands to ditch the routine use of antibiotics. “I was nervous about it at first but as it turned out, it was no big deal whatsoever,” Tim Roseland said. But he added that it wouldn’t have been possible with his old setup: “There’s too much overcrowding, small pens, too many pigs crammed into a little area.” Their newer system gives each pig more space in larger pens, and bedding that they root through and chew on, instead of, when they’re packed into factory farms, chewing on each other. They also give the pigs more vaccines and feed them probiotics. And there’s a lot to learn from Denmark, Europe’s pork producer. From 1992 to 2008, antibiotic use per pig fell by over 50 percent, and while pig mortality went up in the short term, by 2008 it had dropped back to near-1992 levels. The small country’s transformation wasn’t a matter of rocket science, but a suite of smart : more frequent barn cleaning, better ventilation, later piglet weaning, more space per pig, , and experimenting with feed and additives. All this comes with difficult tradeoffs: antibiotic-free pork costs more and requires more land, which increases its carbon footprint. But we can’t expect to have cheap meat forever without a cost to public health, an uncomfortable truth that’s led many environmental and public health groups to champion a message of meat. “I think the fact that Denmark, despite very low antibiotic use since 1995, is still one of the biggest pork exporters in the world, already speaks for itself,” said Francesca Chiara, a director at the University of Minnesota’s Center for Infectious Disease Research and Policy. Given the of global antibiotic sales for agriculture, Denmark’s example may not be speaking loudly enough. But it’s time we listen — nothing less than the future of human medicine is at stake.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://cdn.vox-cdn.com/thumbor/KeisDNwx0XG3IGlSeK887CqPOJo=/444x0:4000x2667/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71839246/GettyImages_957346802.0.jpg",
        "source_id": "vox",
        "source_priority": 889,
        "country": [
          "united states of america"
        ],
        "category": [
          "health",
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "7517f30624ec550de3b68261fd892f37",
        "title": "'Back where they belong': Beavers released into California tribal waters in conservation effort",
        "link": "https://phys.org/news/2023-12-beavers-california-tribal-effort.html",
        "keywords": [
          "Plants & Animals Ecology"
        ],
        "creator": null,
        "video_url": null,
        "description": "For the first time in almost 75 years, beavers were released into California waters as a part of conservation efforts by the California Department of Fish and Wildlife and Maidu Summit Consortium.",
        "content": "December 15, 2023 This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked reputable news agency proofread by Emma Hall, The Sacramento Bee For the first time in almost 75 years, beavers were released into California waters as a part of conservation efforts by the California Department of Fish and Wildlife and Maidu Summit Consortium. A family of seven beavers swam their way through Tásmam Koyóm, a tribal community in Plumas County that are ancestral land to the Mountain Maidu people. This new family will join a \"single resident beaver in the valley\" with the goal to re-establish a breeding population, according to the CDFW. Ben Cunningham, chairman of the Maidu Summit Consortium, said the valley had beavers years ago, but due to pioneer interference, the population disappeared. \"It's good to have them back home again,\" said Cunningham, who is also Northeastern Maidu. \"The beavers are back where they belong.\" Not only will these beavers be important for local tribes and groups like the Maidu Summit Consortium, but broader conservation efforts. Beavers are what CDFW Environmental Program Manager Valerie Cook called \"keystone species.\" Beavers, she said, provide a significant ecological benefit to their landscape, species around them, and help build up climate change resilience. Removal can be detrimental to a local ecosystem. \"There's a cascade of effects where you see (once beavers are gone), other species are no longer there,\" Cook said. \"Beavers really play a critical ecosystem management role.\" Described as an \"ecosystem restoration tool,\" Cook said the beavers are vital to engineering aquatic habitats. Having beavers in the area can lead to increased groundwater recharge and increased seasonal water flow. Rather than spend millions of dollar on ecosystem restoration efforts that include mimicry like beaver dam analogs, beavers can do their part. \"This new opportunity to have beavers translocated into restoration efforts is truly a nature-based solution where we can bring them in and just let them do the work. Let them do their thing,\" Cook said. \"Let them play their role in the ecosystem. The CDFW said their efforts will continue in the spring on the Tule River Reservation, which is located in the southern Sierra Nevada mountains. Charlton H. Bonhom, the director of CDFW, said this project is the product of leadership from local tribal communities. If it weren't for communities like the Tule River Tribe of California or other tribes, he said, an effort like this wouldn't be possible. \"We would not be here without the Tule River Tribe of California who have been out front advocating for these actions for years, tribes around the state like (the) Karuk, and, of course, Maidu Summit Consortium leaders,\" Bonham said in a news release. \"The future looks much better because of these leaders.\" 2023 The Sacramento Bee. Distributed by Tribune Content Agency, LLC.",
        "pubDate": "2023-12-15 12:08:28",
        "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2022/beaver-2.jpg",
        "source_id": "phys",
        "source_priority": 6461,
        "country": [
          "united states of america",
          "australia",
          "singapore",
          "united kingdom"
        ],
        "category": [
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "1c3f9bc35e6f29906e05ff8347b67e34",
        "title": "Splitting a large AI across several devices lets you run it in private",
        "link": "https://www.newscientist.com/article/2408718-splitting-a-large-ai-across-several-devices-lets-you-run-it-in-private/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=news",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Running your own AI locally by splitting it across multiple devices offers more privacy than using online services",
        "content": "When smartphones work together they can run sophisticated AI models Lubos Chlubny/Shutterstock Powerful artificial intelligence based on large language models can be computationally split to run on several smartphones. That could enable people to use AIs locally without relying on a cloud service’s data centres – and without needing to share sensitive queries or personal information with a tech company. Read more “Our key motivation was privacy,” says at the University of California, Irvine. “If users want to…",
        "pubDate": "2023-12-15 12:00:58",
        "image_url": "https://images.newscientist.com/wp-content/uploads/2023/12/13180933/SEI_183929098.jpg",
        "source_id": "newscientist",
        "source_priority": 4233,
        "country": [
          "united states of america"
        ],
        "category": [
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "bb44b46fe1ac127357c81e83db7ad155",
        "title": "A new approach to measuring what’s going on in our minds",
        "link": "https://www.vox.com/future-perfect/2023/12/15/24001424/consciousness-complexity-neuroscience-mental-health",
        "keywords": null,
        "creator": [
          "Oshan Jarow"
        ],
        "video_url": null,
        "description": null,
        "content": "Sometimes when I’m looking out across the northern meadow of Brooklyn’s Prospect Park, or even the concrete parking lot outside my office window, I wonder if someone like Shakespeare or Emily Dickinson could have taken in the same view and seen I don’t mean making out blurry details or more objects in the scene. But through the lens of their minds, could they encounter the exact same world as me and yet have a richer experience? One way to answer that question, at least as a thought experiment, could be to compare the electrical activity inside our brains while gazing out upon the same scene, and running some statistical analysis designed to actually tell us whose brain activity indicates more richness. But that’s just a loopy thought experiment, right? Not exactly. One of the newest frontiers in the science of the mind is the consciousness’s “complexity,” or how diverse and integrated electrical activity is across the brain. Philosophers and neuroscientists alike that more complex brain activity signifies “richer” experiences. The idea of measuring complexity stems from — a mathematical approach to understanding how information is stored, communicated, and processed —which doesn’t provide wonderfully intuitive examples of what more richness actually means. Unless you’re a computer person. “If you tried to upload the content onto a hard drive, it’s how much memory you’d need to be able to store the experience you’re having,” , a professor of machine learning and data science at the University of Sussex, told me. Another approach to understanding richness is to look at how it changes in different mental states. Recent studies have found that are lowest in patients under general anesthesia, higher in ordinary wakefulness, and higher still in psychedelic trips, which can notoriously turn even the most mundane experiences — say, my view of the parking lot outside my office window — into . Increasing richness isn’t just like cranking up the color saturation of a picture or getting a bigger hard drive. It seems to imply an increase in the depth of how we experience the world. Complexity is what you see in the equations, richness is what that feels like in the mind. Although measuring brain complexity is still in relative infancy, the nascent ability to gauge something like richness is a pretty incredible development — not only for but for how we think about well-being more broadly. With innovations like these, we can go beyond the , which doesn’t have an accepted neurological measure that can translate across social and cultural differences, and ask more targeted questions, like whether our experiences are richer. As these approaches mature, scientists might develop a deeper understanding of all the different, tractable ways that consciousness can change for the better. From staining neurons black to measuring the brain’s complexity In the 1800s, scientists studying the mind didn’t yet know what a neuron looked like, let alone how they worked. That breakthrough came in , when physician Camillo Golgi discovered that by immersing brain tissue in a potassium dichromate solution and then dunking it in a bath of silver nitrate, the neuron would turn black, making it visible under a microscope. The Spanish neuroscientist Santiago Ramón y Cajal, when observing newly stained neural tissue in 1887, discovered that contrary to the reigning reticular theory (which held that the nervous system was a continuous network of cells smushed together with no gaps), neurons were indeed separated from each other. Sprouting from the neuron’s edges were spindly little axons and dendrites, but they didn’t seem to create permanent bridges between the neurons, leading him to conclude that communication between neurons likely wasn’t all that important in explaining their main functions. Instead, individual neurons were taken as the nervous system’s fundamental units, or building blocks, an idea that solidified into “the .” Through the 20th century, developments in electrophysiology led to a sharper understanding of the connections between neurons, and the importance of the little electrical impulses that travel across synapses. But the basic perspective of focusing on neurons themselves, rather than the holistic electrical processes that they’re conduits for, remained dominant. This approach has gotten quite good at breaking the brain into distinct parts and explaining how they contribute to specific functions, like vision or controlling your fingers. The downside is that many theories of consciousness struggle with what’s called the — the question of how all the separate parts fit back together to generate a unified conscious experience. Recent improvements to electroencephalography (EEG, those skull caps with a bunch of electrodes that measure the brain’s electrical activity) made it possible to look deeper inside the workings of the brain, opening the way for neuroscientist Giulio Tononi and biologist Gerald Edelman’s 1998 paper: . Their publication was the first to propose a direct measure of the complexity of brain activity, an idea that matured into , or IIT. According to IIT, consciousness arises where the underlying neural activity is both “integrated” and “differentiated.” Integration refers, roughly, to how synchronized electrical activity is across the brain. Differentiation is the diversity of that activity. You can think of them in terms of weaving a tapestry. Integration is how many different threads are woven in, while differentiation is the variety of colors used. Together, these two determine the complexity of a given state of consciousness. That, in turn, approximates its richness. In theory, anyway. At the time, the idea ran ahead of technology. “It became apparent over the years that it’s quite hard to measure those two things simultaneously,” Barrett told me, “and it turned out that the differentiation aspect alone, without thinking about integration, did quite well at being able to distinguish between different states of consciousness.” That said, our measures are improving quickly. Barrett co-authored released as a pre-print last week that compared a new measure of complexity — what they call “statistical complexity” — to Lempel-Ziv complexity, which was first in 1976 and is still the field’s leading measure. While Lempel-Ziv captures only the differentiation aspect, their findings suggest that the new measure successfully brings integration back into the mix, affording greater precision. As progress continues, IIT may creep closer to its grand ambition: constructing an equation that can measure and describe the richness of conscious experience in any physical system, whether human, animal, or machine. “That fails at the moment,” said Barrett, “but I’m very interested in seeing if we could come up with a plausible equation. That’s sort of the holy grail for me.” So what do we make of richness? If a plausible equation isn’t the kind of thing that occupies your dreams, a concrete measure for something like richness could bring some sorely needed innovation to our ideas around . The Diagnostic and Statistical Manual of Mental Disorders (the DSM-5) contains diagnoses to help clinicians classify just about every shade of mental disorder they might encounter. When it comes to the positive dimensions of mental health, however, our language is comparatively sparse. “Happiness” is a very nebulous idea, especially when you . We in the West, unlike the Buddhists, have not developed rigorous taxonomies for all the rungs on the mental ladder — from our default modes to the ecstasies, grades of zest, or senses of “ ” that lurk in the (reportedly, anyway). If we can quantify the richness of our minds, maybe it could jumpstart the process of finding other tractable dimensions we can add to our conceptions of well-being. Of course, quantifying something important always (à la : when a measure becomes a target, it ceases to be a good measure), and being wise about how to make sense of these new ideas will be bumpy. It’s tempting, for example, to simply think that when it comes to richness, more is always better. But researchers, like 50 honoree , believe that the brain evolved to hold levels of complexity below a threshold called “criticality,” rather than just maximize it. In information theory, criticality marks the optimal balance of complexity for processing information, a perch between order and chaos. Or in terms of the mind, between the rigidity and flexibility of mental habits. Too much complex activity pushes the brain over the edge. That might offer a temporarily exciting state of mind (as psychedelic trips can), but in terms of efficiently processing information to be successful creatures in the world, a never-ending acid trip is probably not the ideal state. “A brain at criticality may be a ‘happier’ brain,” Carhart-Harris . If criticality means greater well-being calls for a particular balance of complexity, not just as much as we can muster, that doesn’t mean that we’re all, by default, naturally tuned to that balance. As our measures and technologies improve, maybe we’ll get better at identifying when someone’s ordinary brain activity is below criticality, and a burst of complexity could serve as a boon to well-being. Maybe we’ll develop new ways of growing richer, not just in our bank accounts (though that may help), but in the ways that we experience the world.",
        "pubDate": "2023-12-15 12:00:00",
        "image_url": "https://cdn.vox-cdn.com/thumbor/TNK1daUQuXbAdowaleGb0vQaPFY=/22x0:5295x3955/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/72965618/GettyImages_152195326.0.jpg",
        "source_id": "vox",
        "source_priority": 889,
        "country": [
          "united states of america"
        ],
        "category": [
          "health",
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "5c645b33cf02bbecefc4a38a2b460262",
        "title": "In a World First, a Patient's Antibody Cells Were Just Genetically Engineered",
        "link": "https://www.wired.com/story/b-cells-genetically-engineered-immusoft/",
        "keywords": [
          "Science",
          "Science / Biotech"
        ],
        "creator": [
          "Emily Mullin"
        ],
        "video_url": null,
        "description": "B cells are prolific producers of antibodies, but for the first time, scientists have modified them to make other proteins to counteract a serious genetic disease.",
        "content": "Our B cells help prevent us from getting sick. Their job is to make antibodies, immune system proteins that fight off viruses and other foreign invaders. And they make a lot of antibodies—thousands of them every second. What if these antibody factories could be harnessed to make other things the body needs? That’s the idea behind a trial launched by Seattle-based biotech company Immusoft. The company announced today that its scientists have genetically programmed a patient’s B cells and put them back in his body in an effort to treat disease. It’s the first time engineered B cells have been tested in a person. The patient has a genetic disorder known as mucopolysaccharidosis type I, or MPS I. His body doesn’t produce an essential enzyme that helps to break down long-chain sugars inside cells. Without this enzyme, these sugars build up in the eyes, heart, bones, and elsewhere. The effects are life-threatening. Patients have cloudy eyes, respiratory problems, cognitive issues, and enlarged organs. Those with the most severe form of the disease die in childhood. Others may live to their twenties or thirties. Patients are currently treated with weekly infusions of the enzyme their body lacks. The therapy must be given for the entirety of a patient’s life. Typically, a gene called IDUA provides instructions for making this enzyme, but people with MPS I have a mutation in this gene. Immusoft’s aim is to override this problem by prompting a person’s B cells to make the enzyme instead. B cells appealed to Immusoft because of their ability to pump out lots of proteins. If a person’s B cells could provide a continuous supply of this enzyme, it could eliminate the need for regular infusions. Sean Ainsworth, CEO of Immusoft, says the initial patient is doing well after receiving the experimental therapy in mid-November. “So far, so good,” he says. Researchers at the company collected the patient’s B cells using a machine that removes blood, separates out a particular component, then returns the rest to circulation. There are billions of B cells in the body; Immusoft uses only a portion. “The body is constantly regenerating and producing new B cells,” Ainsworth says. To get the B cells to produce the missing enzyme in addition to antibodies, scientists had to add new genetic instructions to them in the lab. They packaged those instructions into a transposon, a DNA sequence that can naturally integrate into a cell’s genome using a cut-and-paste mechanism. Several commercially available therapies involve genetically engineering a patient’s cells outside the body to treat disease. A newly approved treatment for sickle cell disease uses Crispr to edit a patient’s blood-forming stem cells. And a type of “living drug” known as CAR-T cell therapy supercharges a patient’s T cells against cancer. No current therapies use a person’s B cells. “It seems to me it was the obvious thing to move from T cells to B cells,” says Abla Creasey, vice president of therapeutics development at the California Institute for Regenerative Medicine, which has awarded $12,000 in grants to Immusoft. She says B cells represent an exciting new strategy to treat disorders in which the body doesn’t make enough of a certain protein or enzyme. The field is still new, says David Rawlings, an immunologist at Seattle Children’s Hospital who is working on engineered B cell therapies. That’s in part because B cells proved more difficult to manipulate than other types of cells. His lab is using Crispr to modify B cells, and he cofounded a company, Be Biopharma, to further develop them. “The uses are really broad because you can think of them as a drug-secreting platform that lasts for a long time,” Rawlings says. Existing engineered cell therapies have shown miraculous effects, but they come with downsides. In the case of the Crispr treatment, patients first undergo chemotherapy, which can cause hair loss, nausea, and other unpleasant side effects. After treatment, they must then stay in the hospital for weeks while their edited stem cells take up residence in the bone marrow. With CAR-T cell therapy, serious immune or nervous system effects can occur, so patients must be monitored in the hospital. By contrast, Immusoft’s engineered B cells are given as an IV infusion in an outpatient procedure, Ainsworth says. Paul Orchard, the doctor running the trial at the University of Minnesota Medical School, says the original plan was to treat children with the disease. “It’s easier to prevent complications than it is to reverse them after they’ve already happened,” he says. “If you can identify kids and intervene relatively early in life, they’re more likely to get benefits.” However, the US Food and Drug Administration has limited the team to working with adults initially, until the therapy is shown to be safe. He says one concern the FDA has with engineering B cells is the possibility that they could turn cancerous, giving rise to lymphoma or leukemia. The transposon system Immunosoft uses inserts the new genetic material in a random fashion, so Orchard says there’s a theoretical risk that it could do so near a cancer-causing gene. This is also a known risk with current CAR-T cell therapies, which use viruses to deliver new genetic material to cells. Scientists can’t precisely control where in the genome viruses drop off their payload. Immusoft’s initial trial is meant to test safety of its engineered B cell approach, so patients will continue receiving their usual enzyme infusions for now. The next step will be to take patients off the infusions to see whether the modified B cells are doing what they’re supposed to do. Orchard says they’ll measure enzyme levels in the blood and also look for improvement in patients’ symptoms, including movement and heart function. One big question investigators are hoping to answer is how long the engineered B cells stick around in the body. Some B cells last for decades, Orchard says. “We’ll have to see. Obviously, it would be better if it's a definitive therapy and a one-time administration.”",
        "pubDate": "2023-12-15 12:00:00",
        "image_url": "https://media.wired.com/photos/657b7b69a88fb9cbe8b088ae/master/pass/bcells-science-29122039942_7d6b364b53_o.jpg",
        "source_id": "wired",
        "source_priority": 732,
        "country": [
          "united states of america"
        ],
        "category": [
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "3cb560bfb518466d482bb377806044ff",
        "title": "Energy Drinks Are Out of Control",
        "link": "https://www.wired.com/story/panera-bread-charged-lemonade-caffeine-energy-drinks/",
        "keywords": [
          "Science",
          "Science / Health"
        ],
        "creator": [
          "Tom Ward"
        ],
        "video_url": null,
        "description": "Highly caffeinated drinks have become a cultural staple. But following a death allegedly related to Panera Bread’s Charged Lemonade, has our collective obsession with energy drinks become unsafe?",
        "content": "Whenever he visited his local branch of Panera Bread in Fleming Island, Florida, it was Dennis Brown’s habit to order three drinks in a row. On September 28, and again on October 2, and the 4th, 5th, 7th, and 9th—the day Brown died—his drink of choice was Panera Bread’s Charged Lemonade. A 20-ounce serving of Charged Lemonade contains 260 milligrams of caffeine, while the 30-ounce cup has 390 mg—close to the US Food and Drug Administration’s recommended daily limit. It isn’t known which size Brown, 46, consumed on October 9, but after finishing his dinner, he left the American fast casual restaurant and suffered a fatal cardiac arrest on a nearby sidewalk shortly after. A wrongful-death lawsuit filed against Panera Bread on behalf of Brown’s family states that he usually drank iced tea, root beer, or water and was allegedly unaware that Charged Lemonade contains caffeine, as the lawsuit says it wasn’t advertised as an energy drink. Elizabeth Crawford, the attorney representing Brown’s family, has claimed the drink is “a wolf in sheep’s clothing.” Panera Bread says it’s not to blame. “Panera Bread expresses our deep sympathy to Mr. Brown’s family. Based on our investigation, we believe his unfortunate passing was not caused by one of the company’s products,” Jessica Hesselschwerdt, senior director of public relations at Panera Bread, told WIRED. Hesselschwerdt says the case against the company is “without merit,” that Panera “stands firmly by the safety of our products,” and that Charged Lemonade contains “the same amount of caffeine per ounce as a dark roast coffee.” That may be true. But while health bodies advise that consuming caffeine is OK, as long as we don’t overdo it, in recent years caffeinated drinks have been getting bigger and stronger—so much so that regulators are stepping in. Panera Bread’s drinks aren’t the only ones to have raised concern. In January 2022, the internet found itself in a frenzy over Prime , an energy drink developed by YouTube stars turned boxers Logan Paul and KSI. Sold in neon-colored cans and advertising zero sugar and vegetarian-friendly ingredients, the brand was an immediate hit among the influencer’s combined—and often very young—40 million Instagram followers, who posted their own viral videos of themselves frantically searching for cans of the drink. By July, US Senate Majority Leader Charles Schumer had requested an FDA investigation into the brand, claiming parents were unwittingly serving their children a “cauldron of caffeine” when they purchased the drink. (Prime contains 200 mg of caffeine per 12 ounces—roughly equal to two cans of Red Bull plus a cup of coffee.) In response to Schumer’s calls, the company released a public statement claiming that “Prime energy … contains a comparable amount of caffeine to other top-selling energy drinks.” The drink is still for sale in the US and UK, but it was one of six energy drinks recalled in Canada earlier this year, with new legislation outlawing drinks containing more than 180 mg of caffeine in a single serving. In a video after the announcement, Paul said that the drinks are compliant with each country’s specific regulations, claiming, “The crazy part about that is, we don’t even distribute Prime Energy in Canada.” Lithuania, Latvia, Turkey, and Poland have also implemented a general ban on the sale of energy drinks to under-18s, with a UK government ban consultation stalling during the pandemic. These moves are a response to a modern trend—the rise of stronger and stronger drinks—but also part of a pattern that dates back over a century. The US Department of Agriculture voiced worries about the excessive amounts of caffeine in Coca-Cola as early as 1909. The US Pure Food and Drug Act was amended in 1912, adding caffeine to the list of “habit-forming” substances that should be clearly announced on food labels. As a result, Coke cut its caffeine levels in half. Today, Coca-Cola would barely register as an energy drink, containing 34 mg of caffeine per 12-ounce serving. (Diet Coke is slightly more caffeinated, at 46 mg per 12 ounces.) Some same-size caffeinated drinks available today contain 300 to 400 mg . “Energy drinks are safe in the same way that a doughnut is safe—one every now and again is fine, but eating too many will exceed recommended intake for calories, sugar, and fat,” says nutrition therapist and author Ian Marber . Marber explains that caffeine has a similar chemical structure to adenosine, a substance that is part of the process of creating energy, and acts like a neurotransmitter in the brain. “In essence, adenosine promotes sleep, but metabolites in caffeine prevent it from doing its job, promoting alertness in place,” he explains. “This in turn triggers the adrenal glands to produce adrenaline and cortisol, both of which make us feel alert and capable.” The effects can last for around four hours and can be useful in small doses. But exceed the limits and you might experience anxiety, fatigue, and interrupted sleep patterns. “What makes a substance toxic is the dose,” says Alex Ruani, a doctoral researcher at University College London and chief science educator at the Health Sciences Academy . Coffee is packed with caffeine—66 mg for a “tall” Americano or latte at Starbucks—but “most energy drinks have exorbitant amounts of caffeine, ranging from 60 milligrams to 200 milligrams plus,” she says. “The FDA and its European equivalent, the EFSA , both agree that 400 milligrams of caffeine is a safe daily limit. But here’s the caveat: Consuming this much caffeine in one go could be fatal, especially when consumed for the first time .” In fact, the EFSA advises a single intake of no more than 200 mg of caffeine (around 3 mg per kilogram of body weight) and that the 400 mg limit be split into smaller intakes across the day. As well as containing vast amounts of caffeine, the added ingredients in some energy drinks can also be harmful. “Energy drinks often contain other stimulants like B vitamins, L-carnitine, L-theanine, and glucuronolactone,” says Ruani. “When combined, drinkers are faced with a potentially hazardous cocktail that can upset several body systems, including the brain and the heart.” It’s also possible to become addicted to them. “Both sugar and caffeine have addictive properties,” says Ruani. The popularity of energy drinks has been on the rise for decades—and much of their success rests not on their sugary, stimulating formulations but on their marketing. Lucozade (then called Glucozade), perhaps the first drink that would be deemed an energy drink by modern standards, launched in 1927. But it wasn’t until the rise of Red Bull in 1987 that energy drinks began their modern associations—first with extreme sports and then gaming. Energy drinks were no longer just a health tonic, as once advertised, but an essential lifestyle component. Red Bull, which sold more than 11 billion cans in 2022, and Monster Energy are the two leading energy drinks in the United States, with Celsius, Bang Energy, and Rockstar rounding out the most popular choices. Red Bull is also the leading energy drink in the UK, generating £349 million ($445 million) in sales in 2023, well ahead of its nearest competitor, Monster, at £289 million. Worldwide, the energy drinks market is set to be worth $108.4 billion by 2031, up from $45.8 billion (£35.9 billion) in 2020. This acceleration coincides with another marketing pivot—moving into the world of influencers. According to influencer marketing analytics site Tribe Dynamics , in 2021 brands including Bang Energy, GFuel, and Monster “raced ahead on social media by winning over distinct content creator communities.” They did this through three main channels: TikTok influencers, online gamers, and sponsored athletes. “Marketing to the gaming sector is a growing opportunity, with huge events all over the world,” says Vhari Russell, founder of The Food Marketing Experts . “This was a great way to grow throughout lockdown, when more people were gaming.” But social problems have arisen alongside this. “The biggest drinkers of energy drinks are adolescents,” says Ruani. “In the UK and Europe , as many as seven in 10 teens consume them, and two in 10 children.” Ruani points to evidence of multiple hospitalizations and deaths of children and adults that have been attributed to the consumption of energy drinks. “It’s outrageous that energy-drink manufacturers deny targeting kids and youngsters,” she says. “The proof is on the can: many displaying colorful designs and childhood flavors like ‘bubble gum’ and ‘ice pop.’ Couple that with the hype sparked by TikTok influencers, and it’s no wonder that kids and teens are obsessed with them.” Dan Tai ( @dantai ), an online coach and fitness model with 824,000 Instagram followers, drinks about four energy drinks per week and markets them on his page. Chelsie Cahoon ( @thesoberraver ) works as a promo model for an energy drink brand called Celsius, despite limiting herself to just three energy drinks per year. “I never liked drinking them because of how much sugar a lot of them have,” she says. Both believe the onus is on the brands to warn consumers of the dangers, though Cahoon adds that consumers should carry out “additional research” into what they consume. In the US, the FDA has not imposed specific restrictions or requirements on the sale or labeling of energy drinks, but the American Beverage Association’s Guidance for the Responsible Labeling and Marketing of Energy Drinks does lay out some rules, including that energy-drink packaging must declare the total amount of caffeine per drink, that they cannot be marketed at children, and that they cannot be labeled as dietary supplements. Adherence to these rules is voluntary, however, and 5 percent of energy drinks sold in the US don't follow them. And given current rates of energy-drink consumption among teenagers and children both in the US and UK, the efficacy of such rules is questionable. Given all of this, the most recent transition in the energy drink market can be seen as the most alarming: their transmogrification into health drinks, with brands such as Tenzing, Brio Yerba Mate, and PerfectTed flooding supermarket shelves. “The changes we see in the energy drinks industry is a result of wider health and wellness trends,” says Rachel Yon Choi, behavioral analyst at brand consultancy Canvas8 . “While people still want energy-boosting drinks, they want that boost from a source that’s beneficial to their body and well-being. They’re moving away from sugar, synthetic, and ultra-processed ingredients to seek out cleaner, ‘better for you,’ and lower-calorie products.” Huib van Bockel, founder of Tenzing, took inspiration for his brand from “Sherpa tea” (typically organic black tea, with added yak butter and salt, making it rich in electrolytes, fat, and natural caffeine), as well as Tenzing Norgay, who along with Edmund Hillary became one of the first people to summit Everest in 1953. With sherpas known for seemingly superhuman feats in oxygen-depleted “death zones,” the health connotations are clear. “We have the same amount of natural caffeine as a cup of coffee and 60 percent less sugar than a traditional energy drink,” says Van Bockel. “Because of the low sugar levels and our natural blend of caffeine, L-theanine, electrolytes, and vitamin C, you get the uplift but not the crash,” he says. Marber, while not specifically addressing Tenzing, is clear that adding in “healthy” ingredients doesn’t magically turn an energy drink into a health tonic. “There’s nothing wrong with some caffeine and sugar, but having lower amounts than other offerings doesn’t make it ‘healthy’ any more than adding nutrients does,” he says. Again, it’s down to consumer habits. “I don’t think there are unhealthy foods, more unhealthy habits. So an average quality drink here and there is fine, more often isn’t,” Marber says. Ultimately, Russell believes that empowering consumers to make better choices could be the solution to curbing potentially dangerous caffeine consumption. “It’s informing them as to why a cup of coffee or tea might be better than an energy drink,” she says. Panera Bread has tried this. On October 30, the brand added prominent warnings to its Charged Lemonade in stores and online, reading: “Use in moderation. NOT RECOMMENDED FOR children, people sensitive to caffeine, pregnant or nursing women.” At the time of writing, three “Charged” drinks remain available on Panera’s website, including Blood Orange Charged Splash (150–219 mg of caffeine) and Strawberry Lemon Mint Charged Lemonade (158–237 mg). And the buzz around these and other highly colored, high-power drinks is showing no signs of slowing down.",
        "pubDate": "2023-12-15 12:00:00",
        "image_url": "https://media.wired.com/photos/657b9e9c6a4155faec2fbfbe/master/pass/chargedlemonade-science-GettyImages-1843520556.jpg",
        "source_id": "wired",
        "source_priority": 732,
        "country": [
          "united states of america"
        ],
        "category": [
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "0d7b62bdfe6b549035f2640d13dc57f2",
        "title": "Here are some big-if-true scientific claims that made headlines in 2023",
        "link": "https://www.sciencenews.org/article/science-discoveries-2023-big-if-true",
        "keywords": [
          "Earth"
        ],
        "creator": [
          "Maria Temming"
        ],
        "video_url": null,
        "description": "Hominid cannibalism, “dark stars,” the secrets of Earth’s core and more tantalizing findings will require more evidence before scientists can confirm them as fact.",
        "content": "By From ancient cannibalism to stars made of dark matter, 2023 delivered several scientific claims that could shake up their fields — if they shape up to be true. Early life on Earth may have gotten a boost from giant volcanic eruptions. A new look at debris from 10 eruptions millions of years ago suggests they ( ). The eruptions could have triggered fierce lightning that ripped apart molecular nitrogen, freeing nitrogen atoms to bond with other elements and form molecules useful to life — including nitrate. The same process may have happened billions of years ago, some scientists say, producing ingredients for early life. Scientists will need to account for the different chemical makeup of primordial Earth’s atmosphere to bolster that claim. Purported tool marks on a 1.45-million-year-old fossilized leg offer , researchers contend ( ). The marks on the bone, found in Kenya, could have been made by some unidentified hominid using a stone tool to carve muscle away from the shin of another hominid. But a few bone nicks do not cannibal table scraps make, some paleoanthropologists say. A handful of galaxies from the very early universe are , data from NASA’s James Webb Space Telescope suggest ( ). The hefty galaxies not only challenge the idea that matter clumped together slowly over the universe’s lifetime, but also hint at some unknown way to fast-track galaxy formation. But the galaxies’ weights and distances must be confirmed with more detailed analyses of their light before astronomers rewrite cosmic history. The thymus may not be inconsequential for ( ). This immune system organ between the lungs is most active in childhood and withers with age, so it is often considered expendable in adulthood. In a study of more than 2,000 adults who had chest surgery, however, researchers reported that removing the thymus gland was associated with higher rates of death and of cancer within the next few years. Why thymus removal might be harmful remains unclear. Honoring the dead may not be unique to big-brained hominids like and Neandertals. , which lived around the same time as early but had an orange-sized brain, in an underground South African cave, a group of researchers claims ( ). Other experts remain unconvinced, though. The supposedly buried bodies, which predate the earliest evidence of . and Neandertal burials by 160,000 years, could have fallen through cave shafts or been washed by water into natural depressions in cave floors, skeptics say. Separate studies both based on earthquake data are shaking up geologists’ concept of Earth’s heart. The solid inner core not only rotates but also appears to relative to the mantle and crust every few decades ( ). The inner core may also have ( ). Other data, however, hint that the inner core reverses every few years or does not rotate at all. And the supposed discovery of the innermost core hinges on a type of seismic wave that bounces around Earth’s interior, becoming weaker and more difficult to detect with every bounce. Thankfully, whatever is going on down there does not seem to endanger life on the surface. The James Webb Space Telescope may have spotted stars made of dark matter — the unidentified stuff that makes up most matter in the cosmos ( ). So-called dark stars are so far hypothetical, but JWST giving off the kind of light expected from such stars. If they exist, dark stars could shed new light on star formation and the nature of dark matter. However, the pinpricks of light in JWST’s field of view could also come from normal stars, so astronomers will need more detailed data to tease out the objects’ true nature. Previously the staff writer for physical sciences at , Maria Temming is the assistant editor at . She has bachelor's degrees in physics and English, and a master's in science writing. Your support for Society for Science helps counter misinformation and create a more informed public. . that is the foundation of our work. Millions learn about new scientific developments in and . eager to participate in our world-class STEM competitions and affiliated science fairs. And with — we can make STEM more diverse through our acclaimed Outreach and Equity programming for STEM students and educators in low-income and under-resourced communities.",
        "pubDate": "2023-12-15 12:00:00",
        "image_url": "https://i0.wp.com/www.sciencenews.org/wp-content/uploads/2023/12/121623_YE_big-if_feat.jpg?fit=800%2C450&ssl=1",
        "source_id": "sciencenews",
        "source_priority": 9189,
        "country": [
          "united states of america"
        ],
        "category": [
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "f43feffdb338cc17fc4d1e810d750907",
        "title": "Astronomers detect almost 100 new extremely-metal poor galaxies",
        "link": "https://phys.org/news/2023-12-astronomers-extremely-metal-poor-galaxies.html",
        "keywords": [
          "Astronomy"
        ],
        "creator": null,
        "video_url": null,
        "description": "By analyzing the early data from the Dark Energy Spectroscopic Instrument (DESI), an international team of astronomers has identified 95 new extremely metal-poor galaxies at a low redshift. The finding is detailed in a paper published December 1 on the pre-print server arXiv.",
        "content": "December 15, 2023 report This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked preprint trusted source proofread by Tomasz Nowakowski , Phys.org By analyzing the early data from the Dark Energy Spectroscopic Instrument (DESI), an international team of astronomers has identified 95 new extremely metal-poor galaxies at a low redshift. The finding is detailed in a paper published December 1 on the pre-print server arXiv . Extremely metal-poor galaxies (XMPGs) are the ones with metallicity below 0.1 of the solar metallicity. Given that these galaxies are chemically unevolved, they can serve as excellent laboratories for investigating the chemical evolution theories of galaxies and studying the physical processes in the early stages of their evolution. Although XMPGs are assumed to be quite common at high redshift, they are difficult to observe due to their low masses. Therefore, astronomers are interested in the observations of local XMPGs at low redshift, as they are perceived as possible analogs of primeval high-redshift young galaxies of this type in terms of mass and metallicity. Now, a group of astronomers led by Hu Zou of the University of Chinese Academy of Sciences in Beijing, China, has obtained a large sample of XMPGs based on the early data from DESI. \"This work focuses on the analysis of DESI early data, including the Early Data Release (EDR; DESI Collaboration et al. 2023b), the detection of XMPGs and exploration of their mass-metallicity relation,\" the researchers wrote in the paper. All in all, the team first selected 1,623 star-forming galaxies with significant oxygen emission lines detection. From this sample, they identified 223 extremely metal-poor galaxies at redshifts below 1.0. Finally, they confirmed 95 of them as bona fide XMPGs, while the 128 galaxies remain XMPG candidates. Most of the XMPGs reported in the study were found at a low redshift of below 0.3 and turned out to be dwarf galaxies—with stellar masses not exceeding 1 billion solar masses . The most metal-poor galaxy in the sample, designated DESIJ150535.89+314639.4, has an oxygen abundance at a level of only 1/34 of that of the sun, has a stellar mass of about 15 million solar masses, and its star-forming rate was calculated to be 0.22 solar masses per year. The astronomers noted that preliminary imaging examination of the two most metal-poor galaxies discovered from their sample revealed two different morphologies. This suggests different evolution and physical origins; however, further studies are required in order to confirm this hypothesis. Summing up the results, the authors of the paper underlined that the extremely metal-poor galaxies detected by them are possibly low- redshift analogs of galaxies at high redshifts reaching 6.0 or even beyond. Therefore, they could be excellent objects for exploring the universe at its early stages of evolution. More information: Hu Zou et al, A Large Sample of Extremely Metal-poor Galaxies at z<1 Identified from the DESI Early Data, arXiv (2023). DOI: 10.48550/arxiv.2312.00300 Journal information: arXiv © 2023 Science X Network",
        "pubDate": "2023-12-15 11:50:01",
        "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/astronomers-detect-alm.jpg",
        "source_id": "phys",
        "source_priority": 6461,
        "country": [
          "united states of america",
          "australia",
          "singapore",
          "united kingdom"
        ],
        "category": [
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "8b60dcc532c916f0640926fcb9a76a93",
        "title": "Astronomers discover a new 'warm Jupiter'",
        "link": "https://phys.org/news/2023-12-astronomers-jupiter.html",
        "keywords": [
          "Planetary Sciences"
        ],
        "creator": null,
        "video_url": null,
        "description": "Astronomers from the Harvard–Smithsonian Center for Astrophysics (CfA) and elsewhere, report the discovery of a new 'warm Jupiter' exoplanet orbiting a rapidly rotating F-type star. The newfound alien world, designated TOI-4641 b could be nearly four times as massive as Jupiter. The finding was detailed in a paper published December 7 on the pre-print server arXiv.",
        "content": "December 15, 2023 report This article has been reviewed according to Science X's editorial process and policies . Editors have highlighted the following attributes while ensuring the content's credibility: fact-checked preprint trusted source proofread by Tomasz Nowakowski , Phys.org Astronomers from the Harvard–Smithsonian Center for Astrophysics (CfA) and elsewhere, report the discovery of a new 'warm Jupiter' exoplanet orbiting a rapidly rotating F-type star. The newfound alien world, designated TOI-4641 b could be nearly four times as massive as Jupiter. The finding was detailed in a paper published December 7 on the pre-print server arXiv . In general, warm Jupiters are gas giant planets with orbital periods between 10 and 200 days. This makes them challenging targets for transit detection, and radial velocity follow-up studies, compared to their shorter-orbit counterparts known as hot Jupiters. Now, a group of astronomers led by CfA's Allyson Bieryla has found a new exoplanet of this type. Using NASA's Transiting Exoplanet Survey Satellite (TESS), which is conducting an all-sky survey searching for transiting extrasolar worlds, they identified a transit signal in the light curve of TOI-4641—a bright and rapidly rotating F-star (with a projected rotational velocity of approximately 86.3 km/s). The planetary nature of this signal was confirmed by follow-up photometric and spectroscopic observations. \"A candidate exoplanet orbiting TOI-4641 with a period of 22.1d was identified in light curves including data through Sector 43 in both SPOC and QLP pipelines,\" the researchers wrote in the paper. The newfound planet has a radius of about 0.73 Jupiter radii and its maximum mass was calculated to be 3.87 Jupiter masses. The observations indicate that TOI-4641 b orbits its host star every 22.09 days at a well-aligned orbit, at a distance of some 0.173 AU from it. TOI-4641 b is therefore among the longest period planets, to be thoroughly characterized, that orbits a hot rapidly rotating star. The parent star TOI-4641 (also known as TIC 436873727), located some 286 light years away, has a radius of about 1.72 solar radii and is approximately 41% more massive than the sun. The star is estimated to be 2.69 billion years old, has a metallicity at a level of -0.09, and its effective temperature was found to be 6,560 K. The authors of the paper underlined that long-period exoplanets like TOI-4641 b could be crucial for testing mechanisms that induce primordial misalignment in planetary systems , given that at such orbital distances, star-planet tidal interactions are assumed to be too weak to modify the orbital obliquity. \"Testing these predictions motivate full characterizations of planets in long-period orbits about early-type stars,\" the scientists concluded. All in all, Bieryla's team proposes a few mechanisms behind such misalignment, including chaotic accretion, magnetic warping, or changes to the spin axes of early-type stars, as well as stellar or planetary companions during the primordial phase of formation. More information: Allyson Bieryla et al, TOI-4641b: An Aligned Warm Jupiter Orbiting a Bright (V=7.5) Rapidly Rotating F-star, arXiv (2023). DOI: 10.48550/arxiv.2312.03971 Journal information: arXiv © 2023 Science X Network",
        "pubDate": "2023-12-15 11:50:01",
        "image_url": "https://scx1.b-cdn.net/csz/news/tmb/2023/astronomers-discover-a-6.jpg",
        "source_id": "phys",
        "source_priority": 6461,
        "country": [
          "united states of america",
          "australia",
          "singapore",
          "united kingdom"
        ],
        "category": [
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "c28e7c167e811d063e9a18c1b7aa611e",
        "title": "The biggest science news stories of 2023 as chosen by New Scientist",
        "link": "https://www.newscientist.com/article/2408764-the-biggest-science-news-stories-of-2023-as-chosen-by-new-scientist/?utm_campaign=RSS%7CNSNS&utm_source=NSNS&utm_medium=RSS&utm_content=space",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "AI chatbots and an obesity treatment swept the world, temperature records tumbled and India landed on the moon in a year of astonishing science news",
        "content": "The spiral galaxy M51, as viewed by the James Webb Space Telescope ESA/Webb, NASA & CSA, A. Adamo (Stockholm University)/FEAST JWST team From extraordinary heat to stunning space imagery, has brought you extensive coverage of the biggest developments, discoveries and events in science, technology, health and environment in 2023. Here is our recap of some of the best stories this year. Read more Wildfires raged on the Greek island of Rhodes in July 2023 ANGELOS TZORTZINIS/AFP via Getty Images Advertisement The number of heat records broken in 2023 is simply astounding. While we can’t officially say for sure until final figures are in next month, this year was . In a sign of how extraordinary temperatures have been this year, was , well before the northern hemisphere summer had got into gear. A few weeks later saw a particularly surreal string of events. The average global air temperature recorded 2 metres above Earth’s surface – essentially, a way of taking the temperature of the entire planet – hit its highest ever figure on 3 July, but this record was , which was then . By the end of August, we had seen the and it was followed by the . In November, . Against this backdrop, negotiations at the COP28 climate summit in Dubai, United Arab Emirates, were a fraught affair. Whether the world would was a key point of disagreement and at one point looked set to . In the end, the world did agree to begin “ ” from fossil fuels – the first time they have been mentioned in a COP text – but . Sign up to our The Daily newsletter The latest science news delivered to your inbox, every day. The weight loss drug Wegovy saw a surge in demand in 2023 Carsten Snejbjerg/Bloomberg via Getty Images The demand for Wegovy, or semaglutide, this year has been like . As well as being incredibly effective for weight loss, early trials this year have shown that it may and could also help . Despite , along with , it is clear a health revolution has begun. 2023 has also been the first year since 2019 that covid-19 was not at the forefront of everyone’s minds. With the World Health Organization (WHO) announcing on 5 May the virus was , in some sense – at least for some. Millions of people are , a condition that remains poorly understood. Writers in London staged a rally in solidarity with striking US screenwriters, who demanded their jobs be protected from AI Vuk Valcic / Alamy Stock Photo By a rough count, has published almost . Tech firms were falling over each other to compete, from OpenAI claiming “ ” for GPT-4 to Google saying its . Then were concerns about the rise of , from an image of the to the risk of a , along with attempts at . AI was also the subject of high-level discussions across politics and business. It became a in the Hollywood writers’ and actors’ strikes, while world leaders, researchers and businesspeople in the UK to sign a declaration on the risks of the new technology. Truly, this was the year . Read more The dense centre of the Milky Way, as seen by the James Webb Space Telescope NASA, ESA, CSA, STScI, Samuel Crowe (UVA) The biggest space mission of the year was also one of the least expensive, with India’s . made it just the fourth nation to safely reach the moon, after the US, the Soviet Union and China. It also came just days after a Russian probe crash-landed on the lunar surface in an attempt to recapture that . Further out in space, the James Webb Space Telescope continued to shine, providing and advancing our understanding of the universe, from the to the . Read more Topics:",
        "pubDate": "2023-12-15 11:24:05",
        "image_url": "https://images.newscientist.com/wp-content/uploads/2023/12/15105210/SEI_169267858.jpg",
        "source_id": "newscientist",
        "source_priority": 4233,
        "country": [
          "united states of america"
        ],
        "category": [
          "science"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702639445351583334"
  }