{
    "status": "success",
    "totalResults": 1849,
    "results": [
      {
        "article_id": "a6865c1811344640dbcea1575177a099",
        "title": "Eric Bischoff On Whether WWE Trusts CM Punk, WWE’s Boom In Popularity",
        "link": "https://411mania.com/wrestling/eric-bischoff-wwe-trust-cm-punk-popularity/",
        "keywords": [
          "CM Punk",
          "Eric Bischoff",
          "WWE"
        ],
        "creator": [
          "Andrew Ravens"
        ],
        "video_url": null,
        "description": "On the latest episode of 83 Weeks, Eric Bischoff talked about the success that WWE has found over the last year, trust the company has[.........] The post Eric Bischoff On Whether WWE Trusts CM Punk, WWE’s Boom In Popularity appeared first on 411MANIA.",
        "content": "On the latest episode of 83 Weeks, Eric Bischoff talked about the success that WWE has found over the last year, trust the company has with CM Punk, and more. You can check out some highlights below: On the most crucial thing behind WWE’s boom in popularity: ‘Discipline, structured story and character development. And I would disagree to a degree with the person who posed that question. I think the Bloodline storyline, which started long before Vince left and was getting very exciting long before Vince left, Vince was very much a part of that storyline. And perhaps in some ways, at some points, he held it back. Maybe it could have gotten bigger, faster, stronger sooner. But Vince was very, very much a part of that. Vince’s [McMahon] commitment to Roman Reigns; let’s go back now three, four, five years. Vince was determined to get Roman Reigns over. So people could say, ‘Oh yeah, as soon as Vince left, everything got better.’ It’s not a very realistic perspective. “Yeah, I think things have gotten better better since Vince left. Only because I think the creative process is now much more efficient. I think your writing team can now, with confidence, start laying out stories without knowing in the back of their mind, in the front of the mind that there’s about a 75% chance, even though Vince would say, ‘Yeah, that looks good’ on Friday on the plane, going to Raw on Monday morning he might just tear the whole thing up and start over again. That’s a very, very uneasy feeling if you’re a creative person. And then you get to the building and you’re going to know that you’re going to have two hours to write a brand new show from top to bottom that has to be approved. Not only does it have to be approved, if there is a spelling error in the first draft of what you think you want to do and you want to present to Vince with only two hours before show time. But if he sees a typo or poor grammar, there’s a chance he’ll just rip the whole thing up without the rest of it, and ask you to go redo it. And let you know what he thinks of your grammar and your spelling on your way out the door. That’s not efficient creative. And it takes a creative person so outside of their game and the train of thought, the frame of mind, the vibe they have to be in, it’s just it’s a different world being in creative. And to have that kind of instability throughout the entire process doesn’t get you to the best creativity by any stretch of the imagination.” On whether WWE trusts Punk enough to make him World Champion: “You know, I don’t know the culture that exists today. I knew the culture that existed last time I was there. I was in — and I’m going to be very vague, but I’m doing it intentionally out of respect, so please accept that. But I was in a meeting, Punk’s name came up, and all of the key decision-makers in WWE at that time were in that meeting. And that name came up, and the conversation lasted all of three minutes. And that was the end of that. That was the culture then. I don’t know what the culture is now. You know, Triple H used to work for me, Paul Levesque worked for WCW before he went to WWE but I never got to know Paul then, a couple of conversations with him really. Even when I worked with him when I first went to WWE as a talent, very little conversation with Paul Levesque. When I worked there in 2019 for a cup of coffee, I interfaced with Paul Levesque more than I ever had in the previous 20 years. But even then, I didn’t really get to know him. So I don’t know what Paul thinks, and what his tolerance is for situations like CM Punk brings. “I suspect that — two things. One is, I don’t think CM Punk’s going to even try to exert the kind of — I’m going to call it bullying, right? He ain’t throwing his weight around backstage at WWE anywhere. The company is so much bigger than him, there’s no room for that there, and nobody will tolerate it. And I think because of history, people will be watching very carefully how Phil Brooks as an individual handles himself professionally behind — because there’s no question the CM Punk character is viable and valuable. The question mark is, is Phil Brooks the professional that he needs to be to make it work? I suspect he probably is. I suspect that, I hope, that Phil Brooks is going, ‘Wow, this is a hell of an opportunity. I can write the end of my own story. I can retire from this business on a positive note. And oh by the way, I can pocket millions and millions of dollars along the way. But I gotta be a team player.’ That’s what I hope, and that’s what I think is probably going on: he’s a smart guy. He has to be a smart guy to get where he is right now. But I do think that there’s probably eyes on Phil Brooks and the way he conducts himself. But I don’t know where the guardrails are, but I don’t think it’s going to be an issue, I really don’t. I said this before he even went there when speculation was, ‘Do you think he’ll go?’ I said, ‘Sure, he’ll go. If he has the opportunity, he’d be crazy not to.’ But he’s not going to get away — there is no CM Punk running amok backstage. No one’s going to get choked out. No one’s going to be in fear for their life. You’re not going to have the craziness and the mishegoss going on backstage and the drama that went on in AEW because it’s an entirely different environment.” If you use any of the quotes in this article, please credit 83 Weeks with an h/t to 411mania.com for the transcription.",
        "pubDate": "2023-12-15 13:00:02",
        "image_url": null,
        "source_id": "411mania",
        "source_priority": 18613,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "e1dcfb50423d6ab58749aa7766700240",
        "title": "Morning Report: Neil Magny reacts to Ian Machado Garry UFC 296 fight cancelation, admits fault in rivalry",
        "link": "https://www.mmafighting.com/2023/12/15/24000997/morning-report-neil-magny-reacts-to-ian-machado-garry-ufc-296-fight-cancelation-admits-fault-rivalry",
        "keywords": null,
        "creator": [
          "Drake Riggs"
        ],
        "video_url": null,
        "description": null,
        "content": "Neil Magny isn’t typically one to get caught up in trash talk. The UFC welterweight division’s all-time leader in wins last fought in a short-notice affair at UFC 292 in August. Magny filled in for his fellow veteran Geoff Neal to face rising undefeated Irish star Ian Machado Garry . Unfortunately for the 36-year-old, he was dealt an 11th career loss in his 39 outings when Garry won a one-sided unanimous decision. In the very brief build-up to the bout, Garry (13-0) targeted Magny personally, and specifically went after a comment Magny made towards Garry, saying he’d give him “a whooping that you give your son.” Garry ran with it and went on to call Magny an abusive father and state how such contexts shouldn’t be used and are never funny. Since then, Garry has pulled out of his upcoming fight at UFC 296 that was scheduled for tomorrow night against Vicente Luque . “The Future” has cited pneumonia as the reason for his withdrawal . The timing is brutal for Garry within the community, not only with it coming after his verbal attack on Magny, but drama has followed the Irishman in the form of a gym departure and a resurfacing of a controversial book published by his wife Layla Anna-Lee. Therefore, the online backlash has to have made Garry already hesitant about his public obligations before his fight was canceled. Despite their history, Magny isn’t at all basking in the fallout. “I’m fortunate now that like the majority of that stuff is behind me,” Magny told Middle Easy . “That didn’t affect me too drastically when it comes to my family life and that kind of thing. But, it’s unfortunate to see someone’s personal life be drug up the way his life has been drug up and all the stuff that he has to go through currently. I wouldn’t wish that on anybody, especially when you consider the entire family dynamic and all the people are involved in there. “Like yeah, him and his wife may have whatever going on, but at the end of the day, regardless of what’s going on, they share a child together. That child deserves the right to grow up knowing he has two loving parents or whatever. Again, all this stuff drug out into the media, out in the open, that kind of thing — I don’t think anyone is deserving of that regardless what they may or may not have done to me. I’m not gonna sit back and necessarily take joy in seeing that play out with somebody.” Garry’s win over Magny was his biggest to date and his sixth straight in the octagon. It’s unknown at this time whether or not the matchup with Luque will be rebooked as Kevin Holland has teased the possibility of taking Garry’s place. Magny, on the other hand, will look to rebound sooner rather than later when he faces Mike Mallott at UFC 297 in Toronto, Ontario, Canada on January 20. Ideally, “The Haitian Sensation” will one day score a rematch with Garry, but he won’t hold his breath. “If I’m being honest, it’s unfortunate,” Magny continued to reflect on his brief saga with Garry. “Having gone through what I got gone through based off of some of the statements and antics that Ian Garry said during fight week, it definitely caused some personal turbulence in my life, so to speak. But at the end of the day, I have to take accountability for the things that left my mouth and take accountability for the words that left my mouth. I definitely made statements that he was able to spin and play out in a different way than what I have intended to. “At the end of the day, that’s on me. I was the one who made those statements, made those statements publicly. How someone else perceived them or spun them — that’s outta my control, but I kind of gave him that opportunity to be able to do so. I have to own that fact and live with it, so to speak.” Finale. Brittney Palmer retires after winning ‘octagon girl of the year’ at World MMA Awards 2023 Rivals. Leon Edwards , Colby Covington nearly erupt into melee after insult aimed at champ’s late father Critique. Tony Ferguson fires back at critics over training with David Goggins ahead of UFC 296 Winners. World MMA Awards 2023 results Loss. UFC 296 loses Randy Brown vs. Muslim Salikhov , down to 12 bouts Between the Links Embedded 4. Pantoja vs. Royval 2 preview. Matt Serra ’s conditioning test. Full fight. Usman dissects UFC 296. Wonderboy’s picks. The War Room: Ferguson vs. Pimblett. Fancy Pantoja vs. Royval 2 preview. Weidman’s Return trailer. Zombie Trip. Prep. We never cut corners pic.twitter.com/ILqan3vUn0 Wicked. Woooow. Ramazan Asilderov sprains his ankle, then lands a huge uppercut right after to win by a R1 KO pic.twitter.com/SjHnZTHYKN That is what they say. Never forget. Sorcerers don’t get knocked out! #UFC296 pic.twitter.com/uvYtEGKKs8 Dangerous game to play. Paddy the Baddy fans giving Ilia Topuria grief as he boards the plane to Vegas pic.twitter.com/KfzLGiST4L Goals. I’m the best 2024 I gunna break all records and smash everybody. Out. The news is unfortunate. i did everything possible to stay in the fight but when i went to the hospital the doctors deemed me unfit to compete due to the flu. I'll be back early next year to put on a banger. Reaction. Pure savagery in that press conference Damnnn!! #ufc296 I’d still like to see Luque vs. Garry. There’s no reason it can’t be thrown onto UFC 297 or UFC 298 at the latest. Happy Friday, gang. Here’s to hoping the UFC goes out with a bang on its final card of the year. Have a good and safe weekend. Thanks for reading! If you find something you’d like to see in the Morning Report, hit up @DrakeRiggs_ on Twitter and let him know about it. Also, follow MMAFighting on Instagram and like us on Facebook .",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://cdn.vox-cdn.com/thumbor/eK5ANfqUhX7ew2OTvtk7VZOM2fM=/0x0:7570x5047/1310x873/cdn.vox-cdn.com/uploads/chorus_image/image/72965738/1621673110.0.jpg",
        "source_id": "mmafighting",
        "source_priority": 2363,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "d3d6aa862ca0c4a1768fb43a46827e0e",
        "title": "Badlands deer hunting pressure takes center stage as outdoors issue",
        "link": "https://www.inforum.com/sports/northland-outdoors/badlands-deer-hunting-pressure-takes-center-stage-as-outdoors-issue",
        "keywords": null,
        "creator": [
          "Brad Dokken"
        ],
        "video_url": null,
        "description": "It’s a social issue, in part, but it’s also becoming a biological issue as the percentage of deer harvested by archery in some Badlands hunting units approaches the percentage of deer taken by gun.",
        "content": "Growing up in western North Dakota, Angelo Vournas developed a passion for archery hunting in the Badlands at an early age. “My mom would call into school at noon and say I was sick, so I’d go down to the Badlands my senior year,” said Vournas, who graduated from high school in Williston, attended college at UND and now lives in Minot. “I spent a lot of time down there.” Then as now, the vast amount of public land available in the Badlands of western North Dakota and the potential for shooting a trophy mule deer buck with his bow were big attractions, Vournas says. READ MORE OUTDOORS ISSUES COVERAGE: Feds agree to draft new national recovery plan for gray wolves 40m ago Zebra mussels discovered in South Dakota portion of Lake Oahe 2d ago Second deer shot this fall south of Crookston tests CWD-positive 6d ago Dokken: Game and Fish may allow sharptail hunting north of U.S. Highway 2 Dec 2 “You can kind of go wherever you want because it’s all open,” he said. “The nice thing about the Badlands is that you have that accessibility, where you can stretch your legs out and cover ground and look at different things. “A lot of it is just getting by yourself. You can get off trail and not have to worry about people, typically.” ADVERTISEMENT The “not have to worry about people” part of the attraction has started to change in recent years as more people discover the Badlands and what it has to offer. That includes not only deer hunting, but sharp-tailed grouse hunting, hiking, biking and other outdoor recreational activities. But it’s the deer hunting pressure that has had perhaps the greatest impact on the experience, Vournas and others say. It’s gotten to the point, Vournas says, where he doesn’t even hunt the September archery opener anymore, “just because of the amount of people that are down there.” Many of those people, he says, are hunters, often from out of state, who may not understand how to pursue deer in the rugged Badlands environment. Vournas prefers the “spot-and-stalk” technique, glassing the horizon with binoculars in hopes of spotting a mule deer bedded down and then making a slow, stealthy pursuit that can take hours. “A lot of people just go walking around with their bows thinking they’re going to shoot a mule deer,” he said. “What they don’t realize is that they’re probably not going to shoot a mule deer and they’re screwing it up for everybody else who is trying to (spot) one and then be able to make a stalk on it.” In response to the uptick in Badlands traffic and calls from the public, the North Dakota Game and Fish Department is exploring options for managing the situation. “We’ve been hearing from the public for the last few years a bit more, I would say,” said Bill Haase, assistant wildlife chief for Game and Fish in Bismarck. “Especially from archery hunters. The hunting pressure is taking away from the quality of the hunt. And then from the gun hunters – they’re getting frustrated because it’s more and more difficult to draw that coveted (mule deer) gun tag.” Allocating licenses Game and Fish sets mule deer gun licenses based on population surveys, which gives them the flexibility to adjust tag numbers as necessary, but archery licenses are trickier because the regulations are in state law. North Dakota residents can buy archery tags basically over the counter, allowing them to hunt anywhere in the state and shoot either white-tailed or mule deer. ADVERTISEMENT There’s no limit on the number of whitetail-only bow licenses available to nonresidents, but nonresident “any-deer” archery tags – allowing the harvest of either a mule deer or a whitetail – are limited, by state law, to 15% of the previous year’s mule deer rifle tag allocation. Nonresident archery tags cost $250. It’s a social issue, in part, Haase says, but it’s also becoming a biological issue as the percentage of deer harvested by archery in some Badlands hunting units approaches the percentage of deer taken by gun. “The success rate in archery hunters the last few years has been anywhere from 9% to 15%, so it’s low,” Haase said. “It’s tough to shoot a deer in the Badlands with a bow, but the effort is really high. So, when you have a lot of people doing it, it starts to add up to a meaningful harvest.” Throw in a lower mule deer population, the result of poor fawn production after severe drought in 2021 and consecutive harsh winters in 2022 and 2023, and the issue becomes even more pronounced. Mule deer populations in the Badlands have declined from more than 10 deer per square mile to “probably below six,” Haase said in November during a livestream of the Game and Fish Department’s fall advisory board meeting in Bismarck. In this screen shot, Bill Haase, assistant wildlife chief for the North Dakota Game and Fish Department, discusses hunting issues Tuesday, Nov. 21, 2023, during the Game and Fish Department's District 7 fall Advisory Board meeting in Bismarck. The meeting was livestreamed on the Game and Fish Department website. Contributed / North Dakota Game and Fish Department Fawn production last spring was the lowest ever recorded, “and that’s concerning for us,” Haase told the Herald. “It’s been kind of a tough go here for a while, and our numbers have dropped – our densities are lower out there,” Haase said in an interview. “They’re OK – it’s not like we’re not going to recover from it. They’re down, but not drastically down because we’ve been very conservative with our gun tag allocation.” In 2023, Game and Fish offered 862 nonresident “any deer” bow licenses statewide. In response to the population decline, the department drastically cut mule deer gun licenses in 2023 – 2,250, compared with 5,750 in 2022 – but this year’s nonresident “any deer” bow tag allocation was higher than it should have been, Haase says, because of the state law requiring that nonresident any-deer bow licenses be set at 15% of the previous year’s mule deer gun tag allocation. ADVERTISEMENT Contributed / North Dakota Game and Fish Department Next year, nonresident “any deer” bow tags will “drop dramatically,” Haase said, because fewer mule deer gun licenses were available this year. “It’ll be a big drop (in 2024) because it’s a year delay on that, and so that’s kind of unfortunate,” he said. “We’re not able to be as reactive with that (nonresident “any deer” archery) tag allocation as it should be.” The past three years, Haase says, Game and Fish has expanded its post-hunting season archery surveys in an effort to learn more about where bowhunters are going and whether certain times of archery season are busier than others. “We found it’s busy, and it’s busy throughout the season,” he said. Tackling the issue In an effort to gain even more insight into the Badlands issue, Game and Fish last spring assembled a three-person “Badlands License Working Group,” which included a representative from the North Dakota Bowhunters Association, a representative from the North Dakota Chapter of Backcountry Hunters and Anglers and a certified Pope and Young scorer with ties to landowners and the Mule Deer Foundation. The group met twice in the spring and early summer, said Brock Wahl of Bismarck, co-chairman of the North Dakota Backcountry Hunters and Anglers chapter who was part of the group. Brock Wahl of Bismarck, co-chairman of the North Dakota Chapter of Backcountry Hunters and Anglers. Contributed / Backcountry Hunters and Anglers “In those meetings, we went over some of the data that Game and Fish had – what they’re seeing with that data, what they’re hearing from hunters, and some of that is just what’s going on in the rumor mill,” Wahl said. “Is there a lot of people concerned about it, or is it just a few people, or what’s going on – is it rifle hunters, bowhunters, landowners – what’s happening here?” In response to those meetings, Game and Fish contracted with a Colorado firm, HDNR Consulting LLC, to develop a survey, which was sent in September to a random sample of 8,000 North Dakota resident deer hunters. ADVERTISEMENT Out of those 8,000 hunters, more than 4,000 responded, and Game and Fish is in the early stages of analyzing the report, which is about 55 pages long, Haase says. “One of the takeaways was that the majority of people are interested in some type of specific management of these archery licenses,” Haase said. “It’s certainly something that we’re going to look at (for) nonresidents and residents,” in terms of how archery licenses are allocated. One thing’s for sure: Whatever changes ultimately result – if any – won’t be to everyone’s liking. “No matter what we do, I can assure you not everybody will agree with us,” Haase said. “There’s people on each end and everywhere across the middle. And there’s a lot of different ways to go, so it’s tough.” Max Hoefs of Grand Forks, who moved to North Dakota from Minnesota in the early 2000s, says he’s been hunting the Badlands since about 2006 and so far this year has spent about three weeks in the rugged country trying to fill his archery tag. “I fell in love with the Western-type of hunting; the spot-and stalk part of it is a little more challenging than sitting in a tree stand for whitetails,” he said. “Sitting on a nice butte, sitting on a nice hillside with a good pair of binoculars and just enjoying nature and looking for a good mule deer. … That’s how I fell in love with the out-West (style of hunting).” Like other resident archery hunters, Hoefs says he appreciates being able to purchase a license every year. On one hand, Hoefs says, he’d like to see fewer nonresident archery hunters in the Badlands – or perhaps even none – but understands the revenue that nonresident license fees bring to the Game and Fish Department. “I’d be really sad as a North Dakota resident not being able to bow hunt in the state” every year, Hoefs said. “But if it was proven that, ‘Hey, if we do this, if we cut the number of tags back, the deer population (and) the success rate would be better,’ would I be for it? Honestly, I don’t know.” ADVERTISEMENT The broad range of opinions definitely adds to the challenge, says Wahl of Backcountry Hunters and Anglers. “Everybody’s got an opinion about what’s going to work and what’s best for them. And I’m no different,” Wahl said. “I have my own biases, and I think the challenging thing for us as a chapter is this is going to be a difficult issue for us to really come out strong in support of one particular idea or concept because, with social issues, you’re going to have a lot of unique and passionate opinions. Everybody has their opinion of what’s best. And so as an organization, it would be very difficult for us to come out really strong in support of something and expect that all of our membership is going to be in unified agreement with that.” What’s next Once Game and Fish has analyzed the survey results, the department will meet in January with the Badlands License Working Group and hold public meetings around the state sometime in February or March to gather additional input, said Haase, the assistant wildlife chief. Whatever regulation changes are implemented for next fall, if any, will have to be included in the proclamation of proposed 2024 big game hunting regulations due at the governor’s office in mid-April, Haase said. Others would require legislative action because they’re in state law. “We don’t have to do everything this year,” he said. “Maybe we’ll implement some things this year and then analyze, see what happens and then adjust accordingly. “I don’t know yet, we’ll see. We haven’t made any determinations.” Change is often difficult, and this process is no different, Wahl said. “What we’re talking about here is changing a really long history of the way things have been done in North Dakota,” Wahl said. “And whether or not there’s going to be a change, I don’t know at this point. But I do think when you’re talking about these hunting traditions, tag allocation and season setting, those are tied to our traditions, and so anytime you’re talking about a change like this, which could affect archery and rifle seasons and how often you get to go hunting with certain weapons, that’s a big deal. ADVERTISEMENT “I would really encourage hunters who engage on this issue to keep an open mind and not be selfish.” Share Share this article News reporting News reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? Tags Tags NORTHLAND OUTDOORS GRAND FORKS HUNTING OUTDOORS ISSUES NORTH DAKOTA GAME AND FISH DEPARTMENT By Brad Dokken Brad Dokken joined the Herald company in November 1985 as a copy editor for Agweek magazine and has been the Grand Forks Herald's outdoors editor since 1998. Besides his role as an outdoors writer, Dokken has an extensive background in northwest Minnesota and Canadian border issues and provides occasional coverage on those topics. Reach him at bdokken@gfherald.com, by phone at (701) 780-1148 or on X (formerly Twitter) at @gfhoutdoor. Twitter",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": null,
        "source_id": "inforum",
        "source_priority": 14163,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "5cd19a04f3919fdafe90df8b5b75ce7c",
        "title": "Game wardens in the sky: Here's what DNR pilots do",
        "link": "https://www.inforum.com/sports/northland-outdoors/game-wardens-in-the-sky-heres-what-dnr-pilots-do",
        "keywords": null,
        "creator": [
          "John Myers"
        ],
        "video_url": null,
        "description": "Duluth native Jake Willis takes over as the Minnesota DNR's chief pilot.",
        "content": "GRAND RAPIDS — Chris Lofstuen retired from his dream job as a Minnesota Department of Natural Resources pilot last week. Lofstuen, of Duluth Township, had been the DNR’s chief pilot since 2019. He didn’t want to leave his passion for being a flying game warden in the rearview mirror. But he says he feels pretty good about the fact the job is now in the hands of a good cop, a good pilot and a good friend. Duluth native Jake Willis has taken over as the chief DNR pilot, heading the agency’s aviation unit based out of Grand Rapids. Willis, 43, and Lofstuen, 57, have been buddies for years. Jake Willis, the new chief pilot for the Minnesota DNR's aviaton unit, during a patrol flight. Sky wardens like Willis conduct routine patrols and also work with wardens on the ground to locate illegal activities, such as baiting for deer or destroying wetlands, that may be out of view of officers on the ground. Contributed / Jake Willis Willis, an avid outdoorsman, is a Duluth native and Superior High School graduate who went from being a Duluth city (and previously University of Minnesota Duluth) cop to game warden, trading his urban beat for a backwoods patrol. Before accepting the chief pilot job, Willis had patrolled the woods and waters of the Brookston station just outside Duluth since 2018. On the ground, as a fully licensed police officer — as all state conservation officers are — Willis may respond to a drunken driver call one hour, illegal spruce tree cutting the next and then reports of a dead bear struck by a car, all between his contacts with hunters and anglers. ADVERTISEMENT But now he’s also going to be in charge of the DNR’s aviation unit, carrying on a tradition that started in 1947. One of two original Minnesota DNR game warden pilots, John Parker, a World War II veteran who started flying for the DNR in 1947. Parker was stationed in Warroad. Contributed / Minnesota DNR “It’s become a pretty important part of what (DNR) is trying to accomplish,” Lofstuen said of the aviation unit. “Not just natural resource protection and management, but public safety in some pretty remote places.” A broad mission in the air Aviation unit pilots over the years have conducted a huge variety of missions — everything from keeping an eye on hunters and anglers, searching for and rescuing lost or injured people, and even ferrying out dead bodies from hard-to-reach locations. Those historic missions continue today with added duties of stocking fish in remote lakes, monitoring wildfires, conducting aerial surveys for wildlife research — waterfowl, elk, moose, deer, wolves and more. They also conduct surveys of how many anglers — boats in summer, ice houses in winter — are fishing on a given lake on a given day, part of the DNR’s creel survey efforts to determine how much fishing pressure is happening on any given body of water. A DNR aviation unit helicopter involved in a moose survey in Northeastern Minnesota. While the pilots are officially part of the DNR's law enforcement division, much of their work involves fish and wildlife research. Contributed / Quintin R. Slade / Minnesota DNR “The majority of our time in the air really isn’t for law enforcement. It’s primarily a lot of research work with some public safety mixed in,” Lofstuen noted. But even while working on aerial surveys for wildlife research, DNR warden pilots can help make a bust. From the air, the DNR pilots are able to see things that officers on the ground can’t — like a backhoe illegally altering a stream a mile from the nearest road or a deer hunter with a pile of illegal bait on a big chunk of private property. A Minnesota DNR pilot and helicopter stock trout into a remote lake in northern Minnesota. While the DNR aviation unit is officially part of the enforcement division, the pilots spend much of their time performing fish, wildlife and other natural resource jobs in the air. Contributed / Minnesota DNR Willis recalls one case early in his DNR career when he was flying with an aviation unit pilot on another mission when they noticed a pile of bright orange pumpkins piled along a field, not far from a deer stand. “Corn and pumpkins show up like a beacon from the air,” Willis noted. “We marked it with a GPS pin and finished what we were doing that day. … And on opening morning (of deer hunting season), I walked in there, much to the guy’s surprise. He couldn’t figure out how I knew the bait was there because I hadn’t even walked over to it yet.” ADVERTISEMENT Subscribers Only Northland Outdoors ALSO READ: Carlton County conservation officer follows in grandfather's footsteps Cloquet native Mikeena Wehr returns home to patrol the same woods and waters that Lee Alderson covered. Oct 20 · By John Myers Some hunters intent on breaking the law will go to great lengths to hide their illicit acts. Some DNR pilots have reported camouflage netting strung over bait piles. Willis and Lofstuen noted that some hunters have even painted white PVC pipe to look like a birch tree, and then filled it with corn so only a small amount comes out the bottom — like an automatic pet or livestock feeder. At night, thieves stealing spruce tops or birch trees off public or private land tend to work in the dark. But DNR pilots generally fly low and slow enough to see whatever doesn’t look quite right on the ground. “If something is happening way back on a piece of private property, they can see that from the air. I could legally walk in there. We have that right. But I’m probably not going to go in unless I’m sure there is something going on,” Willis noted. “When we see it from the air, we know for sure.” Duluth-area Conservation Officer Kipp Duncan said DNR pilots often see things while conducting fish or wildlife surveys that they pass on to wardens on the ground, one cop’s tip to another, that often help in making a case. In other cases, the cooperation is more direct. “In one shining case (using a floodlight or vehicle light to shine deer to shoot at night) I had, they directed me right to the guy who still had the light on and a loaded gun in his hands,” Duncan noted. READ MORE IN NORTHLAND OUTDOORS: Subscribers Only Northland Outdoors Badlands deer hunting pressure takes center stage as outdoors issue It’s a social issue, in part, but it’s also becoming a biological issue as the percentage of deer harvested by archery in some Badlands hunting units approaches the percentage of deer taken by gun. 1m ago · By Brad Dokken Northland Outdoors Feds agree to draft new national recovery plan for gray wolves U.S. Fish and Wildlife Service has two years to develop a plan for conserving gray wolves, which are considered threatened in Minnesota 40m ago · By Dan Gunderson / MPR News Northland Outdoors Fisheries biologist offers ice fishing outlook for Devils Lake Complex. The walleye outlook is favorable on Devils Lake, Stump Lake and Lake Irvine. Check out the webcast for specifics on pike and perch. 14h ago · By North Dakota Game and Fish Department Northland Outdoors Northland Outdoors Forecast: Chance of rain/snow to start the weekend. Saturday and Sunday look to bring more quiet and mild weather to our region. 21h ago · By Robert Poynter Northland Outdoors Devils Lake fisheries supervisor offers Northeast District ice fishing preview Bryan Sea is Northeast District fisheries supervisor for the North Dakota Game and Fish Department in Devils Lake. 21h ago · By North Dakota Game and Fish Department Northland Outdoors Dry conditions throughout Minnesota increase potential for wildfires, DNR says Dry, brown grasses and vegetation mean wildfires can start easily and spread quickly; this elevated risk is likely to persist until we have continuous snow cover. 1d ago · By Staff reports Northland Outdoors Long fall causing headaches for anxious ice anglers Warmer temperatures have slowed down the process of lakes freezing over. 2d ago · By Michael McGurran Northland Outdoors In retirement, Fargo angler is fishing lure craftsman A Fargo man is carrying on a tradition he started decades ago: hand crafting fishing lures 2d ago · By Kevin Wallevand Northland Outdoors Snowmobile North Dakota to mark 50 years State awaits adequate snowfall for trail openings. 2d ago · By Staff Report Northland Outdoors Zebra mussels discovered in South Dakota portion of Lake Oahe Cow Creek is more than 100 lake miles south of the North Dakota-South Dakota border, said Ben Holen, aquatic nuisance species coordinator for the North Dakota Game and Fish Department. 2d ago · By Staff Report Northland Outdoors Doug Leier: Safety remains first priority when venturing onto the ice Since that cold start to November, the weather has moderated so much that ice conditions have deteriorated on many waters, particularly in the southern half of North Dakota. 2d ago · By Doug Leier Northland Outdoors North Dakota Game and Fish announces tentative 2024 hunting openers Game and Fish annually provides the estimates to help hunters prepare for the various hunting seasons. 3d ago · By Staff Report From Duluth cops to DNR Lofstuen, who started in law enforcement with the West St. Paul Police Department, moved north to be closer to the outdoor activities he loved. He said he loved his previous job as a sex crimes investigator for the Duluth Police Department and was reluctant to leave. But the chance to combine three of his passions with the DNR job — flying, the outdoors and law enforcement — was too good to turn down. Both Lofstuen and Willis have been pilots since they were 18. ADVERTISEMENT Willis received his degree in law enforcement and aviation from Minnesota State University-Mankato. His goal had been to become a commercial airline pilot. But the cost and time it took to train for that job seemed out of reach. Instead, Willis became a cop, first for the University of Minnesota Duluth and then the Duluth Police Department. He slowly left his passion for flying behind. That is until Lofstuen coaxed him into a ride out of the Two Harbors airport on Lofstuen’s private plane. The love of flying “immediately came right back to me when I went up with Chris. I went right out and got current (with his private pilot's license requirements) after that,” Willis said. “I missed it that much and didn't know it.” DNR pilots Jake Willis, left, and Chris Lofstuen at Lofstuen's retirement party in the DNR hangar at the Grand Rapids/Itasca County Airport on Dec. 1. John Myers / Duluth Media Group Lofstuen had dreamed of a career as a corporate pilot flying bigwigs around in Gulfstream jets. That never happened, and instead, the Bloomington, Minnesota, native ended up as a police officer. But he never stopped flying. “Before I wanted to be a cop, I wanted to be a pilot. This job let me do both,” Lofstuen said of his DNR gig. “Once you get into public service like this, it’s a big part of who you are.” In recent years, Willis has been flying part time for DNR in addition to his field station work on the ground. When Lofstuen was forced to retire due to a medical issue that ended his piloting days — after 32 years in law enforcement, including 10 years as a flying warden with DNR — Willis was encouraged to apply for the job. “I probably won’t be flying any more than I was before because a big part of the chief pilot job is administrative,” said Willis, who did get a nice bump to the rank of captain. Aviation unit started with WWII vets Two of the aviation unit’s first pilots, Robert Hodge and John Parker, were recently inducted into the Minnesota Aviation Hall. Both men flew in the military during World War II and, in 1947, joined what then was the Minnesota Department of Conservation, Hodge in the Ely area and Parker at Warroad. The unit started with two planes and not much direction. One of two original Minnesota DNR aviation unit pilots, Robert Hodge was stationed in Ely starting in 1947. Contributed / Minnesota DNR “Before the era of GPS, we often didn’t know where these guys were or what they were doing,” Lofstuen noted. ADVERTISEMENT There currently are five pilots — including Willis — in the unit who are also licensed conservation officers and two others who are “natural resource” pilots who are not officers. Combined, they may fly over 2,000 hours for the DNR in a year. The Minnesota DNR's aviation unit has a mix of small aircraft used to conduct various natural-resource-focused missions across the entire state. Contributed / Minnesota DNR Lofstuen said it’s important that as many DNR pilots as possible are licensed officers who are trained in police work. “It’s essentially a flying police officer. And we see things other people might miss that might be important in the investigation,” Lofstuen noted. The DNR aircraft — planes and helicopters — and their pilots are stationed in Bemidji, Brainerd, Grand Rapids and Mankato but end up flying over all areas of the state. Those aircraft can take off and land not just from any airport in the state, but some are fitted with floats for summer lake work and then skis for winter. Willis has spent much of his time in a two-seat American Champion Scout, a tiny plane that is perfect for low-level reconnaissance. Another workhorse of the DNR fleet is the Cessna 185, including one stationed in Grand Rapids that has floats and wheels. Minnesota game wardens use both planes and helicopters to patrol the skies. Contributed / Minnesota DNR The aviation unit covers the entire state, especially for fish and wildlife missions like elk surveys in the far northwestern corner of the state and moose surveys in the far northeast. But the focus often is on state-managed lands, including 75 state parks, 1,300 miles of trails, 3,000 public access lakes and rivers and some 5 million acres of state forest. \"We try to prioritize what is pretty expensive flight time,\" Lofstuen said. \"Are we going to land that float plane on a lake to check one angler for a fishing license? That's probably not the best use of taxpayers' money when someone can do it from a boat. So we focus on the higher value things we can do.\" The DNR pilots spend most of their time flying low and slow, which requires constant attention to flying as well as whatever they are monitoring on the ground. A special waiver from the Federal Aviation Administration allows them to fly as low as 100 feet. They don’t often fly much at night or in bad weather, but all of the DNR pilots must be instrument-rated to fly in all kinds of Minnesota conditions. ADVERTISEMENT A historic photo of a Minnesota DNR aviation unit float plane on the job. Contributed / Minnesota DNR It has sometimes been dangerous work. In June 1999, Grant Coyour of Bemidji — a veteran DNR conservation officer and pilot — and a student biologist were killed when their 1977 Piper Cub airplane crashed into a bog during a moose survey in the Red Lake Wildlife Management Area south of Baudette. Next year, the aviation unit will take delivery of a new Cessna 206, a turbocharged single-engine aircraft that will be fitted with the latest in infrared and night vision sensing and photography technology aimed at helping in wildlife surveys. In other states, the same technology has been used to survey wildlife as small as grouse and as large as elk, Lofstuen noted. The technology can also be used to map wildfires at night, showing the size and footprint of the fire and locating where any hotspots may be. There’s even a laser option that can be used to direct wardens on the ground to a specific location. “In some sense, we’re using the same technology we were back in 1947… a pair of binoculars and a pilot looking out the window,” Lofstuen said, noting that conducting elk surveys, for example, requires the pilot to fly not much higher than tree-top altitude. The new technology will be safer and more accurate, he noted. “This is going to bring us into the modern era and really expand what we can do from the air.” more by john myers Subscribers Only Minnesota Video captures firefighters' harrowing dog rescue in Duluth Ship Canal Duluth firefighters climbed into 8-foot waves rolling in off Lake Superior to rescue a dog that had escaped its owner and leash 3d ago · By John Myers Subscribers Only Northland Outdoors Rural Duluth man may be the best wildlife artist you've never heard of Dec 8 · By John Myers Northland Outdoors Angry deer hunters rally against wolves, DNR, Democrats Dec 7 · By John Myers Subscribers Only Northland Outdoors More chronic wasting disease found in Minnesota deer Nov 30 · By John Myers Comments Share Share this article News reporting News reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? Tags Tags AVIATION NORTHLAND OUTDOORS MINNESOTA DEPARTMENT OF NATURAL RESOURCES DULUTH OUTDOORS PEOPLE SUBSCRIBERS ONLY By John Myers John Myers reports on the outdoors, natural resources and the environment for the Duluth News Tribune. You can reach him at jmyers@duluthnews.com. Twitter Facebook Conversation",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": null,
        "source_id": "inforum",
        "source_priority": 14163,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "08bb2ccc24438e22c5fc0ef76fc85d46",
        "title": "Top 10 Moments of 2023",
        "link": "https://www.theringer.com/2023/12/15/24001668/top-10-moments-of-2023-shows-movies-ip",
        "keywords": null,
        "creator": [
          "Joanna Robinson",
          "Mallory Rubin"
        ],
        "video_url": null,
        "description": null,
        "content": "As the year comes to a close, Mal and Jo look at their top 10 moments of 2023 , and talk about their favorite shows, movies, and pieces of IP! Hosts: Joanna Robinson and Mallory Rubin Associate Producer: Carlos Chiriboga Social: Jomi Adeniran Addition Production Support: Arjuna Ramgopal Subscribe: Spotify / Apple Podcasts / Stitcher / Pandora / Google Podcasts The Ringer ’s Streaming Guide",
        "pubDate": "2023-12-15 12:59:34",
        "image_url": "https://cdn.vox-cdn.com/thumbor/3_b6MCdQD3NPh1h_T4y-1GpRO0g=/167x0:2834x2000/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/72965688/tlou109_hbo.0.jpg",
        "source_id": "theringer",
        "source_priority": 2702,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "0553803ba89a9e2415277ef7740b6147",
        "title": "“Ask My Millions & Millions of Fans”: Nick Kyrgios Locks Horns With Netizens While Responding to Boris Becker’s Jab at Him",
        "link": "https://thesportsrush.com/tennis-news-ask-my-millions-millions-of-fans-nick-kyrgios-locks-horns-with-netizens-while-responding-to-boris-beckers-jab-at-him/",
        "keywords": [
          "Tennis",
          "nick kyrgios"
        ],
        "creator": [
          "Atharva Upasani"
        ],
        "video_url": null,
        "description": "Nick Kyrgios is famous for his controversial opinions. Recently, Kyrgios has been involved in a social media spat with tennis legend Boris Becker. During his X feud with Becker, Nick Kyrgios even got into an altercation with a tennis fan. The Australian was responding to Becker and took a shot at the former World No.1… The post “Ask My Millions & Millions of Fans”: Nick Kyrgios Locks Horns With Netizens While Responding to Boris Becker’s Jab at Him appeared first on The SportsRush.",
        "content": "Nick Kyrgios is famous for his controversial opinions. Recently, Kyrgios has been involved in a social media spat with tennis legend Boris Becker. During his X feud with Becker, Nick Kyrgios even got into an altercation with a tennis fan. Advertisement The Australian was responding to Becker and took a shot at the former World No.1 by suggesting he has an ego issue. Kyrgios claimed that he will not compare himself with the new generation of players after next 20-30 years. This tweet was met with different sort of responses but one reply stood out. Advertisement Nick Kyrgios and Boris Becker’s row on X is showing no signs of stopping. Both the tennis superstars are going back and forth at each other with their different opinions. Both the tennis stars have big personalities, which could only escalate the feud more. How did the Nick Kyrgios and Boris Becker feud begin? In an interview, Nick Kyrgios claimed that the older generation of players cannot compete with the new generation. The Australian believed that the like of Novak Djokovic would have easily beaten players like Pete Sampras and Boris Becker at their peaks. However, these comments did not go well with Boris Becker. Boris Becker claimed Nick Kyrgios make a lot of noise. Becker, who is co-incidentally also the former coach of Novak Djokovic, was unhappy with Kyrgios comparing the older generation of players like Rod Laver, Bjorn Borg, and John McEnroe, among others to the current generation. Becker even took a shot at Kyrgios for controversially having an OnlyFans account. It will be interesting to see how long this feud between these two big tennis personalities last for.",
        "pubDate": "2023-12-15 12:53:23",
        "image_url": "https://cdn-wp.thesportsrush.com/2023/12/95b04a29-untitled-design-2023-12-15t161614.807.jpg",
        "source_id": "thesportsrush",
        "source_priority": 4166,
        "country": [
          "united states of america",
          "united kingdom",
          "india",
          "australia"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "dbd295d6932e27225beadd0934eb1860",
        "title": "Boldy scores in regulation and shootout as Wild beat Flames 3-2",
        "link": "https://www.cbsnews.com/minnesota/news/boldy-scores-in-regulation-and-shootout-as-wild-beat-flames-3-2/",
        "keywords": [
          "Wild",
          "Sports"
        ],
        "creator": [
          "CBS Minnesota"
        ],
        "video_url": null,
        "description": "Mats Zuccarello and Matt Boldy scored in the shootout to lift the Minnesota Wild over the Calgary Flames 3-2.",
        "content": "Mats Zuccarello and Matt Boldy scored in the shootout to lift the Minnesota Wild over the Calgary Flames 3-2 on Thursday night. Boldy and Marco Rossi scored in regulation for Minnesota, which is now 6-2 since John Hynes took over as coach for Dean Evason. Filip Gustavsson stopped 36 shots in goal for the Wild. \"It's just good to win,\" Boldy said. \"You've got a group of guys that work hard every night. Lotta desperation to win to get that kind of streak going and stuff like that, so a lot of credit to other guys.\" Yegor Sharangovich and Blake Coleman scored, while Dan Vladar made 30 saves for the Flames, who are 1-5-1 in their last seven games. MORE: St. Croix Lutheran Academy's Laura Hauge breaks state 3-pointer record Sharangovich also scored in the shootout, but Gustavsson stopped Nazem Kadri as the fourth shooter to preserve the win. \"This was a good game, probably for both sides, I would say,\" Calgary coach Ryan Huska said. \"I thought we had a slow first 10 minutes but then I liked our game from that point forward. I felt like we deserved the extra point tonight.\" Boldy has seven goals and two assists in the eight games since Hynes took control. He scored his eighth goal of the season in the first period. Sharangovich is on his own scoring streak, scoring for the fourth straight game. He scored on the power play in the second, giving him five goals in the past four games. Calgary took a lead in the third when Coleman's pass to Sharangovich went off defenseman Brock Faber's skate and into the goal. Coleman was credited with his ninth goal of the season and it was the sixth short-handed goal of the season for the Flames, which is tied for the third-most in the NHL. But Minnesota answered just 45 seconds later when Rossi one-timed a long rebound from Vladar to score for the second game in a row. Rossi has 10 goals, which is second behind Connor Bedard among NHL rookies. \"I didn't really hit it good,\" Rossi said. \"I fanned on it, but I'll take that.\" Both teams were missing important pieces of their defensive core. MORE: Red Bull Heavy Metal to bring street snowboarding event to St. Paul in February Minnesota placed Jonas Brodin on long-term injured reserve a day earlier with an upper-body injury and captain Jared Spurgeon was held out with a lower-body injury. Brodin was seen in pictures on social media with a cast on his right wrist/arm at a team function. Spurgeon is considered day-to-day. \"Thought it was a really strong team game for us,\" Hynes said. \"Injuries are part of the league. When you can play a really compact, strong team game, it gives you the best chance to win. Our D-core played really well, we played well as a five-man unit. I think when you can play with structure, everybody contributes, it gives you a chance to win.\" Chris Tanev, an assistant captain for Calgary, missed his second straight game with an upper-body injury and is considered day-to-day. UP NEXT Flames: Return home against Tampa Bay on Saturday. Wild: Host the Vancouver Canucks on Saturday. NOTE: The original airdate of the video attached to this article is Nov. 28, 2023.",
        "pubDate": "2023-12-15 12:52:30",
        "image_url": "https://assets3.cbsnewsstatic.com/hub/i/r/2023/12/15/a887e449-9194-4a72-a6b5-bdffcb1112af/thumbnail/1024x576/e9f5b0baefa13988f8c65bb784a9eb70/ap23349103929680.jpg?v=5382e209c94ee904b3a96a69f8ca0ce0",
        "source_id": "minnesotacbslocal",
        "source_priority": 237564,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "14d4f59632f62987077fb1e9dbdcb649",
        "title": "Fanatics Sportsbook New Jersey Promo Code | December 2023",
        "link": "https://nypost.com/sports/fanatics-sportsbook-new-jersey-promo-code/",
        "keywords": null,
        "creator": [
          "Action Network"
        ],
        "video_url": null,
        "description": "Fanatics Sportsbook NJ is headed to the Garden State! Read on for more information on New Jersey's next online sportsbook, including details on the Fanatics Sportsbook NJ promo code!",
        "content": "Fanatics Sportsbook NJ is officially headed to the Garden State. Following the brand’s acquisition of PointsBet Sportsbook ‘s U.S. assets in June of 2023, PointsBet New Jersey is set to transition to Fanatics Sportsbook New Jersey in the early stages of 2024. Once the brand makes its debut in the state, a special welcome offer will be available to new users who register for an account using the Fanatics Sportsbook New Jersey promo code . Read on for more details regarding Fanatics Sportsbook New Jersey. We discuss its potential welcome bonus for new users, the features that help it compete in the legal sports betting industry , and other details about one of the fastest-rising sportsbooks on the market. Fanatics Sportsbook NJ is not currently available, but we expect a launch to happen in early 2024. Earlier this fall, CEO Michael Rubin said that the operator would go live in the biggest sports betting states during football season. Some of the other states expected to acquire the brand’s services include New York , Pennsylvania , Connecticut , and Michigan . As far as a launch date goes, we anticipate Fanatics Sportsbook NJ’s arrival sometime in early 2024. There have been some rumblings about states surrounding NJ launching the platform during the NFL season, which is now down to just December 2023 and January 2024. So, while there is nothing official, the clues tell us it could be sooner rather than later. The fact that Fanatics Sportsbook NJ is transitioning from PointsBet NJ should help expedite the process. Since Fanatics Sportsbook NJ is not yet live, there is no active promo code or welcome offer associated with it. We expect the welcome offer to be similar to the one currently live in the brand’s other active states. That offer allows users to Bet $10+ Over 5 Days, and Get $200 in Bonus Bets. If the operator implements the welcome offer in New Jersey the same way it does in other states, users won’t need a promo code at all. Simply registering on the platform and making qualifying wagers will be enough to claim your bonus bets. As soon as any official Fanatics Sportsbook New Jersey promo code or welcome offer is revealed, we’ll be sure to provide any updates right here. While specific details may change upon the official release of Fanatics Sportsbook NJ, the general process of signing up for an online sportsbook follows a similar pattern across all platforms. Here’s a general guide on how to sign up, but please refer to the official Fanatics Sportsbook NJ app when it becomes available for the most accurate and current instructions: Here’s how to claim the Fanatics Sportsbook NJ promo code once the offer becomes available. We also discuss how to deposit funds and start playing so you can make the most of your welcome bonus. Most likely, you won’t need a promo code to claim the welcome offer at Fanatics Sportsbook NJ. This prediction stems from the fact that the operator provides its welcome offer to users in other states upon signup. So, simply click the links on this page to create an account and make qualifying wagers to receive your bonus once the operator goes live in the Garden State. Once your Fanatics Sportsbook NJ account is verified and approved, you’ll need to deposit funds to start betting and claim your bonus. Navigate to the “Deposit” or “Cashier” section, where you’ll find various payment options. The operator typically accepts major credit and debit cards, bank transfers, and e-wallets. Choose your preferred method, enter the required details, and specify the amount you want to deposit. Keep in mind that some deposit methods may have associated fees or processing times, so check the terms for each option. After completing the deposit, your account balance will reflect the deposited amount, and you can begin placing bets. You’ll have to deposit at least $10 to take advantage of the projected Bet $10+ for 5 Days, Get $200 in Bonus Bets welcome offer. Betting $10 per day translates to $40 in bonus bets per day. If you bet $10 each day over five days, you’ll need to deposit $50 and you’ll end up with a total of $200 in bonus bets. Fanatics Sportsbook NJ may require you to place wagers to get bonus bets. You can qualify for the operator’s welcome offer by participating in a range of ways to play that cater to both casual bettors and seasoned enthusiasts: Traditional pre-game betting is the most prevalent and straightforward form of sports betting. It revolves around predicting the outcome of a sporting event before it commences. Users engage in this process by scrutinizing the sportsbook’s odds, assessing potential outcomes such as victory, defeat, or a draw, and placing their bets accordingly. Examples of traditional pre-game bets encompass predicting the winner of a basketball game, estimating the total number of goals in a soccer match, or wagering on the point spread in a football game. Bettors who strategically place such wagers well in advance of the event may factor in considerations such as team statistics and player performance into their decision-making process. Live in-play betting is a dynamic facet of the sports betting world. It unfolds while a sporting event is in progress, enabling users to place bets on various outcomes and events during the game. The process involves users getting access to continuously updated odds based on the current situation as the game evolves. Users can engage in real-time betting on dynamic markets, such as predicting the next team to score, the outcome of the next play, or the total points in a quarter. Examples of live in-play bets include wagering on which team will score the next goal in a soccer match, predicting the outcome of the next drive in a football game, or betting on the winner of the next set in a tennis match. A parlay , also known as an accumulator or a combo bet, involves consolidating multiple individual bets into a single wager. All included bets must be successful for a parlay to win. In the parlay process, users select two or more separate bets and combine them into a single bet slip, with the odds for each selection being multiplied to determine the potential payout. While parlays present the allure of higher potential payouts due to the increased risk of multiple correct bets, they also entail a greater risk of losing, as every component must win for the overall bet to succeed. Prop bets, or proposition bets, introduce a unique dimension to sports betting by allowing users to bet on specific events or outcomes within a game that may not directly impact the final result. The process involves sportsbooks offering a diverse range of prop bets, spanning from predicting player performances (e.g., total yards a quarterback will throw) to specific occurrences (e.g., which team scores first). Examples of prop bets include wagering on the number of three-pointers a basketball player will make, predicting the player to score the first touchdown in a football game, or betting on the duration of the national anthem at a sporting event. These bets contribute diversity and entertainment to sports betting, enabling users to engage with specific elements of a game beyond merely predicting the final score. Here’s what to expect from the Fanatics Sportsbook NJ mobile app . As with any online sports betting platform , user experience can vary, so it can be helpful to understand the app’s strengths and weaknesses. Here’s an overview of the betting markets and bet types available at Fanatics Sportsbook NJ: Placing bets responsibly is crucial to ensure an enjoyable and sustainable sports betting experience. Fanatics Sportsbook New Jersey provides a user-friendly platform for bettors to engage with their favorite sports responsibly. Here’s a step-by-step guide on how users can place bets on the app once they create their account: While we’ve put a lot of emphasis on the welcome offer at Fanatics Sportsbook NJ, the operator’s perks don’t stop there. We explore some of the platform’s ongoing promotions below, as they can further incentivize users by rewarding them for their continued engagement. FanCash is the loyalty program associated with Fanatics Sportsbook NJ, providing users with a way to earn rewards based on their betting activities. As users place bets on the platform, they accumulate FanCash. The more a user bets, the more FanCash points they earn. Bettors will receive 1% back in FanCash for every straight wager placed, 3% back on parlays, and 5% back on Same Game Parlays. Users can redeem these credits for various rewards, such as bonus bets or merchandise from the brand’s apparel website. The FanCash Loyalty Program is designed to enhance user engagement, reward customer loyalty, and provide additional value for sports bettors in New Jersey. Fanatics Sportsbook New Jersey will have a refer-a-friend program available to its existing users. In this case, users will be able to invite friends or family to register with the site and can earn up to $500 in FanCash in the process. For each successful referral, both parties will earn $100 in FanCash. All that needs to happen in order to receive the $100 is that the referred player must deposit $10 and place a wager of $10 or more. After doing so, both the new and the existing user will receive $100 in FanCash. There is a cap of five referrals for each existing user, meaning players can earn up to $500 in FanCash through this promotion if fully taken advantage of. Bonus bets are a popular form of promotion in the sports betting industry, providing users with additional funds to wager. These bonuses can be part of a welcome package for new users, though some operators also offer them as ongoing promotions for existing users. Bonus bets may be acquired through deposit matches, first-bet offers, or other creative promotions. For New Jersey sports bettors, bonus bets offer an opportunity to explore additional markets, try new betting strategies, and enhance their overall betting experience. In this section, we will explore some of the popular sports teams in New Jersey. New Jersey is home to a diverse range of teams, creating an exciting landscape for sports enthusiasts and bettors alike. Local professional teams to wager on at Fanatics Sportsbook NJ include: The New York Giants represent the New York metropolitan area (including New Jersey) and have a rich history and a massive fan base. Bettors can explore various props related to the Giants, such as player performance bets, team achievements, and game outcomes. Tracking the team’s seasonal progression, keeping an eye on star players, and understanding their dynamics can be crucial for informed betting decisions. The New York Jets, also part of the NFL, provide another avenue for sports betting enthusiasts in New Jersey. Bettors can engage with various props related to the Jets, ranging from individual player performances to team results. Whether you’re interested in backing Gang Green on the moneyline or betting the under on their team total, Fanatics Sportsbook NJ will have a multitude of Jets-related markets on tap. As a prominent NHL team based in Newark and the state’s lone Big 4 professional sports team, the New Jersey Devils are sure to be plastered all over Fanatics Sportsbook NJ. Garden State bettors can anticipate a plethora of boosts surrounding the Devils’ star-studded roster, from Jack Hughes to Nico Hischier, giving them all the reason to add Fanatics Sportsbook NJ into their mobile app rotation. NY/NJ Gotham FC, a professional women’s soccer team competing in the National Women’s Soccer League (NWSL), represents the region in the realm of women’s sports. Bettors will be able to explore various markets related to Gotham FC, including player props and match outcomes. Current NJ legislation says that bettors cannot wager on games that feature New Jersey college teams. Additionally, New Jersey bettors are prohibited from betting on any collegiate-level games that take place in New Jersey. These rules mean that New Jersey bettors cannot wager on competitions featuring prominent local programs, including the following colleges: This section will provide insights into the banking options available for Fanatics Sportsbook NJ users, covering both deposit and withdrawal methods. Understanding the available banking options is essential for a seamless and secure sports betting experience on Fanatics Sportsbook New Jersey. Each deposit method comes with its own set of advantages, such as speed, security, and convenience. Users should choose the method that aligns best with their needs. Deposit options include: When it comes to withdrawing sports betting winnings or funds from the Fanatics Sportsbook NJ account, users have several options: Fanatics Sportsbook NJ aims to provide comprehensive customer support services to ensure that users have a seamless and enjoyable experience on the platform. The sportsbook understands the importance of addressing user queries, concerns, and issues promptly to maintain customer satisfaction. It achieves optimal customer service via the following methods: Here are some frequently asked questions regarding Fanatics Sportsbook NJ: There is no Fanatics Sportsbook NJ promo code yet because the app isn’t live. When the app is live, users may not need a promo code to claim the welcome offer as one isn’t necessary in other states. Stay tuned for the latest details on the welcome offer. Yes, Fanatics Sportsbook NJ is a legitimate and authorized sports betting platform operating under New Jersey’s regulatory framework. Relevant authorities will license and regulate the sportsbook, ensuring a secure and fair environment for users to enjoy. Once the platform is live, users will be able to download the Fanatics Sportsbook NJ app from the App Store or Google Play Store. Yes, Fanatics Sportsbook NJ does have a referral program. Existing users can earn up to $500 in FanCash if they refer a total of five friends to the site. For each referred friend that successfully signs up, deposits $10+, and wagers $10+ on any market, both parties will receive $100 in FanCash. This process can be repeated up to five times per existing user. Get the free Action Network app for expert picks, live odds, bet tracking and more.",
        "pubDate": "2023-12-15 12:45:00",
        "image_url": "https://nypost.com/wp-content/uploads/sites/2/2023/12/GettyImages-1415421913.jpg?quality=90&strip=all",
        "source_id": "nypost",
        "source_priority": 109,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "88b5dd82f1a2dd3417e1a1b5078c425a",
        "title": "Ben DiNucci chose staying on Broncos practice squad over September offer to sign with Saints",
        "link": "https://www.nbcsports.com/nfl/profootballtalk/rumor-mill/news/ben-dinucci-chose-staying-on-bengals-practice-squad-over-september-offer-to-sign-with-saints",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "The Broncos elevated quarterback Ben DiNucci from the practice squad ahead of a game against the Texans earlier this month despite no need for a healthy quarterback and DiNucci wound up being inactive for the game.",
        "content": "The Broncos elevated quarterback Ben DiNucci from the practice squad ahead of a game against the Texans earlier this month despite no need for a healthy quarterback and DiNucci wound up being inactive for the game. DiNucci’s elevation was tied to an offer he received earlier this season. Chris Tomasson of the reports that the Saints wanted to sign DiNucci to their active roster, but he passed on the chance in order to stay on Denver’s practice squad because the Saints were only looking for someone until Jake Haener returned from a suspension. DiNucci confirmed the interest without naming the team this week and explained why he wanted to stay put. “There was a point in the season where another team had ,’’ DiNucci said. “I didn’t necessarily want to go. I didn’t necessarily want to be jumping around during the middle of the season. For quarterbacks, it’s tough. This is my first year [with the Broncos]. I want to be in the system and learn. I had a lot invested in this place.” Signing with the Saints would have guaranteed DiNucci three game checks on the active roster and he said the Broncos “told me they’d make it up to me by the end of the year.” The December 3 elevation brought him one game check and DiNucci expects to be elevated two more times in the final four weeks of the season.",
        "pubDate": "2023-12-15 12:36:42",
        "image_url": "https://nbcsports.brightspotcdn.com/dims4/default/ffd250b/2147483647/strip/false/crop/6117x3441+0+493/resize/1920x1080!/quality/90/?url=https%3A%2F%2Fnbc-sports-production-nbc-sports.s3.us-east-1.amazonaws.com%2Fbrightspot%2Fe5%2Fd2%2Fbdf97e4647a88c54483c00bf5845%2Fhttps-delivery-gettyimages.com%2Fdownloads%2F1627779652",
        "source_id": "profootballtalk",
        "source_priority": 267,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "7957e1f9e9d5a2ddb1a21fbf76ab8399",
        "title": "Lewis Hamilton Finally Wins an Award",
        "link": "https://thesportsrush.com/f1-news-lewis-hamilton-finally-wins-an-award/",
        "keywords": [
          "F1",
          "Lewis Hamilton"
        ],
        "creator": [
          "Aditya Srivastava"
        ],
        "video_url": null,
        "description": "After two demanding years navigating the Formula 1 track, Lewis Hamilton has finally secured a win. However, this victory doesn’t unfold on the racecourse but extends into a different realm. According to recent reports, Hamilton has transitioned into the world of skillfully producing high-quality non-alcoholic spirits and those efforts have now received accolades. In a… The post Lewis Hamilton Finally Wins an Award appeared first on The SportsRush.",
        "content": "After two demanding years navigating the Formula 1 track, has finally secured a win. However, this victory doesn’t unfold on the racecourse but extends into a different realm. , Hamilton has transitioned into the world of skillfully producing high-quality non-alcoholic spirits and those efforts have now received accolades. Advertisement In a recent declaration, Lewis Hamilton has secured the esteemed Benvet Spirit Awards for his outstanding non-alcoholic spirit. This recognition underscores Hamilton’s groundbreaking entry into the non-alcoholic sector, partnering with the inventive Mexican spirits company, Casa Lumbre. Interestingly this brand is spearheading the category with an alternative spirit that retains the traditional ingredients and processes of tequila which is a rarity in the market. However, the centerpiece of this innovative movement is Almave, an exceptional creation crafted in partnership with the F1 champion Lewis Hamilton. Advertisement Notably, Almave distinguishes itself by incorporating cooked and distilled agave, paying homage to the authentic origins of tequila. Nevertheless, what sets it apart is its departure from the usual fermentation process, allowing this tequila counterpart to preserve the genuine essence of agave without the accompanying intoxicating effects. Certainly, upon receiving the award, fans must have recalled Hamilton’s initial description of the non-alcoholic beverage. In an interview with Robb Report, the seven-time champion passionately expressed how this innovative drink would introduce a unique and refreshing taste for individuals. What prompted Lewis Hamilton to venture into the non-alcoholic spirits industry? Lewis Hamilton consistently displays a visionary approach, gaining renown not only in racing but also in diverse businesses, including the NFL and soccer. However, his latest venture takes a unique turn into crafting non-alcoholic beverages. Considering his varied ventures, one may wonder what prompted the British ace to step into the non-alcoholic industry. Advertisement The primary answer lies in the industry’s burgeoning growth. According to Nielsen, non-alcoholic drink sales in the United States surged to $395 million between August 2021 and August 2022, marking a substantial 20% increase over the year. Another substantial reason behind introducing the drink is the increasing preference for sober lifestyles and conscientious drinking, exemplified by Hamilton himself. In recent years, as the 38-year-old has aged and maintained a commitment to excellence, he has placed a greater emphasis on his well-being. To achieve this, he embraced a plant-based diet, inspired by the numerous health and environmental benefits it offers. Nevertheless, despite the shift towards healthier choices, Hamilton maintained a consistent habit as an enthusiastic drinker, a practice he initiated at the age of 16. According to Hamilton, this aspect of his lifestyle appears inconsistent with the rest of his highly focused persona. Considering this, the British athlete mentioned in a interview, However, as he concluded, the seven-time champion clarified that his decision to prioritize well-being was more important to him than consuming alcohol. He said, Advertisement",
        "pubDate": "2023-12-15 12:30:54",
        "image_url": "https://cdn-wp.thesportsrush.com/2023/12/ae45ff10-hamilton-fia-gala.jpg",
        "source_id": "thesportsrush",
        "source_priority": 4166,
        "country": [
          "united kingdom",
          "india",
          "australia",
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702643454996337801"
  }