{
    "status": "success",
    "totalResults": 1479,
    "results": [
      {
        "article_id": "981fe485296b6910351b8c27f9f303e1",
        "title": "‘Honkai Star Rail’ Version 1.6 Release Date Set for December 27th, Brand-New Area and Characters Included",
        "link": "https://toucharcade.com/2023/12/15/honkai-star-rail-version-1-6-release-date-free-character-dr-ratio-ruan-mei-banner/",
        "keywords": [
          "Android",
          "Featured",
          "Free",
          "Games",
          "iPad Games",
          "iPhone games",
          "News",
          "Universal"
        ],
        "creator": [
          "Mikhail Madnani"
        ],
        "video_url": null,
        "description": "HoYoverse just detailed the upcoming Honkai Star Rail version 1.6 update titled “Crown of the Mundane and Divine\" in a … Continue reading \"‘Honkai Star Rail’ Version 1.6 Release Date Set for December 27th, Brand-New Area and Characters Included\"",
        "content": "HoYoverse just detailed the upcoming version 1.6 update titled “Crown of the Mundane and Divine\" in a livestream, while confirming that all players will be able to recruit Dr Ratio for free. This update will bring in a brand-new area, the Herta Space Station’s Seclusion Zone, alongside a Critter Pick Scavenging event, a new event within the Simulated Universe, Ruan Mei (5-star), Dr. Ratio (5-star), Xueyi (4-star), Kafka, and more. If you missed the recent 2.0 update news for the game, read Watch the new version 1.6 “Crown of the Mundane and Divine\" update trailer below: If you’d like to watch the full livestream, check it out below: won Apple’s App Store Award for iPhone Game of the Year and it won best mobile game at The Game Awards 2023. If you’ve not gotten yet, you can download it on the App Store for iOS , on Google Play for Android , and on the Epic Games Store in addition to its regular PC version. Check it out on PS5. Have you been playing regularly since it launched on mobile, PC, and more recently on PS5?",
        "pubDate": "2023-12-15 12:58:07",
        "image_url": "https://toucharcade.com/wp-content/images/app/1599719154/100x100bb.jpg",
        "source_id": "toucharcade",
        "source_priority": 38464,
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "article_id": "c5dc7e0cb92b84c5793c7620756b9ae6",
        "title": "EU Media Freedom Act and the push to use spyware on journalists",
        "link": "https://www.techradar.com/computing/cyber-security/eu-media-freedom-act-and-the-push-to-use-spyware-on-journalists",
        "keywords": [
          "Cyber Security",
          "Computing",
          "Computing Security"
        ],
        "creator": [
          "chiara.castro@futurenet.com (Chiara Castro)"
        ],
        "video_url": null,
        "description": "The final trilogue meeting is scheduled for December 15. Here we explore who's pushing for more surveillance on journalists and what's at stake.",
        "content": "France, Italy and Greece are some of the seven countries pushing for enabling authorities to spy on journalists in case of national security, a new investigation has revealed. First published in September last year, the EU Media Freedom Act aims to bolster the independence and pluralism of the media sector in Europe. Yet, some commentators fear that without the right wording and provisions the new law will de-facto achieve the opposite results. Today, December 15, the EU Commission is holding what expected to be the final round of talks (trilogue) which it may seen the hardliner governments find a compromise with other members. As mentioned, the EU Media Freedom Act comes as an attempt to set some rules to ensure and protect media freedom and pluralism across the Union. It comes following concerns about a highly politicized media landscape. For this, it includes safeguards against political interference in editorial decisions and the use of spyware against journalists , a framework for transparency, increased protection of journalistic sources, and more. Despite its intentions being good and well-needed, the ongoing negotiations seems to have been shaping the law with some controversial clauses which are worrying commentators. \"The EU Media Freedom Act (EMFA), though well-intended, has significant flaws,\" wrote digital rights advocates at Electronic Frontier Foundation on December 6, commenting on a proposed special status for big media outlets whose content cannot be removed from big tech platforms. Another even more contentious point is then around the use of surveillance tools against journalists. Born as a way to make the practice illegal following high profile cases across Europe, some countries keep pushing for a \"national security\" clause (Article 4). According to Reporters without Borders , this is \"dangerous provision, which would poison the law from within.\" While the infamous Article 4 and the \"national security\" exemption is nothing new—it was added to the text in June, in fact—new revelations shed some light on those countries lobbying together to legitimize this type of state surveillance. A joint-investigation among three EU media outlets (Investigate Europe, French non-profit Disclose and Holland-based Follow the Money) revealed that France , Greece , Italy , Cyprus , Finland , Sweden and Malta are the seven governments still pushing to allow spyware use against journalists despite the wave of criticism across the industry. According to a document obtained by the media consortium which was written by a high-ranking German official present at the last trilogue on November 22, Italy expressed the strongest stances deeming the additional paragraph a \"must and red line.\" France, Finland and Cyprus said to be \"not very flexible\" on the issue. While, Sweden, Malta and Greece agreed \"with some nuances.\" \"Governments have no business being on journalists’ phones. We in the European Parliament have made provisions for this. It is unacceptable that member states are now trying to reintroduce this snooping paragraph through the back door,\" said one of the negotiators, German Green MEP Daniel Freund, to Investigate Europe. 🇪🇺#EU: IPI is concerned by revelations that #France, #Italy #Greece & other governments are pushing for loopholes for 'national security' regarding the surveillance of journalists amidst the final stages of EU negotiations on the #EuropeanMediaFreedomAct.https://t.co/55LpBzPJBR December 12, 2023 The biggest fear here is that such a provision will de-facto legitimize the unlawful use of Pegasus and Predator spyware against journalists, which has already occurred in Greece, Spain, Bulgaria and Hungary. These governments have all previously played the national security card to justify their actions. Before the latest revelations, 17 European media organizations signed an open letter calling for \"adopting robust wording in the final version.\" They wrote: \"We are deeply concerned about the chilling effect that could ensue if the final text sets conditions for disclosure of sources that fall short of international human rights standards and maintains the paragraph ‘This article is without prejudice to the Member States’ responsibility for safeguarding national security’. \"The EU has always been a stronghold of media freedom and pluralism, but today these central values are in decline. Where the rule of law is undermined, media freedom is often the first casualty.\" At the time of writing, representatives of EU member states are discussing these two very distinct lines on this thorny issue. We don't know which of the two will prevail eventually, but most likely the hardliners will need to find a compromise with the other states. Whether that will be enough to truly protect media freedom and journalists' privacy in Europe is yet to be seen.",
        "pubDate": "2023-12-15 12:50:11",
        "image_url": null,
        "source_id": "techradar",
        "source_priority": 607,
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "article_id": "2d7b88f7ca7d8caee6203772cce93139",
        "title": "Total War studio apologizes for Shadows of Change DLC - commits to ‘ensuring that we better meet your expectations going forward’",
        "link": "https://www.techradar.com/gaming/pc-gaming/total-war-studio-apologizes-for-shadows-of-change-dlc-commits-to-ensuring-that-we-better-meet-your-expectations-going-forward",
        "keywords": [
          "PC Gaming",
          "Gaming",
          "Consoles &amp; PC"
        ],
        "creator": null,
        "video_url": null,
        "description": "The vice president Creative Assembly, Roger Collum, has apologized to Total War fans for the series' \"missteps.\"",
        "content": "The vice president of Total War studio Creative Assembly, Roger Collum, has released a lengthy statement apologizing to the strategy series’ fans for its “mistakes when it comes to our relationship with you all.” He outlined the studio’s plans to improve the poorly received Warhammer 3 DLC, Shadows of Change , delay the upcoming Thrones of Decay DLC, and alter the pricing of Total War: Pharaoh . In the statement , which was published yesterday (December 14), Collum said that “it has been a difficult few months,” and the studio has been engaged in “constant conversation internally on how we can get back to solid ground.” He noted: “We see the confusion, the frustration, and the distrust of us across the community and honestly, it breaks our hearts. We make games to bring you joy, to inspire a love of history, of fantasy, and strategy games. Total War is our everything, we care about it as deeply as you. Recently, it’s clear that we have failed to demonstrate that in our actions.” As Eurogamer reports , Total War: Warhammer 3’s Shadow’s of Change DLC was released in August, and currently sits on Steam with a ‘Mostly Negative’ user rating. Collum has now acknowledged that “we failed to meet your expectations of what a DLC should be,” and stated that Creative Assembly is working on a major free update which it hopes to release in February 2024 (although he noted that this window could change). The studio has committed to \"ensuring that we better meet your expectations going forward.\" Furthermore, as a result of this update, but also “to make sure that we don’t repeat our past mistakes, and to give you the amount of content that you rightly expect from us at these price points,” the Total War: Warhammer 3 Thrones of Decay DLC is being delayed to 2024, with the aim of launching it in April. It was originally supposed to launch before the end of 2023. Otherwise, Total War: Pharaoh , which was released in September, has been given a permanent price cut, taking it from $59.99 (£49.99) to $39.99 ($29.99). A FAQ section explaining the matter simply states that the team thought that this price was “fairer” - existing owners will receive partial refunds to make up the difference. Furthermore, the pricey Deluxe and Dynasty editions have been removed from sale, and Pharaoh ’s first paid DLC will now be a free update, set to release in early 2024. “We again apologize for the missteps we’ve made,” Collum concluded. “The mistakes of Total War are a shared responsibility by all the leaders of the franchise, and while it may not seem like it at times, we are listening.” Looking for some new game recommendations? You can find some fantastic options on our list of the best PC strategy games , as well a wider variety of genres with our picks for the best PC games .",
        "pubDate": "2023-12-15 12:49:17",
        "image_url": null,
        "source_id": "techradar",
        "source_priority": 607,
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "article_id": "474e24d0e02ffd0abaa9e75eee80b3c4",
        "title": "Beeper Mini goes down again for some —and the company is lashing out at Apple",
        "link": "https://www.tomsguide.com/news/beeper-mini-goes-down-again-for-some-and-the-company-is-lashing-out-at-apple",
        "keywords": [
          "Software",
          "Apple",
          "iPhone",
          "Smartphones"
        ],
        "creator": [
          "tom.pritchard@futurenet.com (Tom Pritchard)"
        ],
        "video_url": null,
        "description": "Beeper Mini is having more problems, and Apple's getting blamed. But it's not like this is a huge surprise.",
        "content": "The saga of Beeper Mini continues as the iMessage workaround for Android devices has seemingly gone offline for the second time in the space of a week. Apparently this new wave of connectivity issues has affected around 5% of users, and Beeper Mini itself has been quick to pin the blame on Apple. The app claims that Apple is “deliberately blocking iMessage from being delivered.\" The Beeper X account has also been complaining about Apple’s efforts to block the services, stating that “it’s super annoying that Apple is penalizing their own customers and Android users who just want secure and encrypted chats.“ Adding, “we understand if you choose to uninstall Beeper Mini at this time.\" We realize how incredibly inconvenient this is for you. It's super annoying that Apple is penalizing their own customers and Android users who just want secure and encrypted chats. We understand if you choose to uninstall Beeper Mini at this time. Hope to have you back soon. December 14, 2023 But let’s be honest here; this doesn’t come as a huge surprise. Apple has already blocked the first loophole Beeper Mini utilized to access iMessage, and it was only a matter of time before the current workaround got targeted as well. It’s just surprising that this issue is only affecting a handful of users, rather than Beeper Mini as a whole. Not to mention the fact that this service is primarily aimed at Android users, and Apple has a long history of trying to pretend they don’t exist. So the comments about penalizing Apple’s own customers don’t make a lot of sense. It’s true that Apple has effectively crippled inter-platform communication up to this point by defaulting back to SMS and MMS when communicating with non-Apple devices. Both those systems are ancient from a tech standpoint, and have problems and restrictions that make the user experience less than ideal. Like character limits, file size limits and the lack of any kind of encryption. But this criticism has been leveled at Apple for years, and might finally be solved with the adoption of RCS in 2024 . The current system is still in use, and rather a bad look for Apple, but at least we know it’s on the way out. Apple has also claimed that apps trying to reverse engineer their way into iMessage pose a threat to user security and privacy. Beeper Mini denies this, claiming that it actually increases security , but after the allegations leveled against Songbird and Nothing Chats , it’s clear we shouldn’t take these sorts of claims at face value. Beeper Mini claims that it will continue working to get its Android app working with iMessage again, with particular emphasis on restoring phone number support — something Apple managed to block late last week. In the meantime, if you’re that concerned about the state of inter-platform communications, you can always try and convince your iPhone-toting friend to sign up for one of the best encrypted messaging apps . You know, the ones that have been around for quite some time and are typically free of controversy.",
        "pubDate": "2023-12-15 12:46:28",
        "image_url": "https://cdn.mos.cms.futurecdn.net/eRTfK2xpPyBaEP4g5H9fiU.jpg",
        "source_id": "tomsguide",
        "source_priority": 203,
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "article_id": "e3226c508683e2632850f778a6321562",
        "title": "Pixel Recorder adds cloud-powered ‘Transcribe again’",
        "link": "https://9to5google.com/2023/12/15/pixel-recorder-transcribe-again/",
        "keywords": [
          "News"
        ],
        "creator": [
          "Abner Li"
        ],
        "video_url": null,
        "description": "Besides the Gemini Nano-powered Summarize on the 8 Pro, the latest Recorder update adds “Transcribe again” to other Pixel devices. more… The post Pixel Recorder adds cloud-powered ‘Transcribe again’ appeared first on 9to5Google.",
        "content": "Besides the Gemini Nano-powered Summarize on the 8 Pro, the latest Recorder update adds “Transcribe again” to other Pixel devices. Transcribe again lets you get a transcript in languages that aren’t currently supported by Pixel Recorder’s Live Transcription capability. After launching from the overflow menu of a previous session, select one of the available languages : It works by uploading that audio recording to Google’s servers. The company tells us that standard Google text-to-speech is being used here. This process takes a good minute or two and you’ll see a “Processing” card noting the status of the transcription. In our testing, you can’t use Transcribe again on something that already has a transcript in hopes of improving the quality. Version 4.2.20231031 of Recorder has widely rolled out. The previous Recorder update in October added the ability to favorite/star recordings, Audio channel (mono or stereo) selection, and a “Detect language’ capability for Speaker Labels. More on Pixel Recorder:",
        "pubDate": "2023-12-15 12:45:00",
        "image_url": "https://9to5google.com/wp-content/uploads/sites/4/2023/03/google-recorder-logo-3.jpg?quality=82&strip=all&w=1600",
        "source_id": "9to5google",
        "source_priority": 8354,
        "country": [
          "united states of america",
          "canada",
          "india",
          "australia",
          "united kingdom",
          "singapore"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "article_id": "663abe09fa2288f42e8083d9020762e2",
        "title": "The best printers for Chromebook, selected by experts",
        "link": "https://www.digitaltrends.com/computing/best-chromebook-printers/",
        "keywords": [
          "Computing",
          "Products",
          "bluetooth printer",
          "Chromebooks",
          "Laptop",
          "printer",
          "printers"
        ],
        "creator": [
          "Jennifer Allen"
        ],
        "video_url": null,
        "description": "Partly thanks to remote work and education, most printers on sale became compatible with the now-ubiquitous Chromebook.",
        "content": "Once you’ve picked out one of the , you need some accessories to go with it. While a Chromebook comes with all the essentials, you’re likely to need a printer for it at some point. While many reports and documents are fine to be emailed, every once in a while, you’ll need to print something out. Printing may not be an everyday occurrence any more for many of us but who wants to have to go to a store to get it arranged at the last minute? Being able to print from home is so much more convenient. Finding a Chromebook-compatible printer isn’t as tricky as it sounds with the only distinction being that ChromeOS can’t print over Bluetooth. Everything else is free game though with Wi-Fi, USB, or wired LAN working just fine, and most printers working with a Chromebook right out of the box. With many printers for Chromebooks around, we’ve tracked down all the best printers for Chromebooks, based on expert opinion. We’ve considered that some of you may need a budget option while others want something much more high-end. As with any tech purchase, it’s important to consider your budget and needs when picking out a printer for Chromebook. There’s no one size fits all solution although there are definitely a handful that should appeal to the majority of people. Have a think about what you plan to use the printer for. Are you looking to solely print black and white documents or do you want to print photos too? Do you need it to be fast or is that not a priority? Do you need scanning functionality? Think about all these things before you dive into considering which printer to buy. Not everyone needs the as these are only appealing if you plan on also scanning documents as well as printing them. For some people, one of the will be just fine as they’re relatively inexpensive, low-maintenance and work just fine for printing out documents. Generally, you can pick one of the and you’ll be happy but there’s no point buying one packed with features that you don’t need. Printers range from being incredibly cheap at sub-$50 prices to costing hundreds of dollars. Not everyone needs to spend the price of a Chromebook on a printer but you might. If you’re planning on printing hundreds of pages every month, you don’t want to scrimp on a printer that will slow you down. That’s where it’s important to think about the features you want along with how much you can afford to spend. We’ve picked out printers that will work with ChromeOS and Chromebooks with the vast majority of printers doing so these days. However, you may have a specific connection in mind. If you want to hook it up directly to your network, check the printer has a wired LAN port. Alternatively, check for a Wi-Fi connection if you’re fine to go wireless or look for USB if that’s your need. When picking out the best Chromebook printers, we considered a handful of key factors. We looked at price while still appreciating that some people are willing to pay a lot for something high-end. We also considered reliability given no one wants a temperamental printer at a key time. We also looked at useful features such as how fast it can print, what it’s capable of printing of, and if it has any additional features that make it stand out from the crowd. We’ve used a lot of printers over the years spanning many different brands and features, such as regular inkjet printers right up to all-in-one solutions so we know what to look for in a printer that people genuinely want to use on a daily basis. If you work from home or even if you’re part of a small office setup, the Brother MFC-L3720CDW is highly capable of keeping up with your busy working life. It can print at up to 19 pages per minute as well as scan incredibly quickly too. To speed things up further, it has a 50-page auto document feeder so you can easily set up multi-page copy, scan, and fax jobs. A 250-sheet capacity paper tray makes it perfect for setting aside rather than needing by your side too. While it could be complicated, the Brother MFC-L3720CDW is actually very simple to use. That’s thanks to its 3.5-inch color touchscreen which has access to 48 custom shortcuts to simplify the process. You can easily connect the printer to popular cloud-based apps like Google Drive, Dropbox, Evernote, and OneNote, so it lends itself well to your cloud living life with a Chromebook. Plenty of connections are available with built-in dual band wireless along with Wi-Fi Direct, or you can always hook up the Brother MFC-L3720CDW directly via a USB 2.0 port. Brother is one of the best printer brands around and very highly respected for its reliability, especially when it comes to laser printing. It’s versatile stuff although potentially overkill if you just want to occasionally print a document. The beauty of laser printers is that they’re so much more reliable than an inkjet printer. They tend to cost more too as the HP Color LaserJet Pro 4201dw demonstrates but they’re a fantastic investment if you want something that won’t let you down for a long time. This model is designed with a small team in mind but what’s your household at heart, right? It’s incredibly fast being capable of printing up to 35 color pages per minute. Image quality is exceptional too as you’d expect with sharp detail and gorgeous colors too. If you’re printing hundreds of pages per month, this sped makes a huge difference. There’s also auto two-sided printing so all you need to do is fill the 50-sheet multipurpose tray and 250-sheet paper tray and you’re good to go. Via the wireless printing functionality, you can easily print from your Chromebook along with pretty much all other devices you can think of. The Epson Workforce WF-7840 has the right name being highly capable for work purposes. It’s an all-in-one solution so it can print pretty fast with up to 25 black pages or up to 12 color pages per minute. Results look great too thanks to accurate dot placement and instant-dry pigment inks that ensure professional-quality prints. It’s simple to use too with a 4.3-inch color touchscreen making it easy to find what you want to do. The Epson Smart Panel app works from your phone too if you want further control but simple wireless setup means you’re good to go whatever your plans. The Epson Workforce WF-7840 is also a scanner so you can easily copy documents while a large 500-sheet paper capacity spread across two 250-sheet trays and a 50-sheet rear tray all prove super convenient. If you only plan on printing the occasional document, the HP ENVY 6065e will suffice. It’s very simple to set up with a smart control panel ideal for direct printing or options via the HP Smart app. It also has useful features like self-healing Wi-Fi so it’s capable of automatically detecting and resolving connectivity issues to cut down on interruptions. While the HP ENVY 6065e isn’t exactly fast, it does have extras like automatic two-sided printing which makes things far more convenient for you. As standard, it prints at just seven pages per minute in color or 10 pages per minute in black and white, but that’s just fine for occasional usage where time isn’t essential. The HP ENVY 6065e is also a scanner capable of scanning up to 1200 x 1200 dpi as well as copying up to 300 x 300 dpi, so it’s good for a little bit of everything. A 100-sheet input tray and 25-sheet output tray means no need to keep too close to it while you work. The Canon PIXMA MG3620 isn’t the most exciting of printers to use but it’s a good option for those with limited space at home and not wishing to spend too much. It can print two-sided documents which is a useful time saver, although it can only print just 10 pages per minute in black and white or 5.7 pages per minute in color. Besides printing, the Canon PIXMA MG3620 is also a scanner so there’s no need to find room for an additional device in your limited home office storage space. The Canon PIXMA MG3620 works well wirelessly both thanks to Wi-Fi support and extensive app support, so it’s useful for more than just your Chromebook. If you want something straightforward if uneventful, the Canon PIXMA MG3620 will do the job well. Understandably, high print quality isn’t cheap. The Epson EcoTank ET-15000 is a big investment but it’s equally capable of some pretty large prints with the chance to print up to 13 x 19 inches. Print quality is truly stunning thanks to the use of a high density print chip which generates up to 40 million dots per second with some truly gorgeous accuracy. Versatile paper handling means you can print those extra large prints with the rear feed while there’s copy and scan support for up to 8.5 x 11 inches via the scan bed or 8.5 x 14 inches via the automatic document feeder. A 2.7-inch color touchscreen means you always know what’s going on while — of course — there’s wireless support. For a lot of people, the Epson EcoTank ET-15000 is going to be too much. Some people will have a Chromebook cheaper than this printer but if you plan on printing a lot of images and you want them at your best, you’ll love the Epson EcoTank ET-15000. Perfectly suited for extensive document printing, the Epson WorkForce Pro WF-3820 is a little slow with color prints but offers a speedy 25 pages per minute in black and white. Thanks to Epson’s PrecisionCore Heat-Free technology, you get a particularly fast first-page out along with reliable printing and reduced downtime too. There’s also high-precision printing with accurate dot placement and instant-dry pigment inks for professional-quality levels with your documents. To make things even simpler for you, there’s also auto two-sided printing along with one-sided 35-page automatic document feeder to help you go even faster with less effort. Everything about the Epson WorkForce Pro WF-3820 is simple to use so it’s an ideal addition to your home. Well regarded across the board, it’s not going to let you down. In a dorm room with your trusty Chromebook? Add on the HP DeskJet 2734e and you’ll be all set for printing out whatever needs printing. It’s certainly slow at just 7.5 pages per minute in mono or 5.5 pages in color, but it’s just fine for the occasional print out. That’s reflected by its fairly small yet functional 60-sheet input tray and 25-sheet output tray. The HP DeskJet 2734e is also a scanner and copier. Again, it’s not exactly speedy or packed with features but it’s just right for occasional tasks. There’s wireless and mobile printing support, while the HP DeskJet 2734e’s dual-band Wi-Fi has a self-reset feature if there’s a problem. Look out for the fact that the HP DeskJet 2734e won’t work with non-HP cartridges but other than that, it’s a good basic model for the most minimal of requirements.",
        "pubDate": "2023-12-15 12:42:39",
        "image_url": "https://www.digitaltrends.com/wp-content/uploads/2022/03/best-inkjet-printers.jpg?resize=440%2C292&p=1",
        "source_id": "digitaltrends",
        "source_priority": 287,
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "article_id": "e3c98a40f690ae11a0d3b72e314a07fe",
        "title": "Victrix has announced an Xbox version of one of its best controllers",
        "link": "https://www.techradar.com/gaming/victrix-has-announced-an-xbox-version-of-one-of-its-best-controllers",
        "keywords": [
          "Gaming"
        ],
        "creator": [
          "dash.wood@futurenet.com (Dashiell Wood)"
        ],
        "video_url": null,
        "description": "Hardware brand Victrix has announced The Xbox Pro BFG Wireless Controller, bringing one of their best designs to Xbox.",
        "content": "The PDP-owned gaming hardware brand Victrix has revealed a brand new premium Xbox controller in a press release sent out yesterday (December 14, 2023). An Xbox version of their highly customizable Pro BFG Wireless Controller, which has previously only been available for PlayStation, the release of this new version of the hardware is fantastic news for those who want a more versatile way to play some of the best Xbox Series X games . Priced at $179.99, this controller sports a unique, customizable design that allows you to easily swap the position of various modules that house everything from the thumbsticks to the d-pad. This means that you can enjoy the regular Xbox asymmetrical controller layout, or switch things up for a symmetrical design like the DualSense Wireless Controller . There’s even an additional fighting game button module, which gives you a selection of six face buttons that are in the ideal layout for top titles like Mortal Kombat 1 or Street Fighter 6 . The controller also sports some of the more traditional features that you would expect to find on a premium pad. These include a selection of rear buttons, interchangeable thumbsticks, adjustable triggers, and a couple of different d-pad designs to choose from. The package also comes with a carrying case and braided USB-C cable, giving you everything that you need to play over a wired connection or take the controller out and about. In addition to compatibility with the Xbox Series X |S out of the box, the controller also works with Xbox One and PC in addition to iOS and Android mobile phones. The Xbox Pro BFG Wireless Controller is set to release in January 2024 and will be available in two colors: a striking black and purple or a cleaner white design. You can currently place a preorder or learn more about the controller over on the Victrix website . If you’re shopping for an Xbox controller right now, however, be sure to consider some of the best deals in your region which we have listed below: For some Xbox hardware recommendations, see our guides to the best Xbox controllers or the best monitors for Xbox Series X .",
        "pubDate": "2023-12-15 12:41:13",
        "image_url": null,
        "source_id": "techradar",
        "source_priority": 607,
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "article_id": "28e735d69dbaa8579d22fdc04cab5379",
        "title": "Google Business Profile Agency Dashboard Bug With Invites",
        "link": "https://www.seroundtable.com/google-business-profile-agency-dashboard-invites-bug-36561.html",
        "keywords": null,
        "creator": [
          "barry@rustybrick.com (Barry Schwartz)"
        ],
        "video_url": null,
        "description": "There is a bug with the Google Business Profile agency dashboard where owners and managers cannot accept new invites. The issue started a few days ago, Google is aware of the bug and working on fixing the issue.",
        "content": "There is a bug with the Google Business Profile agency dashboard where owners and managers cannot accept new invites. The issue started a few days ago, Google is aware of the bug and working on fixing the issue. There are several threads about the issue in the Google Business Profiles Forum with the complaints starting on December 12th. Ben Fisher posted on X saying, \"Agency Dashboards not able to accept invitations.\" He added that this is a new known issue\" and that he is working working with Google to resolve it now. Here is one screenshot of the issue: Ben said you should go to the forums and show screenshots of a profile that invited you (the users area), and post your ORG ID as well, so that Google can debug the issue. There is no ETA for when this issue will be fixed. Forum discussion at Google Business Profiles Forum , Local Search Forum and X .",
        "pubDate": "2023-12-15 12:41:00",
        "image_url": null,
        "source_id": "seroundtable",
        "source_priority": 78146,
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "article_id": "bb3cd5c0f945f1c2d53c3687a55ebd89",
        "title": "Meteor Lake integrated graphics performance is 50 to 100% faster than Raptor Lake's, according to Intel",
        "link": "https://www.techspot.com/news/101215-meteor-lake-integrated-graphics-performance-50-100-faster.html",
        "keywords": null,
        "creator": [
          "Daniel Sims"
        ],
        "video_url": null,
        "description": "Intel claims that the integrated graphics chips in its newly launched Meteor Lake mobile processors provide up to double the performance of Raptor Lake notebook CPUs. The company also provided new details on how its machine learning-based XeSS upscaling can boost iGPU performance further.Read Entire Article",
        "content": "The big picture: Intel's launch presentation for its new Meteor Lake generation of processors primarily focused on how their Neural Processing Units (NPUs) enhance local AI workloads. However, the company also made ambitious claims about integrated graphics performance improvements. Time will tell whether they hold up to real-world benchmarks. Intel claims that the integrated graphics chips in its newly launched Meteor Lake mobile processors provide up to double the performance of Raptor Lake notebook CPUs. The company also provided new details on how its machine learning-based XeSS upscaling can boost iGPU performance further. The benchmarks from the Meteor Lake launch presentation don't provide exact framerates, and any internal benchmark results should be taken with a bit of salt. With that in mind, the charts show the new Core Ultra 7 165H drastically outperforming the Core i7-1370P. Games like Baldur's Gate 3, Resident Evil Village, and Mount & Blade II: Bannerlord run about twice as well at native 1080p on medium graphics settings. Meanwhile, titles like Counter-Strike 2, Far Cry 6, and League of Legends see a roughly 50 percent performance uplift. Click to enlarge However, that generational improvement doesn't account for XeSS, Intel's answer to DLSS and FSR. The company said the upscaling solution can improve framerates by an average of 39 percent. However, many games like F1 2023, Call of Duty: Modern Warfare II, Marvel's Spider-Man Remastered, and The Witcher 3 see more considerable gains. The only video comparison currently available is a demonstration Intel released in October showing Dying Light 2 running on a Meteor Lake iGPU with and without XeSS. That benchmark also didn't provide precise framerates, but the game looked noticeably smoother with upscaling engaged. Click to enlarge Intel told Tom's Hardware that the Meteor Lake iGPUs run XeSS in DP4a mode – a fallback for graphics chips that don't possess the XMX cores found in the Intel Arc dedicated GPUs. The company says the alternative solution looks significantly better today than when XeSS launched in 2022. Meteor Lake's integrated graphics hardware also represents an improvement in Intel's driver management. Drivers have been one of the main weaknesses holding back the Arc GPUs, but updates have improved performance dramatically. The company told PC Gamer that its dedicated and integrated driver releases should now coincide , although laptop OEMs might still drag their feet. In such cases, users can optionally download generic iGPU drivers. The company also asserts that its new integrated chips compare favorably to AMD's Ryzen 7 7840U. Averaged out across 18 titles, including Apex Legends, DOTA 2, Final Fantasy XIV, Fortnite, and Overwatch 2, the Core Ultra 7 165H in an MSI Prestige 16 supposedly edges out a Lenovo Thinkpad T16 equipped with the Zen 4 processor.",
        "pubDate": "2023-12-15 12:41:00",
        "image_url": "https://www.techspot.com/images2/news/ts3_thumbs/2023/06/2023-06-14-ts3_thumbs-152.jpg",
        "source_id": "techspot",
        "source_priority": 8847,
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      },
      {
        "article_id": "3cb3e754d805205823c355795e8e83c0",
        "title": "iOS 17.2 update puts an end to Flipper Zero's iPhone shenanigans",
        "link": "https://www.zdnet.com/article/ios-17-2-update-puts-an-end-to-flipper-zero-iphone-shenanigans/#ftag=RSSbaffb68",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "ZDNET pitted the latest Xtreme firmware on the Flipper Zero against iPhones running iOS 17.2 and it looks like the popup party is over.",
        "content": "iOS 17.2 prevents the Flipper Zero from flooding the iPhone with popups. Apple has finally closed off the ability of the pen-testing tool to flood iPhones with so many popups that the . The attack required a Flipper Zero running the . Then, using the built-in BLE Spam app, the Flipper Zero could cause a flurry of popups to appear on an iPhone, eventually resulting in iOS locking up. Put another way, it could perform a denial of service (DoS) attack on any and all iPhones within a 30-foot radius of the attacker. The Flipper Zero app could also be used to , although with less extreme results. Well, this trick has come to an end with iOS 17.2. ZDNET has pitted the latest Xtreme firmware on the Flipper Zero against iPhones running iOS 17.2, and it seems that Apple has put a mechanism in place to prevent popups flooding the devices. Yes, a few popups to appear, but not the deluge that was previously spawned by the Flipper Zero. While a few popups do still appear, which is annoying and could cause some users confusion, the neverending stream that would deluge the iPhone has been cut off. To update your iPhone or iPad, tap and then and and follow the prompts to get your device up to date.",
        "pubDate": "2023-12-15 12:33:14",
        "image_url": null,
        "source_id": "zdnet",
        "source_priority": 1068,
        "country": [
          "united states of america"
        ],
        "category": [
          "technology"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702643594658385431"
  }