{
    "status": "success",
    "totalResults": 20611,
    "results": [
      {
        "article_id": "15c58741aac1f0087d40def4b3a85791",
        "title": "Black child, 10, sentenced to probation for urinating in public",
        "link": "https://www.tmj4.com/black-child-10-sentenced-to-probation-for-urinating-in-public",
        "keywords": null,
        "creator": [
          "AP via Scripps News"
        ],
        "video_url": null,
        "description": "The child's attorney said he doesn't believe a White child would have been arrested under similar circumstances.",
        "content": "A 10-year-old Black child who urinated in a parking lot must serve three months’ probation and write a two-page book report on the late NBA star Kobe Bryant, a Mississippi judge has ordered. Tate County Youth Court Judge Rusty Harlow handed down the sentence Tuesday after the child's lawyer reached an agreement with a special prosecutor. The prosecution threatened to upgrade the charge of “child in need of supervision” to a more serious charge of disorderly conduct if the boy's family took the case to trial, said Carlos Moore, the child’s attorney. “I thought any sensible judge would dismiss the charge completely. It’s just asinine,\" Moore said. \"There were failures in the criminal justice system all the way around.” Moore said he doesn’t believe a White child would have been arrested under similar circumstances, and he couldn't find a similar instance of a child receiving a similar sentence for the same offense. “I don’t think there is a male in America who has not discreetly urinated in public,” Moore said. The child’s mother has said her son urinated behind her vehicle while she was visiting a lawyer’s office in Senatobia, Mississippi, on Aug. 10. Police officers in the town of about 8,100 residents, 40 miles south of Memphis, Tennessee, saw the child urinating and arrested him. Officers put him in a squad car and took him to the police station. Senatobia Police Chief Richard Chandler said the child was not handcuffed, but his mother said he was put in a jail cell, according to . Days after the episode, Chandler said the officers violated their training on how to deal with children. He said one of the officers who took part in the arrest was “no longer employed,” and other officers would be disciplined. He didn’t specify whether the former officer was fired or quit, or what type of discipline the others would face. Chandler did not immediately respond to a voicemail message Thursday. Reached by phone, a staffer for Paige Williams, the Tate County Youth Court prosecutor appointed to handle the case, said the attorney could not comment on cases involving juveniles. Rashad Robinson, president of the civil rights organization Color Of Change, said the decision to charge the child didn’t make sense. “Nothing about this case from the decisions by the police, the prosecutor, and the judge makes us safer or is a good use of taxpayer resources,\" Robinson said in a statement. He said there is a “long and unforgivable history in Mississippi and across the country” of a “two-tiered justice system” that offers one path for Black children and another for White. It was initially unclear whether prosecutors would take up the case. Moore requested a dismissal, but prosecutors declined. He planned on going to trial but shifted strategy after prosecutors threatened to upgrade the charges. The child's family chose to accept the probation sentence because it would not appear on the boy's criminal record. The 10-year-old is required to check in with a probation officer once per month. Williams initially wanted the child to write a report on public decency, but the judge changed the subject to Bryant because the boy is a basketball fan, Moore said. Marie Ndiaye, deputy director of the Justice Project at the Advancement Project, a racial justice organization, said the arrest is emblematic of broader issues in the criminal justice system. “Sentencing anyone, let alone a young child, to probation under these facts is sure to add to the trauma and denigration this child has suffered since their arrest,” Ndiaye said. “This is all the more proof that we need to severely limit police interactions with civilians, from petty retail theft to traffic stops and even so-called ‘quality of life’ offenses. For Black people in America, it is a matter of life and death.”",
        "pubDate": "2023-12-15 13:02:03",
        "image_url": null,
        "source_id": "tmj4",
        "source_priority": 7805,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "0ef4d9e687e04d3549473f20654cf3ce",
        "title": "New Selfie Worthy Sculpture Now On Display In Western New York",
        "link": "https://nj1015.com/ixp/11/p/buf-sculpture-canalside/",
        "keywords": [
          "News in New York",
          "buffalo",
          "things to do",
          "public art",
          "Buffalo Buzz"
        ],
        "creator": [
          "Ed Nice"
        ],
        "video_url": null,
        "description": "From Shark Girl to The USS Little Rock, there are tons of great things on the Buffalo Waterfront to check out and now we have another thing to put on the list. Continue reading…",
        "content": "Buffalo and Western New York are known for several things, from football and hockey to its amazing architecture; the Queen City is a great place to live, work, and play. One of the things that we do especially well in the 716 is art and history. Folks may not realize it, but Buffalo has some world-class art right here in Western New York. From art museums like Buffalo AKG Art Museum and Burchfield Penney Art Center to the Buffalo History Museum to all of the public art displays that sprinkle the city, there are tons of great things for you to see and take selfies in front of. One great spot in the area to do just that is down at Canalside in downtown Buffalo. Just steps from the Buffalo River and Lake Erie, you can find all sorts of exciting things to check out. Some of these include sculptures like Shark Girl, the Silent Poets, and statues honoring famous Buffalo sports players like Tim Horton and The French Connection. Thanks to a partnership between the Erie Canal Harbor Development Corporation (ECHDC), Empire State Development, and Visit Buffalo Niagara (VBN), a for us all to enjoy. In a big ceremony last week, officials ECHDC, VBN, and ESD unveiled a new permanent sculpture on Marine Drive, near the intersection with Hanover Street. That new sculpture is called BUF and features three steel 3-D letters—the sculpture stands 5 feet tall, with each letter weighing more than 1,000 pounds. This new sculpture was designed and fabricated by and painted by Buffalo's Nicole Cherry. Buffalonians are proud of their city, so we expect the BUF sculpture at Canalside to quickly become a popular selfie site... We have seen how prominent pieces of public art enhance the millions of dollars Governor Hochul has invested in the waterfront. I encourage families to take their holiday pictures by the new sculpture then head to the ice to say hello to Shark Girl and enjoy some time skating, riding the ice bikes, sipping hot chocolate, and taking in the holiday lights. -Joan Kesner, Erie Canal Harbor Development Corporation Board Chairperson. Several spots in Buffalo are great for selfies; you can see a few more below. Gallery Credit: Charlotte Anne Guernsey via Compass Greater NY LLC",
        "pubDate": "2023-12-15 13:00:11",
        "image_url": "https://townsquare.media/site/11/files/2023/12/attachment-BUF-sculpture-nys-esd.jpg",
        "source_id": "nj1015",
        "source_priority": 9819,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "a6865c1811344640dbcea1575177a099",
        "title": "Eric Bischoff On Whether WWE Trusts CM Punk, WWE’s Boom In Popularity",
        "link": "https://411mania.com/wrestling/eric-bischoff-wwe-trust-cm-punk-popularity/",
        "keywords": [
          "CM Punk",
          "Eric Bischoff",
          "WWE"
        ],
        "creator": [
          "Andrew Ravens"
        ],
        "video_url": null,
        "description": "On the latest episode of 83 Weeks, Eric Bischoff talked about the success that WWE has found over the last year, trust the company has[.........] The post Eric Bischoff On Whether WWE Trusts CM Punk, WWE’s Boom In Popularity appeared first on 411MANIA.",
        "content": "On the latest episode of 83 Weeks, Eric Bischoff talked about the success that WWE has found over the last year, trust the company has with CM Punk, and more. You can check out some highlights below: On the most crucial thing behind WWE’s boom in popularity: ‘Discipline, structured story and character development. And I would disagree to a degree with the person who posed that question. I think the Bloodline storyline, which started long before Vince left and was getting very exciting long before Vince left, Vince was very much a part of that storyline. And perhaps in some ways, at some points, he held it back. Maybe it could have gotten bigger, faster, stronger sooner. But Vince was very, very much a part of that. Vince’s [McMahon] commitment to Roman Reigns; let’s go back now three, four, five years. Vince was determined to get Roman Reigns over. So people could say, ‘Oh yeah, as soon as Vince left, everything got better.’ It’s not a very realistic perspective. “Yeah, I think things have gotten better better since Vince left. Only because I think the creative process is now much more efficient. I think your writing team can now, with confidence, start laying out stories without knowing in the back of their mind, in the front of the mind that there’s about a 75% chance, even though Vince would say, ‘Yeah, that looks good’ on Friday on the plane, going to Raw on Monday morning he might just tear the whole thing up and start over again. That’s a very, very uneasy feeling if you’re a creative person. And then you get to the building and you’re going to know that you’re going to have two hours to write a brand new show from top to bottom that has to be approved. Not only does it have to be approved, if there is a spelling error in the first draft of what you think you want to do and you want to present to Vince with only two hours before show time. But if he sees a typo or poor grammar, there’s a chance he’ll just rip the whole thing up without the rest of it, and ask you to go redo it. And let you know what he thinks of your grammar and your spelling on your way out the door. That’s not efficient creative. And it takes a creative person so outside of their game and the train of thought, the frame of mind, the vibe they have to be in, it’s just it’s a different world being in creative. And to have that kind of instability throughout the entire process doesn’t get you to the best creativity by any stretch of the imagination.” On whether WWE trusts Punk enough to make him World Champion: “You know, I don’t know the culture that exists today. I knew the culture that existed last time I was there. I was in — and I’m going to be very vague, but I’m doing it intentionally out of respect, so please accept that. But I was in a meeting, Punk’s name came up, and all of the key decision-makers in WWE at that time were in that meeting. And that name came up, and the conversation lasted all of three minutes. And that was the end of that. That was the culture then. I don’t know what the culture is now. You know, Triple H used to work for me, Paul Levesque worked for WCW before he went to WWE but I never got to know Paul then, a couple of conversations with him really. Even when I worked with him when I first went to WWE as a talent, very little conversation with Paul Levesque. When I worked there in 2019 for a cup of coffee, I interfaced with Paul Levesque more than I ever had in the previous 20 years. But even then, I didn’t really get to know him. So I don’t know what Paul thinks, and what his tolerance is for situations like CM Punk brings. “I suspect that — two things. One is, I don’t think CM Punk’s going to even try to exert the kind of — I’m going to call it bullying, right? He ain’t throwing his weight around backstage at WWE anywhere. The company is so much bigger than him, there’s no room for that there, and nobody will tolerate it. And I think because of history, people will be watching very carefully how Phil Brooks as an individual handles himself professionally behind — because there’s no question the CM Punk character is viable and valuable. The question mark is, is Phil Brooks the professional that he needs to be to make it work? I suspect he probably is. I suspect that, I hope, that Phil Brooks is going, ‘Wow, this is a hell of an opportunity. I can write the end of my own story. I can retire from this business on a positive note. And oh by the way, I can pocket millions and millions of dollars along the way. But I gotta be a team player.’ That’s what I hope, and that’s what I think is probably going on: he’s a smart guy. He has to be a smart guy to get where he is right now. But I do think that there’s probably eyes on Phil Brooks and the way he conducts himself. But I don’t know where the guardrails are, but I don’t think it’s going to be an issue, I really don’t. I said this before he even went there when speculation was, ‘Do you think he’ll go?’ I said, ‘Sure, he’ll go. If he has the opportunity, he’d be crazy not to.’ But he’s not going to get away — there is no CM Punk running amok backstage. No one’s going to get choked out. No one’s going to be in fear for their life. You’re not going to have the craziness and the mishegoss going on backstage and the drama that went on in AEW because it’s an entirely different environment.” If you use any of the quotes in this article, please credit 83 Weeks with an h/t to 411mania.com for the transcription.",
        "pubDate": "2023-12-15 13:00:02",
        "image_url": null,
        "source_id": "411mania",
        "source_priority": 18613,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "08fdef5b0b9c77327dedea548d8d914e",
        "title": "Big Meat just can’t quit antibiotics",
        "link": "https://www.vox.com/future-perfect/2023/1/8/23542789/big-meat-antibiotics-resistance-fda",
        "keywords": null,
        "creator": [
          "Kenny Torrella"
        ],
        "video_url": null,
        "description": null,
        "content": "The US Food and Drug Administration (FDA) knew that America’s meat industry had a drug problem. For decades, evidence had amassed that the widespread use of antibiotics to make livestock grow faster — and survive the crowded, unsanitary conditions of factory farms — was causing bacteria to mutate and develop resistance to antibiotics used in human medicine. Over time, once easily treatable human infections, such as urinary tract infections and tuberculosis, became to treat. A foundational component of modern medicine was starting to crumble. But it wasn’t until the mid-2010s that the FDA finally took the basic steps of requiring farmers to get veterinary prescriptions for antibiotics and banning the use of antibiotics to make animals grow faster — steps that some European regulators had taken a decade or more prior. Thanks to those two actions alone, sales of medically important antibiotics for livestock plummeted 42 percent from 2015 to 2017. But in a concerning course reversal, antibiotic sales for use in livestock have ticked back up, increasing 12 percent from 2017 to 2022, per a new . Sales increased 4 percent in 2022 alone. In 2022, the chicken industry’s antibiotics purchasing slightly declined, but in every other major sector — cattle, pork, and turkey — antibiotic sales rose. “Antibiotic sales to meat producers continue to increase despite efforts that the FDA has made,” Louis Sokolow, a policy associate with Frontier Group, a public health and sustainability research organization, told Vox. “The status quo of these small increases year over year is not enough to protect people from antibiotic-resistant bacteria.” According to an published in September by the Natural Resources Defense Council and One Health Trust, medically important antibiotics are increasingly going to livestock instead of humans. In 2017, the meat industry purchased 62 percent of the US supply. By 2020, it rose to 69 percent. It’s a sobering turn of events with life-and-death implications. In 2019, antibiotic-resistant bacteria directly killed over globally, including , and more than 5 million others across the world died from diseases where antibiotic resistance played a role — far more than the global toll of HIV/AIDS or malaria, leading the World Health Organization to antibiotic resistance “one of the biggest threats to global health, food security, and development today.” Public health advocates want to see the FDA take the threat much more seriously, and often point to Europe as a . From 2011 to 2022, antibiotic sales for use in livestock fell across the European Union, and use per animal is now that of the US. Last year, the EU implemented perhaps its most significant reform yet: banning the routine use of antibiotics to prevent disease, reserving their use for only when animals are actually sick. It’s unlikely the FDA will follow in Europe’s footsteps any time soon. Asked about an EU-style ban on preventive use of antibiotics, an FDA spokesperson responded, “The laws in the US and our livestock population are not the same as that of the EU or other countries. The FDA’s initiatives to promote judicious use and reduce AMR [antimicrobial resistance] were devised specifically for the US and the conditions we face with the aim of maximizing effectiveness and cooperation of drug sponsors, veterinarians, and animal producers.” The FDA and the US food industry have proven that they can make progress on the issue — but to keep antibiotics working, they need to do a lot more. That will require them to tackle beef and pork, two of the more stubborn and complex sectors of America’s meat system that just can’t seem to quit antibiotics, since doing so could demand substantive changes to how animals are farmed for food. The American antibiotic-free revolution that wasn’t It wasn’t just the FDA’s new rules that caused antibiotic sales for livestock to plunge in a two-year period — Big Chicken played a part too. In the early 2000s, the nation’s fourth-largest chicken producer began efforts to wean its birds off antibiotics, which it achieved in 2016 by changing chickens’ diets and replacing antibiotics with vaccines and probiotics. At first, chicken raised without antibiotics cost 50 percent more, but the company says it has since been able to all but close the cost differential. In the mid-2010s, while Perdue was making progress, activists leveraged the momentum and McDonald’s to source chicken raised without medically important antibiotics which contributed to a domino effect in which producers and restaurants made further pledges to reduce antibiotics in poultry. By 2020, a little of America’s 9 billion chickens farmed for meat were raised without antibiotics, according to an . The sea change in chicken production demonstrated it was possible to quickly scale down antibiotics in farming, but it didn’t do much to reduce overall use, as the chicken industry only used 6 percent of antibiotics in agriculture in 2016. And the momentum didn’t spread to other parts of the meat business, like beef and pork, which together account for over of medically important antibiotics fed to farmed animals. Some of the lack of progress in beef and pork comes down to the simple fact that pigs and cattle are raised differently than chickens. Chickens are slaughtered at just six or seven weeks old, so the chance they’ll get sick is lower than pigs, who are slaughtered at six months old, or cattle, slaughtered at around three years of age. The chicken industry is also vertically integrated, meaning a company like Tyson or Perdue controls virtually every link in the supply chain, so making big changes like cutting out antibiotics is easier than in the more decentralized supply chain of beef. For example, the typical steer will change hands several times before slaughter, going from a breeder to pasture grazing to a feedlot, all of which make it harder to coordinate an antibiotic-free regimen. In the last few months of their life cattle are also fed a high-grain diet that they aren’t adapted to digest, which increases the chance they’ll develop a , a condition that’s prevented with antibiotics. The pork sector, like poultry, is also vertically integrated, but the industry has largely opposed , , and reforms. Antibiotics in pig production shot up from 2017 to 2022. There’s also no pork or beef giant that’s taken the antibiotic-free leap like Perdue did for chicken. That could change in the years ahead: McDonald’s, the world’s largest beef purchaser, at the end of 2022 that it plans to reduce antibiotic use in its beef supply chain. However, the announcement didn’t come with a timeline, which . Although voluntary change can move the needle, without regulation, industry has little incentive to make the dramatic reductions needed to safeguard antibiotics. While the FDA has prohibited meat producers from using antibiotics to speed up growth— their in agriculture — some of the that , like tylosin, are still allowed for disease prevention. Matthew Wellington, formerly of the Public Interest Research Group, or PIRG, told Vox this is a that disincentivizes producers from reducing antibiotics: “Our concern has always been that they’re just putting a different name on the same kind of use, which is a problem.” (This story was originally published in January 2023; Wellington has since left PIRG). In response to this concern, an FDA spokesperson said, “Veterinarians are on the front lines and as prescribers, they’re in the best position to ensure that both medically important and non-medically important antimicrobials are being used appropriately.” Aside from outright banning the routine use of medically important antibiotics to prevent disease, PIRG would like to see the FDA take three actions: set a target of reducing antibiotic use by 50 percent by the end of 2025 (based on 2010 levels); publish data on antibiotic use, not just sales; and limit the duration of antibiotic courses for farmed animals. An FDA spokesperson said specific reduction targets weren’t possible because the agency doesn’t know how many antibiotics farmers are using: “We cannot effectively monitor antimicrobial use without first putting a system in place for determining [a] baseline and assessing trends over time.” The agency right now only collects sales data, and it’s been exploring a to collect and report real-world use data. Some states haven’t waited on federal regulators: have both restricted the use of antibiotics on farms. How the Europeans — and some Americans — are quitting antibiotics on the farm Just because it’s difficult to reduce antibiotics in beef and pork production doesn’t mean it’s impossible, as the story of Iowa pig farmers Tim and Deleana Roseland demonstrates. In 2005, they switched from raising pigs in the conventional manner — tightly cramped and fed a steady diet of antibiotics — to raising pigs for Niman Ranch, a higher-welfare meat company now owned by Perdue. That required the Roselands to ditch the routine use of antibiotics. “I was nervous about it at first but as it turned out, it was no big deal whatsoever,” Tim Roseland said. But he added that it wouldn’t have been possible with his old setup: “There’s too much overcrowding, small pens, too many pigs crammed into a little area.” Their newer system gives each pig more space in larger pens, and bedding that they root through and chew on, instead of, when they’re packed into factory farms, chewing on each other. They also give the pigs more vaccines and feed them probiotics. And there’s a lot to learn from Denmark, Europe’s pork producer. From 1992 to 2008, antibiotic use per pig fell by over 50 percent, and while pig mortality went up in the short term, by 2008 it had dropped back to near-1992 levels. The small country’s transformation wasn’t a matter of rocket science, but a suite of smart : more frequent barn cleaning, better ventilation, later piglet weaning, more space per pig, , and experimenting with feed and additives. All this comes with difficult tradeoffs: antibiotic-free pork costs more and requires more land, which increases its carbon footprint. But we can’t expect to have cheap meat forever without a cost to public health, an uncomfortable truth that’s led many environmental and public health groups to champion a message of meat. “I think the fact that Denmark, despite very low antibiotic use since 1995, is still one of the biggest pork exporters in the world, already speaks for itself,” said Francesca Chiara, a director at the University of Minnesota’s Center for Infectious Disease Research and Policy. Given the of global antibiotic sales for agriculture, Denmark’s example may not be speaking loudly enough. But it’s time we listen — nothing less than the future of human medicine is at stake.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://cdn.vox-cdn.com/thumbor/KeisDNwx0XG3IGlSeK887CqPOJo=/444x0:4000x2667/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/71839246/GettyImages_957346802.0.jpg",
        "source_id": "vox",
        "source_priority": 889,
        "country": [
          "united states of america"
        ],
        "category": [
          "health",
          "science"
        ],
        "language": "english"
      },
      {
        "article_id": "d3d6aa862ca0c4a1768fb43a46827e0e",
        "title": "Badlands deer hunting pressure takes center stage as outdoors issue",
        "link": "https://www.inforum.com/sports/northland-outdoors/badlands-deer-hunting-pressure-takes-center-stage-as-outdoors-issue",
        "keywords": null,
        "creator": [
          "Brad Dokken"
        ],
        "video_url": null,
        "description": "It’s a social issue, in part, but it’s also becoming a biological issue as the percentage of deer harvested by archery in some Badlands hunting units approaches the percentage of deer taken by gun.",
        "content": "Growing up in western North Dakota, Angelo Vournas developed a passion for archery hunting in the Badlands at an early age. “My mom would call into school at noon and say I was sick, so I’d go down to the Badlands my senior year,” said Vournas, who graduated from high school in Williston, attended college at UND and now lives in Minot. “I spent a lot of time down there.” Then as now, the vast amount of public land available in the Badlands of western North Dakota and the potential for shooting a trophy mule deer buck with his bow were big attractions, Vournas says. READ MORE OUTDOORS ISSUES COVERAGE: Feds agree to draft new national recovery plan for gray wolves 40m ago Zebra mussels discovered in South Dakota portion of Lake Oahe 2d ago Second deer shot this fall south of Crookston tests CWD-positive 6d ago Dokken: Game and Fish may allow sharptail hunting north of U.S. Highway 2 Dec 2 “You can kind of go wherever you want because it’s all open,” he said. “The nice thing about the Badlands is that you have that accessibility, where you can stretch your legs out and cover ground and look at different things. “A lot of it is just getting by yourself. You can get off trail and not have to worry about people, typically.” ADVERTISEMENT The “not have to worry about people” part of the attraction has started to change in recent years as more people discover the Badlands and what it has to offer. That includes not only deer hunting, but sharp-tailed grouse hunting, hiking, biking and other outdoor recreational activities. But it’s the deer hunting pressure that has had perhaps the greatest impact on the experience, Vournas and others say. It’s gotten to the point, Vournas says, where he doesn’t even hunt the September archery opener anymore, “just because of the amount of people that are down there.” Many of those people, he says, are hunters, often from out of state, who may not understand how to pursue deer in the rugged Badlands environment. Vournas prefers the “spot-and-stalk” technique, glassing the horizon with binoculars in hopes of spotting a mule deer bedded down and then making a slow, stealthy pursuit that can take hours. “A lot of people just go walking around with their bows thinking they’re going to shoot a mule deer,” he said. “What they don’t realize is that they’re probably not going to shoot a mule deer and they’re screwing it up for everybody else who is trying to (spot) one and then be able to make a stalk on it.” In response to the uptick in Badlands traffic and calls from the public, the North Dakota Game and Fish Department is exploring options for managing the situation. “We’ve been hearing from the public for the last few years a bit more, I would say,” said Bill Haase, assistant wildlife chief for Game and Fish in Bismarck. “Especially from archery hunters. The hunting pressure is taking away from the quality of the hunt. And then from the gun hunters – they’re getting frustrated because it’s more and more difficult to draw that coveted (mule deer) gun tag.” Allocating licenses Game and Fish sets mule deer gun licenses based on population surveys, which gives them the flexibility to adjust tag numbers as necessary, but archery licenses are trickier because the regulations are in state law. North Dakota residents can buy archery tags basically over the counter, allowing them to hunt anywhere in the state and shoot either white-tailed or mule deer. ADVERTISEMENT There’s no limit on the number of whitetail-only bow licenses available to nonresidents, but nonresident “any-deer” archery tags – allowing the harvest of either a mule deer or a whitetail – are limited, by state law, to 15% of the previous year’s mule deer rifle tag allocation. Nonresident archery tags cost $250. It’s a social issue, in part, Haase says, but it’s also becoming a biological issue as the percentage of deer harvested by archery in some Badlands hunting units approaches the percentage of deer taken by gun. “The success rate in archery hunters the last few years has been anywhere from 9% to 15%, so it’s low,” Haase said. “It’s tough to shoot a deer in the Badlands with a bow, but the effort is really high. So, when you have a lot of people doing it, it starts to add up to a meaningful harvest.” Throw in a lower mule deer population, the result of poor fawn production after severe drought in 2021 and consecutive harsh winters in 2022 and 2023, and the issue becomes even more pronounced. Mule deer populations in the Badlands have declined from more than 10 deer per square mile to “probably below six,” Haase said in November during a livestream of the Game and Fish Department’s fall advisory board meeting in Bismarck. In this screen shot, Bill Haase, assistant wildlife chief for the North Dakota Game and Fish Department, discusses hunting issues Tuesday, Nov. 21, 2023, during the Game and Fish Department's District 7 fall Advisory Board meeting in Bismarck. The meeting was livestreamed on the Game and Fish Department website. Contributed / North Dakota Game and Fish Department Fawn production last spring was the lowest ever recorded, “and that’s concerning for us,” Haase told the Herald. “It’s been kind of a tough go here for a while, and our numbers have dropped – our densities are lower out there,” Haase said in an interview. “They’re OK – it’s not like we’re not going to recover from it. They’re down, but not drastically down because we’ve been very conservative with our gun tag allocation.” In 2023, Game and Fish offered 862 nonresident “any deer” bow licenses statewide. In response to the population decline, the department drastically cut mule deer gun licenses in 2023 – 2,250, compared with 5,750 in 2022 – but this year’s nonresident “any deer” bow tag allocation was higher than it should have been, Haase says, because of the state law requiring that nonresident any-deer bow licenses be set at 15% of the previous year’s mule deer gun tag allocation. ADVERTISEMENT Contributed / North Dakota Game and Fish Department Next year, nonresident “any deer” bow tags will “drop dramatically,” Haase said, because fewer mule deer gun licenses were available this year. “It’ll be a big drop (in 2024) because it’s a year delay on that, and so that’s kind of unfortunate,” he said. “We’re not able to be as reactive with that (nonresident “any deer” archery) tag allocation as it should be.” The past three years, Haase says, Game and Fish has expanded its post-hunting season archery surveys in an effort to learn more about where bowhunters are going and whether certain times of archery season are busier than others. “We found it’s busy, and it’s busy throughout the season,” he said. Tackling the issue In an effort to gain even more insight into the Badlands issue, Game and Fish last spring assembled a three-person “Badlands License Working Group,” which included a representative from the North Dakota Bowhunters Association, a representative from the North Dakota Chapter of Backcountry Hunters and Anglers and a certified Pope and Young scorer with ties to landowners and the Mule Deer Foundation. The group met twice in the spring and early summer, said Brock Wahl of Bismarck, co-chairman of the North Dakota Backcountry Hunters and Anglers chapter who was part of the group. Brock Wahl of Bismarck, co-chairman of the North Dakota Chapter of Backcountry Hunters and Anglers. Contributed / Backcountry Hunters and Anglers “In those meetings, we went over some of the data that Game and Fish had – what they’re seeing with that data, what they’re hearing from hunters, and some of that is just what’s going on in the rumor mill,” Wahl said. “Is there a lot of people concerned about it, or is it just a few people, or what’s going on – is it rifle hunters, bowhunters, landowners – what’s happening here?” In response to those meetings, Game and Fish contracted with a Colorado firm, HDNR Consulting LLC, to develop a survey, which was sent in September to a random sample of 8,000 North Dakota resident deer hunters. ADVERTISEMENT Out of those 8,000 hunters, more than 4,000 responded, and Game and Fish is in the early stages of analyzing the report, which is about 55 pages long, Haase says. “One of the takeaways was that the majority of people are interested in some type of specific management of these archery licenses,” Haase said. “It’s certainly something that we’re going to look at (for) nonresidents and residents,” in terms of how archery licenses are allocated. One thing’s for sure: Whatever changes ultimately result – if any – won’t be to everyone’s liking. “No matter what we do, I can assure you not everybody will agree with us,” Haase said. “There’s people on each end and everywhere across the middle. And there’s a lot of different ways to go, so it’s tough.” Max Hoefs of Grand Forks, who moved to North Dakota from Minnesota in the early 2000s, says he’s been hunting the Badlands since about 2006 and so far this year has spent about three weeks in the rugged country trying to fill his archery tag. “I fell in love with the Western-type of hunting; the spot-and stalk part of it is a little more challenging than sitting in a tree stand for whitetails,” he said. “Sitting on a nice butte, sitting on a nice hillside with a good pair of binoculars and just enjoying nature and looking for a good mule deer. … That’s how I fell in love with the out-West (style of hunting).” Like other resident archery hunters, Hoefs says he appreciates being able to purchase a license every year. On one hand, Hoefs says, he’d like to see fewer nonresident archery hunters in the Badlands – or perhaps even none – but understands the revenue that nonresident license fees bring to the Game and Fish Department. “I’d be really sad as a North Dakota resident not being able to bow hunt in the state” every year, Hoefs said. “But if it was proven that, ‘Hey, if we do this, if we cut the number of tags back, the deer population (and) the success rate would be better,’ would I be for it? Honestly, I don’t know.” ADVERTISEMENT The broad range of opinions definitely adds to the challenge, says Wahl of Backcountry Hunters and Anglers. “Everybody’s got an opinion about what’s going to work and what’s best for them. And I’m no different,” Wahl said. “I have my own biases, and I think the challenging thing for us as a chapter is this is going to be a difficult issue for us to really come out strong in support of one particular idea or concept because, with social issues, you’re going to have a lot of unique and passionate opinions. Everybody has their opinion of what’s best. And so as an organization, it would be very difficult for us to come out really strong in support of something and expect that all of our membership is going to be in unified agreement with that.” What’s next Once Game and Fish has analyzed the survey results, the department will meet in January with the Badlands License Working Group and hold public meetings around the state sometime in February or March to gather additional input, said Haase, the assistant wildlife chief. Whatever regulation changes are implemented for next fall, if any, will have to be included in the proclamation of proposed 2024 big game hunting regulations due at the governor’s office in mid-April, Haase said. Others would require legislative action because they’re in state law. “We don’t have to do everything this year,” he said. “Maybe we’ll implement some things this year and then analyze, see what happens and then adjust accordingly. “I don’t know yet, we’ll see. We haven’t made any determinations.” Change is often difficult, and this process is no different, Wahl said. “What we’re talking about here is changing a really long history of the way things have been done in North Dakota,” Wahl said. “And whether or not there’s going to be a change, I don’t know at this point. But I do think when you’re talking about these hunting traditions, tag allocation and season setting, those are tied to our traditions, and so anytime you’re talking about a change like this, which could affect archery and rifle seasons and how often you get to go hunting with certain weapons, that’s a big deal. ADVERTISEMENT “I would really encourage hunters who engage on this issue to keep an open mind and not be selfish.” Share Share this article News reporting News reporting Based on facts, either observed and verified firsthand by the reporter, or reported and verified from knowledgeable sources. The Trust Project What is this? Tags Tags NORTHLAND OUTDOORS GRAND FORKS HUNTING OUTDOORS ISSUES NORTH DAKOTA GAME AND FISH DEPARTMENT By Brad Dokken Brad Dokken joined the Herald company in November 1985 as a copy editor for Agweek magazine and has been the Grand Forks Herald's outdoors editor since 1998. Besides his role as an outdoors writer, Dokken has an extensive background in northwest Minnesota and Canadian border issues and provides occasional coverage on those topics. Reach him at bdokken@gfherald.com, by phone at (701) 780-1148 or on X (formerly Twitter) at @gfhoutdoor. Twitter",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": null,
        "source_id": "inforum",
        "source_priority": 14163,
        "country": [
          "united states of america"
        ],
        "category": [
          "sports"
        ],
        "language": "english"
      },
      {
        "article_id": "e09202c473d4b7f049215097a3ddd378",
        "title": "New Shows & Movies To Watch This Weekend: Prime Video’s ‘Reacher’ Season 2 + More",
        "link": "https://decider.com/2023/12/15/best-new-movies-shows-weekend-netflix-hulu-amazon-prime-hbo-december-15-2023/",
        "keywords": null,
        "creator": [
          "mliss1578"
        ],
        "video_url": null,
        "description": "...plus the series finale of The Crown on Netflix, Mark Wahlberg in The Family Plan on Apple TV+ and more!",
        "content": "From the final season of The Crown to the latest Mark Wahlberg action comedy, there’s something new for everyone this week! Not sure which new releases to check out? Let us here at Decider help you figure out what to watch this weekend and where to stream it. The end of Netflix’s The Crown is upon us, and all six of the show’s final episodes are now available to watch. On Prime Video, it’s the return of everyone’s favorite strong and silent type, Jack Reacher, in Reacher . And on Apple TV+, Mark Wahlberg, Michelle Monaghan, and Maggie Q star in The Family Plan about a man (Wahlberg) trying to keep his past as an assassin hidden from his wife and kids. After six seasons, multiple cast changes, and a gamut of emotions, The Crown is coming to an end at Netflix this week. The show, which has been a flagship series for the streamer, has gone from historical drama to tabloid fodder with the newest season focusing on the death of Princess Diana and the rise of Prince William. The final six episodes came out Thursday, December 14. Like the book series that it’s based on, Prime Video’s Reacher plops it’s main character, retired Army officer Jack Reacher (Alan Ritchson), into different crime-filled situations that he has to resolve using his hulking body and interior monologues. Most of the cast for season two is new, save for Ritchson, and Reacher has moved on from Margrave, Georgia to California where he’s trying to solve the mysterious deaths of members of his old Army unit. (This season will be based on Lee Child’s 11th book in his series, Bad Look and Trouble .) The first three episodes of Reacher season 2 are out now, with new episodes airing weekly. If it’s been a minute since you’ve watched a movie about a retired assassin who’s been forced back into the killer lifestyle despite his attempts to be a normal guy, might we suggest The Family Plan , starring Mark Wahlberg? In the Apple TV+ film, Wahlberg stars as Dan Morgan, a married father of three whose identity as a former government assassin has been discovered by an old foe. In an attempt to protect his family, he takes them on a road trip to Las Vegas where he plans to keep them safe, while fending off the enemy who wants him dead. The options above only scratch the surface, so you know that this weekend’s full lineup will have amazing options for what to watch this weekend! For the full breakdown of the best movies and shows to stream now, or if you’re still undecided on what to stream this weekend, then check out the complete list below: As the Crow Flies : Season 2 (TR) *NETFLIX SERIES Married at First Sight : Season 14 The Crown : Season 6 Part 2 (GB) *NETFLIX SERIES Yu Yu Hakusho (JP) *NETFLIX SERIES ​Carol & The End of The World *NETFLIX SERIES Chicken Run: Dawn of the Nugget (GB) *NETFLIX FILM Face to Face with ETA: Conversations with a Terrorist (ES) *NETFLIX DOCUMENTARY Familia (MX) *NETFLIX FILM The Hills : Seasons 3-4 Yoh’ Christmas (ZA) *NETFLIX SERIES The Family Plan A Nurse To Die For : Special Premiere Blue Jean | 2022 Dragons: The Nine Realms : Complete Season 8 *Hulu Original Higher Power | 2018 I Was Possessed : Complete Season 1 Swamp People : Complete Season 14 Top Shot: All-Stars : Complete Season 5 2 Days In New York | 2012 Alan Partridge | 2013 CMA Country Christmas (ABC) Freakonomics | 2010 I Give It A Year | 2013 Lemon | 2017 Results | 2015 Such Brave Girls : Complete Season 1 *Hulu Original The Giver | 2014 The Retirement Plan | 2023 White God | 2014 On the Tee , Season 1B The Giver (2014) Leo Reich: Literally Who Cares?! (HBO Original) Mysteries of the Abandoned , Season 8B (Discovery Channel) The Gilded Age OWN Holiday Movie: The Christmas Detective (OWN) (2023) The National Christmas Tree Lighting** Finestkind premiere Willie Nelson’s 90th Birthday Celebration Concert Special ** Barbara Lee: Speaking Truth to Power Best Sellers Dead Birds Disturbing the Peace Finder’s Fee Finding Steve McQueen It Had to Be You Lawnmower Man 2: Jobe’s War Mad To Be Normal Metroland Mirrors New In Town Nightbreed Power Book III: Raising Kanan : Episode 303 – “OPEN FOR BUSINESS” Purple Violets Rock The Kasbah So Undercover The Cry Of The Owl The Final Cut The Lawnmower Man The Mist The Mothman Prophecies CMA Country Christmas Special A Christmas Star (2021) (Freevee) Night Court : S1-9 (1984) (Freevee) Reacher : S2 (2023) *Prime Video Original Series Liz Kocan is a pop culture writer living in Massachusetts. Her biggest claim to fame is the time she won on the game show Chain Reaction .",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://nypost.com/wp-content/uploads/sites/2/2023/12/WHATS-NEW-DEC-15-2023.jpg?quality=90&strip=all",
        "source_id": "nypost",
        "source_priority": 109,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "af7d5935a5b5cbcd748924ad4366cb79",
        "title": "10 Essentials for the Perfect Capsule Winter Wardrobe in2024",
        "link": "https://www.vogue.com/article/winter-capsule-wardrobe",
        "keywords": [
          "Shopping",
          "Shopping / Fashion"
        ],
        "creator": [
          "Laura Jackson"
        ],
        "video_url": null,
        "description": "Fabulous faux furs, notable knitwear, and stompy lug-sole boots round out our list of capsule winter wardrobe pieces. Shop our must-haves now.",
        "content": "You can always count on an assortment of staples to put together a reliable uniform look. That’s the thing about everyday pieces, they can be worn with just about everything in your closet. When it comes to a capsule winter wardrobe, the same rules apply, though the are a bit different–more suited to braving strong winds and freezing temperatures. Capsule Winter Wardrobe Wishlist: A roster of versatile sweaters and foundational layering pieces like a turtleneck is key for cold days. And like your pleated trousers for spring and fall, a pair of tailored pants made from warmer materials (think: wool) will be your new go-to. You’ll also want to have a that can extend itself into many outfits, think: a great for a soirée and a snow day, plus that can comfortably sit atop even your heaviest layering. Our favorites include fabulous from Toteme and The Frankie Shop for instant chic, plus glossy From Tory Burch and The North Face that transition from the streets to the slopes seamlessly. Après-ski-approved from Leset and Uniqlo are easy yet elegant, whether tucked into a winter boot or worn underneath a baggy pair of corduroys as an extra base. We can’t forget about those classic winter accessories, either, like a chic leather glove from Banana Republic or Loewe’s fringed mohair . Did we also mention that either of these also make a this holiday season? Complete your capsule winter wardrobe with our guide to winter’s must-have style essentials, below. Fabulous Faux Fur Coats This winter’s ultimate is undoubtedly the fabulous faux fur coat, worn adoringly by both fashion girls and editors alike. Options from Toteme and H&M are true-to-the-classics, while belted faux furs from The Frankie Shop and Mackage offer up a cinched-waist silhouette that brings definition to an otherwise voluminous silhouette. Warming Winter Dresses A casual knit or wool is a one-and-done piece that makes everyday winter dressing effortless. Opt for Mango’s turtleneck dress or Toteme’s flannel frock, both of which go from commute-to-cocktail all too chicly. For more of a splurge, consider Khaite’s festive Fair Isle find or even Proenza Schouler’s striped style. Festive Fair Isle Sweaters The is never not in style. Khaite’s button-up cardigan is snuggly as it stylish, while Gap’s funnel-neck find is a great . With a pop of cherry red, Polo Ralph Lauren’s crewneck is sure to brighten up any winter blues, while &Daughter’s cardigan is a must-have. Puffer Jackets Padded-to-perfection, blanket-like puffer jackets from Banana Republic, Moncler, and The North Face are sure to fit your every winter dressing need. The latter is especially beloved by celebs and for its generously-sized, extra-warm design. Also on our winter wish list is Tory Burch’s bright red puffer, which comes complete with a glossy finish to standout on the slopes or the city streets. Cozy, Chic Corduroys A slouchy pair of is not only cozy, but super chic, too. Dark brown pairs from Agolde and Dries Van Noten can transition seamlessly from work to weekend, while options from J.Crew and Everlane will appeal to the trend-curious shopping on a budget. Stompy Lug-Sole Boots Beloved for its toothy rubber sole, the is ideal for navigating inclement weather. And while it does have roots in functionality, that doesn’t mean lug-soles aren’t great for everyday wear or even special occasions, say with a tailored trouser or knit dress. Highlights include Chloé’s shearling-lined pair, The Row’s zip boot—an editor favorite—and Ganni’s waterproof ankle bootie. Heavyweight Wool Trousers The pleated tailored trouser is still a wonderful option for the winter months, as it wears well with and sweaters. We recommend, however, styles in heavier and warmer fabrics like cozy flannels or brushed wool to keep the cold air out. Après-Ski-Approved Leggings A sleek pair of is a foundational layering essential in any . Classic ankle-grazing pairs from Toteme and Uniqlo are après-ski-approved, while Leset’s stirrup style is effortlessly cool for the workplace. We can’t forget about Nili Lotan’s cashmere leggings either, a stylishly warm staple. Slim-Fitting Turtlenecks Don’t start an outfit without one. A close-fitting soft cotton jersey or cashmere blend turtleneck will ensure a warm base with a stylish layering component underneath a . The Accessories Station No capsule winter wardrobe would be complete without a (or two…or three). You’ll find us slipping into Banana Republic’s burgundy leather gloves during the week, then Rag & Bone’s printed mittens on holiday. Complete your look with Loewe’s viral mohair-blend scarf and a chic cashmere beanie from Johnstons of Elgin.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://assets.vogue.com/photos/657b6b68f4f0d47ed9fe7e4a/master/pass/Toteme%201.jpeg",
        "source_id": "vogue",
        "source_priority": 4162,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "2fba36f6b94439efb2fb387e39c3bb61",
        "title": "36 Thoughts I Had While Rewatching Lifetime’s ‘William and Kate’",
        "link": "https://www.vogue.com/article/rewatching-william-and-kate-on-lifetime-36-thoughts-i-had",
        "keywords": [
          "Culture / Opinion",
          "Culture / TV & Movies"
        ],
        "creator": [
          "Emma Specter"
        ],
        "video_url": null,
        "description": "Hunting, then church? God, I would not be good as a royal consort.",
        "content": "The love story of “William Wales” (a.k.a. Prince William) and Kate Middleton hit Netflix this week via the final installment of Peter Morgan’s , but if you’re in the market for an even schlockier, more made-for-TV version of that royal romance, you’re in luck. , the Lifetime movie starring Nico Evers-Swendell and Camilla Luddington, is currently available to stream on . In order to determine who wore it best, royal-biopic-wise, I rewatched the Lifetime film…and boy, am I glad I did. Below, find all the thoughts I had while revisiting :",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://assets.vogue.com/photos/657bb33a476d8287662eab27/master/pass/GettyImages-808934178.jpg",
        "source_id": "vogue",
        "source_priority": 4162,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "b74a9b539cf708e656c76af4bd8759e9",
        "title": "The Best Memes of 2023",
        "link": "https://www.vogue.com/article/best-memes-of-2023-so-far",
        "keywords": [
          "Culture"
        ],
        "creator": [
          "Abrigail Williams"
        ],
        "video_url": null,
        "description": "Considering how fast-paced the world of social media can be, you’d be forgiven for not remembering every viral tweet or trend that had you chuckling this year. To help jog your memory, we’ve rounded up the best memes of 2023.",
        "content": "Another rotation around the sun means another year stacked with memes. But considering how fast-paced the world of social media can be, you’d be forgiven for not remembering viral tweet or trend that had you chuckling under the covers at odd hours of the morning this year. So, to help jog your memory, has rounded up the best memes of 2023. Whether you’re here to relive the glory days of the Barbenheimer phenomenon or experience another level of second-hand cringe at the words follow along as we unveil the best memes of the year. Gag City What’s Gag City, you ask? Ahead of releasing , tweeted a captioned “Approaching Gag City.” Quick to respond (and start a new meme), the Barbz conjured images of the rose-tinted metropolis using AI—even going so far as to assign political leadership to it (with Minaj, of course, the leader). Pingu Dead-Staring to Mozart The likes of Mozart and Beethoven could not have possibly imagined their compositions backing silly little videos of animated penguins on billions of phones across the world. The thought makes it all the funnier when I see Pingu, a kids’ show character, staring wide-eyed as Mozart’s “Lacrimosa” plays. HUH Cat Who doesn’t love a cat meme? When you don’t understand something, or just can’t hear the person talking to you and need them to repeat themselves for the third time in a row, referencing the “HUH?” cat will get your point across. I’m Just a Girl To clarify, no, this is not a play on Julia Roberts’s monologue. “I’m just a girl” emerged as a reaction to the crushing burdens of modern womanhood, justifying a certain kind of indulgence. Why are you tired between 3 and 5 p.m.? Why do you deserve a coffee and sweet treat in the middle of the day,? Because you’re just a girl trying to make it all work. Squirtle Playing the Saxophone That’s it! That’s the meme. It’s a Pokémon with sunglasses, blowing away on the saxophone to the tune of “Run Away” by SunStroke Project. The mirrors a of “Epic Sax Guy” doing the same, and it’s just a mood. Who’s That Wonderful Girl? Could She Be Any Cuter? Thank you to whoever started this meme for forcing me to listen to some positive affirmations. The viral clip comes from , an old Canadian children’s show. DJ Khalid Says the Darndest Things Call me Tiger Woods, because I’m about to drive this point home: I’ve been reprimanded far too many times for saying “LET’S GO GOLFING” in the tone of DJ Khalid, and it’s all because of this internet meme. Someone out there thought it was a good idea to “bring out the whole ocean” of DJ Khalid’s most out-of-pocket, out-of-context sayings, and the result is perfect: Usher, EryKah Badu, and Quavo Front Row at Marni What’s better than one star’s masterclass in fashion-week dressing? A group serve. The three performers were front row at Marni’s spring 2024 show in head-turning ’fits—and once the images hit the web, they immediately took off. Vince McMahon Tearing Up Not much needs to be said about this meme except it’s too real. The clip comes from a documentary in which former WWE CEO Vince McMahon is asked how much wrestling champion The Undertaker meant to him. Overwhelmed with emotion, McMahon motions to cut the cameras. Online, users coopted the moment for their own objects of nostalgic longing. Josh Hutcherson Rick Rolls the Internet Move over, Rick Astley, because Gen-Z Netizens have officially dubbed this of Josh Hutcherson the modern Rickroll. As a die-hard fan who witnessed the birth of videos like these in real time (#TeamPeeta), it’s no surprise a piece of fan history has reclaimed its rightful place at the forefront of internet virality. AI Cartoons Characters in Their Feelings Social media users have found all kinds of creative uses for artificial intelligence. What began—controversially—with some using AI to make their favorite artists sing songs from other musicians (or even rap original music), the internet has moved on to depicting their favorite cartoon characters in their feelings, at the top of their game, or simply balling out. This Stock Photo of Kevin James Caption a photo of Kevin James dressed as his character from , looking sheepishly at the camera with his hands in his pockets, and you have yourself a viral meme. Video of Jeremy Allen White Since became a hit, many started pulling clips of from his days. One went viral simply for the off-centered stare White gives the camera. Cats at the Met Gala The Met Gala always attracts attention online, as people breathlessly check how their favorite stars interpreted the theme. At this year’s event, Doja Cat and Lil Nas X seemed to take the cake with their glittery feline ensembles. Ariana DeBose at the BAFTAs The star’s monologue-rap at the BAFTAs sparked a number of cringe-filled reactions, but one thing viewers couldn’t seem to forget was the vague lyric “Angela Bassett did the thing.” Dylan Sprouse and Barbara Palvin Marry When photos of went viral online, users congratulated the couple in a funny, nostalgic way, citing Sprouse’s days promoting the when he was a Disney Channel star. All Gen-Z kids can remember trying—and failing—to win. When Everyone Started Dissecting the Physics of A lot of hilarious internet discourse ensues when one user poses a question that goes absolutely viral. In this case, it was when @KevOnStage , “What was the moment Fast and Furious abandoned reality.” The internet had a lot to say—and a lot of content to work with, since the franchise is at 10 films and counting. Taylor Swift Fans Take Ticketmaster Down “Ticketmaster-gate” will go down in history as the time Swifties toppled Ticketmaster; fans sued the company after they were unable to buy tickets to Swift’s Eras Tour. The fracas garnered a from Taylor Swift herself, and not only resulted in a lawsuit but also . Breaks the Internet Shoutout to ’s marketing team for their master class in social media mayhem ahead of the film’s July release. For a period of time, you couldn’t go online without seeing something related to the bleach-blonde doll; from memes like “Hi Barbie” to “She’s everything, he’s just Ken,” ’s relevance lasted years in internet terms. When posters for the film were first revealed, the internet wasted no time casting their own favs into the mix. After fans learned that and would be released on the same day, they joked about watching the two back to back, citing the humorously stark contrast between the rose-colored feel-good film and serious historical biopic. Then fans then started comparing Barbenheimer to with seemingly opposite vibes. One ticket to and anyone? Even Margot Robbie and Cillian Murphy seemed to get in on the fun… fans also meme-d about the funny character dynamics in the film, specifically between Barbie, with her capacity to be and do everything, and…Ken. This format went viral, too: Twitter Is Now “X” When Elon Musk announced Twitter’s rebrand to “X,” many users weren’t happy, clowning on the change that no one signed up for. Astro Boy Boots Is this where the trend started? Once the internet caught wind of these cartoonish red boots from MSCHF, the memes sort of wrote themselves. Stop Normalizing the Grind… Romanticizing anything that resembled the quiet life—a cozy-girl mentality, a sleepy woodland animal—became a trend. Because, frankly, there something beautifully aspirational about a picture of Winnie the Pooh wrapped up in a blanket drinking tea. Iterations of the meme also come in the form of “the sexual tension between me and [insert cozy activity here],” and “the feminine urge to…” Honk Shoo-ing In the vein of romanticizing coziness, the vibe of the SleepyTime Tea Bear became universally coveted this year. “Honk shoo,” the sound a fictional bear might make while passed out in an armchair, appeared in almost every tweet that described emulating the tea bear’s sensibility. Some even took it a step further, and tried to “steal his look”—making outfit breakdowns a part of the meme too. Pedro Pascal and Nicholas Cage This clip from went viral, as social media users latched on to Pedro Pascal’s wholesome demeanor and Nicholas Cage’s outrageous stare. They’re Playing Football During a Rihanna Concert Considering Rihanna’s Super Bowl Halftime show was the halftime performance of all time, it’s not a surprise that the internet was in a frenzy before, during, and after what people jokingly called a Rihanna concert…with some football.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://assets.vogue.com/photos/65493f0e65d0f178a0071558/master/pass/GettyImages-1584249148.jpg",
        "source_id": "vogue",
        "source_priority": 4162,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      },
      {
        "article_id": "1dc8864f47d75e5c26edd9d2718de557",
        "title": "Hugh Grant's best performances, ranked from least to most unhinged",
        "link": "https://www.avclub.com/hugh-grant-performances-roles-ranked-1851101308",
        "keywords": [
          "hugh grant",
          "unhinged",
          "four weddings and a funeral",
          "jane austen",
          "notting hill",
          "entertainment culture",
          "david cassidy",
          "martine mccutcheon",
          "anna scott",
          "wickham",
          "four weddings and a funeral",
          "richard curtis",
          "bridget jones",
          "emma thompson",
          "elinor dashwood",
          "drew barrymore",
          "nicholas hoult",
          "billy bob thornton",
          "forge fitzwilliam",
          "julia roberts",
          "daniel cleaver",
          "streep",
          "alan rickman",
          "sandra bullock",
          "rhys ifans",
          "paul king",
          "mike newell",
          "florence foster jenkins",
          "renee zellweger",
          "the englishman who went up a hill but came down a mountain",
          "love actually",
          "music and lyrics",
          "beryl bainbridge",
          "jay leno",
          "charles",
          "oscar",
          "an awfully big adventure",
          "andie macdowell",
          "pride and prejudice",
          "sense and sensibility",
          "nick hornby",
          "scandal",
          "two weeks notice",
          "human interest",
          "his edward ferrars",
          "georgina cates",
          "dungeons dragons"
        ],
        "creator": [
          "Cindy White"
        ],
        "video_url": null,
        "description": "When you’ve been in the moviemaking business for as long as Hugh Grant has, you’ve earned the right to take whatever kinds of chances you want in the roles you choose. If that means poking a little fun at your own image as an aging, curmudgeonly actor whose best roles may be behind him (though we’d argue that’s…Read more...",
        "content": "As we prepare for the sight of Hugh Grant as an Oompa Loompa, here's a look back at his career arc from romantic leading man to whatever it is he's doing now When you’ve been in the moviemaking business for as long as Hugh Grant has, you’ve earned the right to take whatever kinds of chances you want in the roles you choose. If that means poking a little fun at your own image as an aging, curmudgeonly actor whose best roles may be behind him (though we’d argue that’s certainly not true) or going completely off the rails as a digitally created Oompa Loompa in the new film, that’s your prerogative. After years of struggling to get away from the kinds of romantic roles he was being offered after his breakthrough performance in , it’s been fascinating to track the progression of Grant’s projects as he continues to push boundaries on his own terms. If he ever cared what audiences thought of him, he certainly doesn’t anymore. And lately it seems as if he’s found a new sort of niche that suits him. That doesn’t mean we love his performances in beloved rom-coms like and any less. He’s an actor of many talents. Here, then, are our favorite Hugh Grant performances ranging from the most stable characters to the most delightfully unhinged. 2 / 17 15. (1999) 15. (1999) Hugh Grant’s humble London-based bookseller Will in is as stable as they come—that’s the whole point of the character (it’s Rhys Ifans who gets to be truly unhinged here as his flatmate Spike). Will is a grounding presence in the looking-glass Hollywood life of American superstar Anna Scott (Julia Roberts). Despite a conscious effort to play against type in the years following his breakout role in , Grant reunited with screenwriter Richard Curtis after reading the script for , which was too good to turn down. Even now, two and a half decades later, it hasn’t lost any of its unapologetically romantic charm. 3 / 17 14. (1995) 14. (1995) If 1994’s solidified Hugh Grant’s status as a romantic lead, the Jane Austen adaptation , released the following year, showed audiences that he could do it even better in period dress. His Edward Ferrars makes an enchanting first impression, but disappears for a good chunk of the film, reappearing only at the climax to haltingly reveal his true feelings to Emma Thompson’s Elinor Dashwood. That brief scene, and both Grant’s and Thompson’s performance in it, is the perfect capper to a bright and bountiful film full of memorable moments. 4 / 17 13. (1995) 13. (1995) The unhinged length of this film’s title alone should indicate a non-zero level of whimsy without knowing anything else about it. And that’s not too far from the truth. With his star on the rise after hits like and , Grant appeared in the quaint little indie as a cartographer who travels to a Welsh village during World War I to assess whether the local geological feature qualifies as a hill or a mountain. Surrounded by colorful local characters, he does exactly what was expected of him at this point in his career. He’s a bit stiff, a bit flustered, and a bit charming, often all at the same time. 5 / 17 12. (1994) 12. (1994) Unless you lived through it, it’s hard to explain the cultural impact that had on the mid-1990s. It was . And so was Hugh Grant, stumbling through a love confession to Andie MacDowell through the words of David Cassidy (when he was still with The Partridge Family). It was the first of what turned out to be several immensely successful collaborations between Grant and screenwriter Richard Curtis that catapulted him from a relatively unknown British actor to a worldwide star. As Charles, his boyish good looks are undercut by his social awkwardness, dry wit, and plenty of self-deprecation. The role would shape his career, for better or worse, for the following decade. 6 / 17 11. (1988) 11. (1988) Before he became a recognizable star, Hugh Grant was making some real offbeat choices in film projects. Take for example, the late ’80s cult classic , in which he plays a British aristocrat whose ancestral Derbyshire home happens to be situated next to a cavern inhabited by an ancient serpentine creature and the immortal priestess who serves it. Directed by Ken Russell and loosely based on a lesser-known Bram Stoker novel, it’s as bonkers as you might expect. As the plucky young hero, Grant doesn’t get to have as much campy fun as the baddies in the one, but based on some of his later performances, he was clearly taking notes. 7 / 17 10. (2002) 10. (2002) Based on the book by Nick Hornby, manages to be heartfelt without ever losing its edge. Grant’s layered performance as Will, an independently wealthy bachelor who forms an unexpected connection with a tragically uncool middle schooler (played by a babyfaced Nicholas Hoult), is a big part of why the film succeeds as well as it does. Will isn’t as romantically idealistic as some other characters Grant has played—he can be duplicitous and manipulative—but his heart’s ultimately in the right place. It feels like just the right balance of sweet and salty for Grant at this stage of his career. 8 / 17 9. (1995) 9. (1995) might be best remembered for a fluke of timing. It came out around the same time Grant was famously arrested for soliciting a sex worker near the Sunset Strip. The proximity of the two events meant that he had to do the press tour for the film while the scandal was unfolding in the tabloids in real-time, leading to an iconic in which Grant defused the situation with his trademark self-effacing humor. That might have been his best performance of the year, though he’s not bad in the film as an increasingly nervous father-to-be. That said, we had to throw in a few extra points towards the unhinged end of the scale just for that extremely floppy hairdo. 9 / 17 8. (2003) 8. (2003) In a film overstuffed with too many characters and intertwining plots, Grant’s storyline as the newly elected Prime Minister who falls for a junior staffer (played by Martine McCutcheon) has always stood out as a fan-favorite in . Chalk it up to another successful team-up with screenwriter Richard Curtis. Grant now talks about how much he dreaded filming the famous scene when his character celebrates his political triumph over the American president (Billy Bob Thornton), but if he didn’t want the image of him dancing through 10 Downing Street to The Pointer Sisters forever burned into our brains, he shouldn’t have done such a good job at it. Afraid it’s too late now, sir. 10 / 17 7. (2007) 7. (2007) Some of the best bits in were the scenes where the film played up the concept of Hugh Grant as a 1980s pop star, both in his heyday and as a washed-up has-been. It’s a fun metatextual angle that directly references Grant’s status as a romantic lead in a late-career rom-com. The big age gap between him and his co-star love interest Drew Barrymore could have been an insurmountable obstacle, but the two actually have a good amount of on-screen chemistry that works in the film’s favor. Perhaps the musical talents he showcased here led to more opportunities to make use of them in films like and . 11 / 17 6. (2001) 6. (2001) According to Hugh Grant, screenwriter Richard Curtis always found it amusing that he was so often cast as such nice, affable blokes when he’s quite the opposite in real life. That public-private contrast clearly factored into his role in as Daniel Cleaver, a modern equivalent of ’s dastardly Mr. Wickham. You can easily see why Bridget (Renée Zellweger) would fall for him, and when his true nature is revealed, it’s devastating. Grant’s performance makes Daniel’s turn from handsome heartthrob to loathsome slimeball seem all too real. 12 / 17 5. (2002) 5. (2002) After Grant made the transition from nice guy to jerk in , he did the reverse as Sandra Bullock’s love interest and boss in . He plays a rich, self-important real estate developer who hires Bullock as his Chief Counsel and becomes so reliant on her for his every need, she gets fed up and quits. It’s during the two weeks after she gives notice that the two of them realize they might actually like each other for real. The movie itself is a fairly standard by-the-numbers rom-com, but Grant and Bullock’s performances elevate it with an acidic chemistry that makes it fun to watch. Two rom-com giants at the top of their game. 13 / 17 4. (1995) 4. (1995) Twenty years before he played drama king Phoenix Buchanan in , Hugh Grant sleazed it up as a predatory theatrical director in , a heavy drama (don’t be fooled by the cheery tone of the trailer) based on the acclaimed novel by Beryl Bainbridge. Grant has played his share of villains over the years, but Meredith Potter might be the most despicable, because of how true to life his sociopathy feels. Reuniting with director Mike Newell, Grant seems desperate to shake off the shackles of typecasting with this film, set in dreary post-World War II Liverpool. Meredith is a monster who callously uses his position of power to prey on boys, girls, or anyone who shows the slightest interest. It’s a supporting role, but he nearly steals the show from co-star Alan Rickman (not an easy thing to do) and a young Georgina Cates. 14 / 17 3. (2016) 3. (2016) In seeking to distance himself from the kinds of romantic roles he played earlier in his career, Grant has perhaps stumbled into another archetype that might suit him even better (and he would probably agree)—the overly theatrical narcissist. His character in is another variation on that theme, and was acclaimed as one of the best performances of his career up to that point. Based on the true story of a wealthy socialite (Meryl Streep, who was nominated for an Oscar in the role) who believed she had talent as an opera singer because no one would dare tell her otherwise, Grant plays Florence’s husband and manager, St. Clair Bayfield. He’s a character with murky motivations, having given up his own acting career to support his untalented wife, and Grant lets you see all the interesting facets within him, even (and especially) the flaws. 15 / 17 2. (2023) 2. (2023) Perhaps all the acclaim Grant received for his campy, over-the-top performance in inspired him to take on another baddie in From the moment we meet slippery rogue Forge Fitzwilliam, his arc from ally to adversary to the grandstanding Lord of Neverwinter is fairly predictable, but that doesn’t mean it isn’t tons of fun to watch Grant chew every bit of scenery within reach. Now that he’s fully in the DGAF phase of his career (just listen to any of his recent interviews), we’d encourage the directors of his future projects to let him off the leash more often. The results are frequently dazzling. 16 / 17 1. (2017) 1. (2017) When filmmaker Paul King first sent the script to Hugh Grant, the character of Phoenix Buchanan, a “washed-up narcissistic old actor” (in Grant’s words), was called Hugh. Grant could have chosen to take that personally and refused to have anything to do with the project, but instead, he embraced it. The performance he gives in the film is one of his best and one of his most unhinged. In a quest to hunt down a hidden treasure using clues from a pop-up book in Paddington’s possession, he employs a series of eccentric disguises to trick the poor, innocent bear. If Grant didn’t have a blast making the film, he did a fine job of making it look as though he did. 17 / 17",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://i.kinja-img.com/image/upload/c_fit,q_80,w_636/ad6d02dac224c19342ffac22349b830b.jpg",
        "source_id": "theavclub",
        "source_priority": 2320,
        "country": [
          "united states of america"
        ],
        "category": [
          "entertainment"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702645200279738909"
  }