{
    "status": "success",
    "totalResults": 12307,
    "results": [
      {
        "article_id": "15c58741aac1f0087d40def4b3a85791",
        "title": "Black child, 10, sentenced to probation for urinating in public",
        "link": "https://www.tmj4.com/black-child-10-sentenced-to-probation-for-urinating-in-public",
        "keywords": null,
        "creator": [
          "AP via Scripps News"
        ],
        "video_url": null,
        "description": "The child's attorney said he doesn't believe a White child would have been arrested under similar circumstances.",
        "content": "A 10-year-old Black child who urinated in a parking lot must serve three months’ probation and write a two-page book report on the late NBA star Kobe Bryant, a Mississippi judge has ordered. Tate County Youth Court Judge Rusty Harlow handed down the sentence Tuesday after the child's lawyer reached an agreement with a special prosecutor. The prosecution threatened to upgrade the charge of “child in need of supervision” to a more serious charge of disorderly conduct if the boy's family took the case to trial, said Carlos Moore, the child’s attorney. “I thought any sensible judge would dismiss the charge completely. It’s just asinine,\" Moore said. \"There were failures in the criminal justice system all the way around.” Moore said he doesn’t believe a White child would have been arrested under similar circumstances, and he couldn't find a similar instance of a child receiving a similar sentence for the same offense. “I don’t think there is a male in America who has not discreetly urinated in public,” Moore said. The child’s mother has said her son urinated behind her vehicle while she was visiting a lawyer’s office in Senatobia, Mississippi, on Aug. 10. Police officers in the town of about 8,100 residents, 40 miles south of Memphis, Tennessee, saw the child urinating and arrested him. Officers put him in a squad car and took him to the police station. Senatobia Police Chief Richard Chandler said the child was not handcuffed, but his mother said he was put in a jail cell, according to . Days after the episode, Chandler said the officers violated their training on how to deal with children. He said one of the officers who took part in the arrest was “no longer employed,” and other officers would be disciplined. He didn’t specify whether the former officer was fired or quit, or what type of discipline the others would face. Chandler did not immediately respond to a voicemail message Thursday. Reached by phone, a staffer for Paige Williams, the Tate County Youth Court prosecutor appointed to handle the case, said the attorney could not comment on cases involving juveniles. Rashad Robinson, president of the civil rights organization Color Of Change, said the decision to charge the child didn’t make sense. “Nothing about this case from the decisions by the police, the prosecutor, and the judge makes us safer or is a good use of taxpayer resources,\" Robinson said in a statement. He said there is a “long and unforgivable history in Mississippi and across the country” of a “two-tiered justice system” that offers one path for Black children and another for White. It was initially unclear whether prosecutors would take up the case. Moore requested a dismissal, but prosecutors declined. He planned on going to trial but shifted strategy after prosecutors threatened to upgrade the charges. The child's family chose to accept the probation sentence because it would not appear on the boy's criminal record. The 10-year-old is required to check in with a probation officer once per month. Williams initially wanted the child to write a report on public decency, but the judge changed the subject to Bryant because the boy is a basketball fan, Moore said. Marie Ndiaye, deputy director of the Justice Project at the Advancement Project, a racial justice organization, said the arrest is emblematic of broader issues in the criminal justice system. “Sentencing anyone, let alone a young child, to probation under these facts is sure to add to the trauma and denigration this child has suffered since their arrest,” Ndiaye said. “This is all the more proof that we need to severely limit police interactions with civilians, from petty retail theft to traffic stops and even so-called ‘quality of life’ offenses. For Black people in America, it is a matter of life and death.”",
        "pubDate": "2023-12-15 13:02:03",
        "image_url": null,
        "source_id": "tmj4",
        "source_priority": 7805,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "59c1d1e9bbebbc08e43f00a6cbf1578d",
        "title": "Bay Area News Group girls athlete of the week: Terren Davis, Berkeley soccer",
        "link": "https://www.eastbaytimes.com/2023/12/15/bay-area-news-group-girls-athlete-of-the-week-terren-davis-berkeley-soccer/",
        "keywords": [
          "High School Sports",
          "Latest Headlines",
          "Sports",
          "Athletes of the Week",
          "Inside Sports"
        ],
        "creator": [
          "Joseph Dycus"
        ],
        "video_url": null,
        "description": "Davis, a sophomore, scored a brace – two goals – in the YellowJacket’s 3-0 win over Pittsburg.",
        "content": "Berkeley soccer player Terren Davis is the Bay Washington-Fremont basketball player Mikaela Dumagan finished second. Congratulations to all the candidates . Related Articles Davis, a sophomore, scored a brace – two goals – in the YellowJacket’s 3-0 win over Pittsburg. Those were her first goals of the season.",
        "pubDate": "2023-12-15 13:00:51",
        "image_url": "https://www.eastbaytimes.com/wp-content/uploads/2023/12/SJM-L-PREPGENERIC-17_93229642.jpg?w=1400px&strip=all",
        "source_id": "eastbaytimes",
        "source_priority": 17164,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "5ef3059f91886080089fbfb058925b47",
        "title": "Single-family home in Oakland sells for $2.2 million",
        "link": "https://www.eastbaytimes.com/2023/12/15/single-family-home-in-oakland-sells-for-2-2-million-3/",
        "keywords": [
          "Housing",
          "News",
          "Bay Area Home Report"
        ],
        "creator": [
          "Bay Area Home Report"
        ],
        "video_url": null,
        "description": "A house located in the 100 block of Glen Eden Avenue in Oakland has new owners. The 1,548-square-foot property, built in 1941, was sold on Oct. 18, 2023.",
        "content": "A house located in the 100 block of Glen Eden Avenue in Oakland has new owners. The 1,548-square-foot property, built in 1941, was sold on Oct. 18, 2023. The $2,150,000 purchase price works out to $1,389 per square foot. This single-story house has two bedrooms and two baths. Inside, a fireplace enhances the ambiance of the living area. In addition, the home is equipped with a garage. Additional houses have recently been purchased nearby:",
        "pubDate": "2023-12-15 13:00:43",
        "image_url": "https://www.eastbaytimes.com/wp-content/uploads/2023/12/12504559_2023-10-18_propmix_260012564_main.jpeg?w=1400px&strip=all",
        "source_id": "eastbaytimes",
        "source_priority": 17164,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "5609043c91ba06dbe1d5cf97b7ef5e97",
        "title": "Cornel West says he's not sure Biden will make it to general election",
        "link": "https://thehill.com/homenews/campaign/4361793-cornel-west-e-biden-general-election/",
        "keywords": [
          "Campaign",
          "2024 democratic primary",
          "2024 election",
          "third party candidates"
        ],
        "creator": [
          "Nick Robertson"
        ],
        "video_url": null,
        "description": "Cornel West said in a new interview that he believes President Biden may drop out of the 2024 race in the coming months, amid mounting criticism over foreign policy and the economy. “I’m not even sure whether I’ll be running against Biden,” the independent presidential candidate told Politico. “Biden — I think he’s going to...",
        "content": "Cornel West said in a new interview that he believes President Biden may drop out of the 2024 race in the coming months, amid mounting criticism over foreign policy and the economy. “I’m not even sure whether I’ll be running against Biden,” the independent presidential candidate . “Biden — I think he’s going to have an LBJ moment [and] pull back.” Former President Johnson announced he would not seek reelection on March 31, 1968, just months before the election, amid concerns over his health and criticism of the Vietnam War. West said there is a real chance Biden’s campaign doesn’t make it to November. “I’m just saying that I’m open to those possibilities, given the fluidity of the situation,” the renowned academic said. “He’s running out of gas.” West said his real race is against some Democrats who haven’t declared their candidacy for the White House — Govs. Gavin Newsom (D-Calif.) and Gretchen Whitmer (D-Mich.). And while he said the Republican ticket appears more solid, he added that it’s also possible former President Trump leaves the race “if the weight becomes too heavy with the indictments and court processes.” West described Trump as a “pied piper” and a “fascist,” and Biden as a “milquetoast neoliberal.” He said both could lead the country down dark paths, Trump to a civil war and Biden to World War III. “I’m more concerned about Trump domestically,” West said. “I’m more concerned about Biden in terms of foreign policy.” West, who is running his own unaffiliated independent bid after campaigns with the People’s Party and Green Party, has received little support in national polling, while his campaign has attracted mostly disaffected young people and progressives. He has received an support in polls that include him alongside Biden and Trump, though that figure excludes other third-party candidates. In the new interview, West also downplayed concerns that he to Biden’s reelection. “There might be slices of people ‘if I didn’t vote for West, I would have voted for Biden,’” he said. “But that’s not to me, a spoiler. If you’re in a race, and you make a case, and they vote for you, how do you become the spoiler?” West has already qualified for the ballot in Alaska, he said, and hopes to make the ballot in at least 40 states by Election Day. West from independent candidate Robert F. Kennedy, Jr., who has placed himself as the premier anti-establishment candidate in 2024. Jill Stein will also return to the ballot for the Green Party.",
        "pubDate": "2023-12-15 13:00:36",
        "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/10/AP23199759951290-e1697833312247.jpg?w=900",
        "source_id": "thehill",
        "source_priority": 393,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "366e2d10181cbf5ca46f6d0c1d043fd3",
        "title": "Opinion: Women’s groups have stayed silent too long on Hamas’ violence",
        "link": "https://www.eastbaytimes.com/2023/12/15/opinion-womens-groups-have-stayed-silent-too-long-on-hamas-violence/",
        "keywords": [
          "Commentary",
          "Opinion",
          "#metoo",
          "Israel-Hamas War"
        ],
        "creator": [
          "Shoshanah Conover, Wendi Geffen"
        ],
        "video_url": null,
        "description": "The healing process for the survivors of the Oct. 7 assaults begins with being heard and believed.",
        "content": "The events of Oct. 7 and the war that has followed, at an incomprehensible scale of civilian violence and death, is devastating. This war so far away feels palpably close to us all and has shaken our community to its core. For us as women, there has been an additional aspect of the attacks on Oct. 7 that has felt like a double assault: the systemic rape of women and girls by Hamas terrorists and the lack of response from the world. Sexual and gender-based violence is horrific, with emotional wounds that linger well beyond the physical wounds. The healing process for the survivors of the Oct. 7 assaults begins with being heard and believed. We cannot overstate the importance of supporting these women, like we would all survivors of sexual and gender-based violence. We recoiled when reading about Shani Louk, a 23-year-old German Israeli, who can be seen in a Hamas-made video, semiconscious and half-naked, being taken to Gaza in the back of a pickup truck with men sitting astride her. Another video shows a woman being led out of a vehicle by heavily armed men, her wrists and ankles sliced open and her jeans bloodied at the crotch. First responders have recounted finding dead Israeli women with unmistakable evidence of rape and mutilation. Our heartbreak is not only that these brutal sexual assaults were perpetrated against these women and girls, but that so many international women’s organizations and leaders remained silent about it for too long. That is why this has felt like a double assault. We ask that all people of goodwill acknowledge this assault, horror and heartbreak. Your bearing witness matters. Speaking in solidarity supports survivors to describe the horrors they endured without fear. When survivors believe they will not be believed or that the crime will be minimized, many will not speak up for fear of retraumatization. Speaking in solidarity, we bring attention to the urgent need to release all hostages still being held in Gaza, including those who endured or witnessed sexual and gender-based crimes — enabling them to receive the vital physical and emotional medical care that they are currently being denied. Speaking in solidarity, we increase pressure on organizations to condemn and sanction the perpetrators, which helps prevent the recurrence of these severe violations of international law and fundamental morality. Related Articles As so many know firsthand, sexual and gender-based violence can be devastating, and the shame lingers well beyond the physical wounds. By speaking in solidarity, we enable the survivors of sexual and gender-based violence and their families — and the families of the victims who did not survive, like Louk — to feel the support they need to help them begin to heal. We can join with grassroots efforts in Israel and elsewhere, such as the , which has launched the Civil Commission on Oct. 7 Crimes by Hamas against Women and Children. This unique and all-too-rare collaboration of international human rights experts and women’s rights organizations was created to gather Oct. 7 testimony, evidence and advocacy and to provide expert advice. This week, the Jewish community celebrated Hanukkah, the Festival of Lights. We are reminded that even a small flame can dispel the darkness. In that spirit, may we come together to kindle flames of hope for the world we all share, and the type of world we hope to create, together.",
        "pubDate": "2023-12-15 13:00:20",
        "image_url": "https://www.eastbaytimes.com/wp-content/uploads/2023/12/sjm-61749966.jpg?w=1400px&strip=all",
        "source_id": "eastbaytimes",
        "source_priority": 17164,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "0ef4d9e687e04d3549473f20654cf3ce",
        "title": "New Selfie Worthy Sculpture Now On Display In Western New York",
        "link": "https://nj1015.com/ixp/11/p/buf-sculpture-canalside/",
        "keywords": [
          "News in New York",
          "buffalo",
          "things to do",
          "public art",
          "Buffalo Buzz"
        ],
        "creator": [
          "Ed Nice"
        ],
        "video_url": null,
        "description": "From Shark Girl to The USS Little Rock, there are tons of great things on the Buffalo Waterfront to check out and now we have another thing to put on the list. Continue reading…",
        "content": "Buffalo and Western New York are known for several things, from football and hockey to its amazing architecture; the Queen City is a great place to live, work, and play. One of the things that we do especially well in the 716 is art and history. Folks may not realize it, but Buffalo has some world-class art right here in Western New York. From art museums like Buffalo AKG Art Museum and Burchfield Penney Art Center to the Buffalo History Museum to all of the public art displays that sprinkle the city, there are tons of great things for you to see and take selfies in front of. One great spot in the area to do just that is down at Canalside in downtown Buffalo. Just steps from the Buffalo River and Lake Erie, you can find all sorts of exciting things to check out. Some of these include sculptures like Shark Girl, the Silent Poets, and statues honoring famous Buffalo sports players like Tim Horton and The French Connection. Thanks to a partnership between the Erie Canal Harbor Development Corporation (ECHDC), Empire State Development, and Visit Buffalo Niagara (VBN), a for us all to enjoy. In a big ceremony last week, officials ECHDC, VBN, and ESD unveiled a new permanent sculpture on Marine Drive, near the intersection with Hanover Street. That new sculpture is called BUF and features three steel 3-D letters—the sculpture stands 5 feet tall, with each letter weighing more than 1,000 pounds. This new sculpture was designed and fabricated by and painted by Buffalo's Nicole Cherry. Buffalonians are proud of their city, so we expect the BUF sculpture at Canalside to quickly become a popular selfie site... We have seen how prominent pieces of public art enhance the millions of dollars Governor Hochul has invested in the waterfront. I encourage families to take their holiday pictures by the new sculpture then head to the ice to say hello to Shark Girl and enjoy some time skating, riding the ice bikes, sipping hot chocolate, and taking in the holiday lights. -Joan Kesner, Erie Canal Harbor Development Corporation Board Chairperson. Several spots in Buffalo are great for selfies; you can see a few more below. Gallery Credit: Charlotte Anne Guernsey via Compass Greater NY LLC",
        "pubDate": "2023-12-15 13:00:11",
        "image_url": "https://townsquare.media/site/11/files/2023/12/attachment-BUF-sculpture-nys-esd.jpg",
        "source_id": "nj1015",
        "source_priority": 9819,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "e09202c473d4b7f049215097a3ddd378",
        "title": "New Shows & Movies To Watch This Weekend: Prime Video’s ‘Reacher’ Season 2 + More",
        "link": "https://decider.com/2023/12/15/best-new-movies-shows-weekend-netflix-hulu-amazon-prime-hbo-december-15-2023/",
        "keywords": null,
        "creator": [
          "mliss1578"
        ],
        "video_url": null,
        "description": "...plus the series finale of The Crown on Netflix, Mark Wahlberg in The Family Plan on Apple TV+ and more!",
        "content": "From the final season of The Crown to the latest Mark Wahlberg action comedy, there’s something new for everyone this week! Not sure which new releases to check out? Let us here at Decider help you figure out what to watch this weekend and where to stream it. The end of Netflix’s The Crown is upon us, and all six of the show’s final episodes are now available to watch. On Prime Video, it’s the return of everyone’s favorite strong and silent type, Jack Reacher, in Reacher . And on Apple TV+, Mark Wahlberg, Michelle Monaghan, and Maggie Q star in The Family Plan about a man (Wahlberg) trying to keep his past as an assassin hidden from his wife and kids. After six seasons, multiple cast changes, and a gamut of emotions, The Crown is coming to an end at Netflix this week. The show, which has been a flagship series for the streamer, has gone from historical drama to tabloid fodder with the newest season focusing on the death of Princess Diana and the rise of Prince William. The final six episodes came out Thursday, December 14. Like the book series that it’s based on, Prime Video’s Reacher plops it’s main character, retired Army officer Jack Reacher (Alan Ritchson), into different crime-filled situations that he has to resolve using his hulking body and interior monologues. Most of the cast for season two is new, save for Ritchson, and Reacher has moved on from Margrave, Georgia to California where he’s trying to solve the mysterious deaths of members of his old Army unit. (This season will be based on Lee Child’s 11th book in his series, Bad Look and Trouble .) The first three episodes of Reacher season 2 are out now, with new episodes airing weekly. If it’s been a minute since you’ve watched a movie about a retired assassin who’s been forced back into the killer lifestyle despite his attempts to be a normal guy, might we suggest The Family Plan , starring Mark Wahlberg? In the Apple TV+ film, Wahlberg stars as Dan Morgan, a married father of three whose identity as a former government assassin has been discovered by an old foe. In an attempt to protect his family, he takes them on a road trip to Las Vegas where he plans to keep them safe, while fending off the enemy who wants him dead. The options above only scratch the surface, so you know that this weekend’s full lineup will have amazing options for what to watch this weekend! For the full breakdown of the best movies and shows to stream now, or if you’re still undecided on what to stream this weekend, then check out the complete list below: As the Crow Flies : Season 2 (TR) *NETFLIX SERIES Married at First Sight : Season 14 The Crown : Season 6 Part 2 (GB) *NETFLIX SERIES Yu Yu Hakusho (JP) *NETFLIX SERIES ​Carol & The End of The World *NETFLIX SERIES Chicken Run: Dawn of the Nugget (GB) *NETFLIX FILM Face to Face with ETA: Conversations with a Terrorist (ES) *NETFLIX DOCUMENTARY Familia (MX) *NETFLIX FILM The Hills : Seasons 3-4 Yoh’ Christmas (ZA) *NETFLIX SERIES The Family Plan A Nurse To Die For : Special Premiere Blue Jean | 2022 Dragons: The Nine Realms : Complete Season 8 *Hulu Original Higher Power | 2018 I Was Possessed : Complete Season 1 Swamp People : Complete Season 14 Top Shot: All-Stars : Complete Season 5 2 Days In New York | 2012 Alan Partridge | 2013 CMA Country Christmas (ABC) Freakonomics | 2010 I Give It A Year | 2013 Lemon | 2017 Results | 2015 Such Brave Girls : Complete Season 1 *Hulu Original The Giver | 2014 The Retirement Plan | 2023 White God | 2014 On the Tee , Season 1B The Giver (2014) Leo Reich: Literally Who Cares?! (HBO Original) Mysteries of the Abandoned , Season 8B (Discovery Channel) The Gilded Age OWN Holiday Movie: The Christmas Detective (OWN) (2023) The National Christmas Tree Lighting** Finestkind premiere Willie Nelson’s 90th Birthday Celebration Concert Special ** Barbara Lee: Speaking Truth to Power Best Sellers Dead Birds Disturbing the Peace Finder’s Fee Finding Steve McQueen It Had to Be You Lawnmower Man 2: Jobe’s War Mad To Be Normal Metroland Mirrors New In Town Nightbreed Power Book III: Raising Kanan : Episode 303 – “OPEN FOR BUSINESS” Purple Violets Rock The Kasbah So Undercover The Cry Of The Owl The Final Cut The Lawnmower Man The Mist The Mothman Prophecies CMA Country Christmas Special A Christmas Star (2021) (Freevee) Night Court : S1-9 (1984) (Freevee) Reacher : S2 (2023) *Prime Video Original Series Liz Kocan is a pop culture writer living in Massachusetts. Her biggest claim to fame is the time she won on the game show Chain Reaction .",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://nypost.com/wp-content/uploads/sites/2/2023/12/WHATS-NEW-DEC-15-2023.jpg?quality=90&strip=all",
        "source_id": "nypost",
        "source_priority": 109,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "c5b62d54b6a244c6746a1014d38344a6",
        "title": "Xi’s visit to Hanoi hasn’t really changed much in the South China Sea",
        "link": "https://thehill.com/opinion/4360919-xis-visit-to-hanoi-hasnt-really-changed-much-in-the-south-china-sea/",
        "keywords": [
          "Opinion"
        ],
        "creator": [
          "Dov S. Zakheim, opinion contributor"
        ],
        "video_url": null,
        "description": "Clearly there are limits to how far China is willing to go in order to foster good relations with its southern neighbor.",
        "content": "Not to be outdone by President Joe Biden’s September trip to Vietnam, Chinese president Xi Jinping paid a much ballyhooed to Hanoi this week. In what the Vietnamese media called “a historic milestone” Xi and his counterpart, Nguyen Phu Trong, General Secretary of the Vietnamese Communist Party, signed 36 agreements on a host of cooperative efforts. As Trong , “Vietnam is willing to work with China to build a Vietnam-China community with a shared future that carries strategic significance [and] comprehensively strengthen cooperation in political, economic, trade, security and non-governmental areas.” Indeed, the two leaders reached agreements that ranged from investments in a rail line connecting the two countries to telecommunications to digital cooperation to upgraded security relations. The latter included plans for joint military patrols in the Gulf of Tonkin in the South China Sea and the establishment of a hotline to address “unexpected incidents arising from fisheries activities at sea.” The plans for increased security cooperation actually are little more than an extension of the “Comprehensive Security Partnership” that the two countries established fifteen years ago. The earlier arrangement did little to ease the tensions in relations between the two historic enemies, who and continued to clash along their border and in the South China Sea throughout the 1980s. Neither the normalizing of relations between Beijing and Hanoi in 1991 nor the “Security Partnership” have prevented China from bullying Vietnam in the South China Sea and continuing to assert its to sovereignty over that entire body of water. In 2014, Beijing provoked a major crisis by moving an oil rig into Vietnamese waters. Three years later, it threatened to use force if Vietnam drilled for oil in the South China Sea. China moved a survey ship into Vietnamese waters in 2019, again causing maritime tensions. Addressing Chinese-Vietnamese friction over the South China Sea, Trong stated that “maritime disputes are only part of Vietnam-China relations, and it is believed that the two sides can properly handle them in the spirit of mutual trust and mutual respect.” Yet the good feeling that Xi sought to generate by his visit did not extend to backing away from what China terms its around the sea. Clearly there are limits to how far China is willing to go in order to foster good relations with its southern neighbor. And those limits will continue to create new opportunities for the United States to strengthen its own increasingly improving relations with Vietnam. In the wake of Biden’s September visit, Vietnam now has a “Comprehensive Strategic Partnership” with the United States to go along with its “Comprehensive Security Partnership,” with China. The twinning of these agreements certainly reflects Hanoi’s efforts to maintain a neutral stance between the two superpowers. Nevertheless, Vietnam remains far more wary of Chinese aggression than of U.S. military presence in the region. Hanoi has increased its purchases of American arms and has hosted American warships, most recently when the aircraft carrier Ronald Reagan, accompanied by guided missile cruisers Antietam and Robert Smalls, to Da Nang in July. The Reagan had visited Vietnam the previous year as well, marking the third American aircraft carrier port call in four years. Washington should continue to have its carriers visit Vietnam annually, if not more frequently. Vietnam has committed itself not to host foreign bases on its territory — one of its so-called For that reason, Hanoi will never allow America to base its forces at . Nevertheless, there is considerable room for upgrading American naval activity in the country. In this regard, the expansion of American military presence in Singapore could serve as a model that Vietnam could follow. In 1990, the United States and Singapore first signed a Memorandum of Understanding that enabled U.S. Navy ships to draw upon the facilities at Changi Naval Base. Subsequent agreements expanded the original arrangement, and the Navy now maintains a logistical command unit in Singapore and rotates Littoral Combat Ships and P-8 aircraft from the island. No doubt Beijing would criticize any effort by Hanoi to enhance its security cooperation with the United States. Still, as long as China violates Vietnamese territorial waters while claiming that they actually belong to the Chinese, Vietnam will have good cause to look to America to buttress its deterrent against its powerful northern neighbor. By pursuing an approach similar to that which has been so successful for Singapore, Hanoi could indeed strengthen its deterrent, while Washington could underscore its long-standing policy of maintaining freedom of navigation in the South China Sea, Chinese objections notwithstanding.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://thehill.com/wp-content/uploads/sites/2/2023/12/GettyImages-1842015374.jpg?w=900",
        "source_id": "thehill",
        "source_priority": 393,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "a734b6a5bbed8fbbe129fc9720fb43c0",
        "title": "Confederation College launching Green Energy Program",
        "link": "https://www.tbnewswatch.com/local-news/confederation-college-launching-green-energy-program-7975388",
        "keywords": null,
        "creator": [
          "Kevin Jeffrey, Local Journalism Initiative Reporter"
        ],
        "video_url": null,
        "description": "The seven-week program begins in January as a part-time evening class. Upon completing the program, participants will get a badge or a micro credential.",
        "content": "Confederation College is doing its part to create a more sustainable future for the next generation of students. Beginning in January, the seven-week Green Energy Micro Credential program will be introduced as a part-time evening class for the very first module titled Net Zero 101 . “We have been talking about a program like this for quite some time,” said Dean John Kantola of the School of Engineering, Technology and Trades at Confederation College. “We have had different technologies embedded or built on the college campus for over a decade. But as things move along [and] time passes, we just haven't had the right opportunity yet to get to where we are today. We are excited that this curriculum being developed can be launched in different capacities and [create] different learning outcomes.” Upon completing the program, the participants will get a badge or a micro credential, which is a digital record of completion. Robyn Gillespie, the manager of applied research and sustainability at the college, noted that students will learn different aspects of green energy. “Specifically in our launch, [students will learn what] net zero is and how to apply that into a real-world setting [while] also understanding carbon and emissions,” Gillespie said Tuesday. “There's some carbon economy pieces [that come] into play [as well as] greenhouse gas emissions scopes. The program is built around working within the facilities at the college and helping to create solutions and understandings that can help us move forward on our goals as well at the college or within a workplace.” Kantola mentioned that analytics has a big role in this venture, adding “We’re excited that our students are sometimes the solutions to many things. If we can utilize their expertise while they're learning here on campus, it doesn't get any better than that.” Other post-secondary institutions have introduced a course similar to this one, but Gillespie notes that the one at Confederation College stands out for many reasons. “We have a northern context which other colleges in Ontario [are] not necessarily providing... We have biomass heating our mainstream building on campus, which is extremely unique in the higher education system. We also have solar, geothermal and wind power as well that we're using; [all of those things are] tied to the Black Pack software that we saw here today that students will have access to within the lab classrooms and certain courses that are being developed,” Gillespie added. The program was launched with a $1.3 million contribution from Natural Resources Canada as well as a two-year pledge of $250,000 from the RBC Foundation through RBC Future Launch.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://www.vmcdn.ca/f/files/tbnewswatch/images/local-news/2023/december/green-energy-program/confederation-college-1.jpg;w=960",
        "source_id": "tbnewswatch",
        "source_priority": 404257,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      },
      {
        "article_id": "cab8ccce5fdbf8bf07aacdea760a23e0",
        "title": "What elite universities — and their critics — get wrong about campus antisemitism",
        "link": "https://www.vox.com/politics/2023/12/15/24001823/antisemitism-college-harvard-penn-mit-free-speech",
        "keywords": null,
        "creator": [
          "Nicole Narea"
        ],
        "video_url": null,
        "description": null,
        "content": "The firestorm over antisemitism on college campuses may be dying down from its hottest point last week, when congressional questioning of three elite university presidents over their institutions’ responses to antisemitism went viral and resulted in one of them losing her job. But the discord has turned into a lingering debate over free speech on campuses, one that has left experts and scholars worried about its potential chilling effect on dialogue, debate, and education at institutions of higher learning. The debate reached a frenzy after the congressional hearing last week that saw lawmakers grilling the presidents of Harvard, MIT, and the University of Pennsylvania, most notably Rep. Elise Stefanik’s (R-NY) line of questioning on whether calls for the “genocide of Jews” would violate their campus codes of conduct. Though all three had repeatedly assured lawmakers that they hold students accountable for conduct that violates their on bullying, harassment, and intimidation during their nearly five-hour testimony, their answers to Stefanik’s question were essentially the same: It depends. That answer was widely deemed unacceptable by (including the ), prominent alumni, and deep-pocketed university donors, one of whom pulled a to Penn in the intense fallout. Former University of Pennsylvania president Elizabeth Magill, after losing the support of the university board, consequently announced her resignation. Harvard president Claudine Gay , but the university board stood behind her on Tuesday and will allow her to remain in her position. Though some politicians had also called for MIT president Sally Kornbluth’s ouster, she was from the outset. Many of the critics wanted a simple “yes” to Stefanik’s question. But the university presidents could not have given that and still upheld their commitments to free speech. “Without getting greater detail as to what the abstract call for genocide would be and what sort of pattern of conduct or behavior it might be a part of, the college presidents were put in a situation in which they could not answer that question with one word,” said Nico Perrino, executive vice president of the Foundation for Individual Rights and Expression, an organization that advocates for free speech. But they also didn’t communicate what they needed to at a moment of heightened tensions. Their first mistake was failing to challenge the assumption inherent in Stefanik’s question: that their students have already unambiguously called for genocide. Vox spoke with multiple scholars at their schools (and others) who have studied antisemitism and the ; all cast doubt on the idea that students have made any genocidal statements. And though there have been a number of instances in which have been used on campuses, . Knowing that their words would be broadcast across the world, the university presidents might have also done more to empathize with the concerns of Jewish students amid a very real . “They would have been able to get to a lot of the issues that are complex and do involve context. The problem is, you can’t start with that,” said Frederick Lawrence, the former president of Brandeis University and a lecturer at Georgetown Law. “You have to start with a statement that you will protect your students and your staff and your faculty and all the people on your campus.” Their failure to do so ignited calls for their ousting in US media coverage for days, sometimes overshadowing even the actual ongoing war in as the death toll there this week. “I think Magill’s resignation and Gay’s troubles, even if partly self-inflicted, will greatly embolden donors and outside activists who seek to suppress all pro- speech on campuses, not only that which occasionally crosses the line into antisemitism,” said Matt Berkman, an assistant professor of Jewish studies at Oberlin College. What’s happening on college campuses and what went down at the hearing That Stefanik may have been misleading in her characterization of students’ statements shouldn’t obscure the fact that incidents of antisemitism are on the rise on college campuses and across the country. The Anti-Defamation League, a mainstream Jewish pro- group and also one of the US’s leading anti-extremism organizations, that there have been 400 antisemitic incidents on college campuses in the two months following October 7, compared to just 33 incidents reported over the same period a year ago. The Department of Education consequently launched an investigation into , including Harvard and Penn. The ADL told Vox that the incidents it recorded included 98 incidents of harassment, nine incidents of assault, and 49 incidents of vandalism. For instance, two Ohio State students were reportedly called a derogatory term, asked if they were Jewish, and when leaving an off-campus bar in November. A Cornell University student is for allegedly threatening violence against Jewish students in an online forum on campus. And Penn recently to the FBI several “vile, disturbing antisemitic emails” threatening violence against the university’s Jewish community. The university presidents acknowledged in their testimony last week that these kinds of incidents are on the rise, including on their own campuses, and that many of their Jewish students are feeling unsafe as a result. Kornbluth, who is herself Jewish, said that “should trouble every one of us deeply.” They outlined their plans to prevent further such incidents, including creating new task forces and student advisory groups with that mission in mind, increasing campus security, and emphasizing education and community-building around how to fight hate of any kind. “Antisemitism, an old, viral, and pernicious evil, has been steadily rising in our society, and these world events have dramatically accelerated that surge,” Magill said. “This is unacceptable.” Those incidents are clear-cut examples of antisemitism. But during the hearing, Stefanik focused on much more contested examples. She repeatedly pressed the university presidents to agree with her that commonly invoked at pro-Palestinian rallies calling for Palestinian liberation ” and are “ .” She eventually asked the that would trip up the university presidents, “Calling for the genocide of Jews, does that constitute bullying or harassment?” in an apparent reference to those chants. Many pro-Israel activists have argued that these chants are indeed direct appeals to the genocide of Jews and the destruction of Israel. But there’s lots of debate about both phrases. Many in the pro-Palestinian camp, for example, , say they merely express a desire for Palestinian statehood and dignity. This all leads to bigger questions about . The ADL’s report cites 244 rallies on college campuses that included “antisemitic rhetoric, expressions of support for terrorism against the state of Israel and/or anti-Zionism.” But as the ADL makes clear, the . While there can be obvious overlap between the two, critics — including leading liberal and left-leaning Jewish organizations — say it’s to equate any form of opposition to Zionism, a diverse pro-Israel political movement, with hatred of Jews. Doing so, critics say, can also mean shielding Israel from justified criticism and even undermining ADL’s wider anti-extremism work. And as a group of Jewish Democrats in the House recently , it also can flatten “ .” Joel Beinin, a professor of Middle East history at Stanford University who has been critical of some , told Vox that is Arabic for “shaking off” and has come to mean “uprising.” have indeed become violent over time, but the word “doesn’t literally or in usage have anything to do with ‘genocide for Jews’ or anything like that,” he said. “From the river to the sea,” like many protest chants, has had many iterations and meanings over the course of the Palestinian national struggle. Some groups who have called for the violent destruction of Israel, like , have used the phrase. But experts previously told , in the US and other countries where there have been pro-Palestinian protests and calls for ceasefire, the phrase can mean something entirely different. There it might often be a joyous call “for the dignity and full civil rights of Palestinians in their homeland.” It “does not literally mean ‘genocide for Jews,’” Beinin said, noting that the original platform of Israel’s ruling Likud party also demands that “Between the sea and the Jordan there will only be Israeli sovereignty.” “So anyone who thinks it means genocide for Jews if Palestinians say it has to acknowledge that it means genocide for the Palestinians when Likudniks (and those further right) say it,” he said. All of this is to say that references to “intifada” and “from the river to the sea” are far from clear calls to enact genocide against Jews, as Stefanik argued in the hearing. As one Harvard professor who asked not to be identified given the current campus climate told me, “There have been no clear calls for the genocide of Jews at Harvard and I doubt there have been at MIT or the University of Pennsylvania either.” Ultimately, that meant Stefanik’s viral question was just a “red herring,” the professor said, and the university presidents should have acknowledged as much. To the extent that pro-Israel and pro-Palestinian students misunderstand each other on this issue, it is up to universities to “help bridge these gaps by creating supportive environments where students can clarify their meanings and intentions with civility, rather than assuming the absolute worst about one another,” Berkman said. “If they did this, I think you’d find that the overwhelming majority of pro-Palestinian students are not calling for genocide, even if they do call for political outcomes that most supporters of Israel would reject as unacceptable,” he added. “That sort of clarification would in turn help address the anxieties that some Jewish students feel when they encounter pro-Palestinian activism on campus.” However, the university presidents were not just unwilling to challenge Stefanik’s characterization of pro-Palestinian rhetoric as genocidal, but Gay and Magill seemed to support it during the hearing. Gay said that she had heard “thoughtless, reckless, and hateful language” such as “from the river to the sea” and “intifada” on Harvard’s campus and found it “ .” Magill said that calls for global intifada were “very disturbing” and were “at a minimum, hateful speech.” At the same time, all three presidents refused to say that students should be punished for invoking those phrases across the board — only when it rises to the level of harassment, discrimination, or incitement to violence. “I have little doubt that if student activists actually were issuing unequivocal calls for the genocide of Jews on university campuses, they would be swiftly disciplined by their administrations — and rightly so,” Berkman said. “This should have been an easy question for Magill, Kornbluth, and Gay to answer, but because they felt they couldn’t contest the description of pro-Palestinian rhetoric as inherently genocidal, despite knowing that description to be untrue, they ended up looking foolish.” The political motivations at play in the controversy Internal discord at elite institutions and bipartisan doubt about the sanctity of higher education was the outcome that Stefanik and her Republican colleagues wanted — but not because they’re any great defenders of Jews. Stefanik has echoed the that Jews have pushed immigration and multiculturalism as a means of amassing political power over white Americans: In a 2021 campaign ad, she railed against what she characterized as Democrats’ plan to “overthrow our current electorate” by allowing undocumented immigrants to enter the country, leading to . She also continues to uncritically support former , who has associated with including Nick Fuentes and Kanye West. And she and the rest of her party rely on evangelical voters, some of whom await what they believe is the prophesized day when nonbelievers in Jesus, including Jews, will be . So while some Democrats found themselves despite disagreeing with her on practically every other issue, Rep. Jamie Raskin (D-MD) reminded them of the absurdity of doing so. “The Republican Party is filled with people who are entangled with antisemitism like that and yet somehow she gets on [her] high horse and lectures a Jewish college president from MIT,” he said during a recent interview on . Stefanik went into the hearing looking for a “gotcha” moment. As she later boasted to the , she had designed her line of questioning in “such a way that the answer is an easy yes” and all three university presidents “blew it” in what she predicted would become the “most viewed congressional testimony in history.” While it’s not clear if that has come to pass, videos of the hearing have gotten to of thousands of views. Stefanik has a complicated history with Harvard in particular. When the Harvard Institute of Politics ousted Stefanik, a Harvard alumnus herself, for supporting Trump’s claims of a stolen , she called it a decision to “ .” Politically, she had every reason to make the university presidents look bad. They represent the same institutions whose perceived liberal excesses her party railed against for years. Her questions were part of Republicans’ long-running war on higher education that has included ending in college admissions, thwarting Biden’s forgiveness plan, and cracking down on the teaching of “critical race theory,” as well as proposals to , end the , and eliminate universities’ . Other GOP lawmakers made the connection explicit during the hearing. Rep. Virginia Foxx (R-NC) used her question time to rail against Harvard coursework and seminars focusing on racism and social justice, which she said fosters a culture in which “you have faculty and students who hate Jews, hate Israel, and are comfortable apologizing for terror.” Republicans see political opportunity there. As GOP pollster Robert Cahaly recently , the party may be able to paint the pro-Palestinian views of young people as the “price for having the next generation taught a bunch of nonsense.” Rep. Joe Wilson (R-SC) lamented during his question time in the hearing, “I think this [hearing] is so sadly and shamefully revealing that there’s no diversity, inclusion of intellectual thought,” meaning the teaching of conservative ideology on college campuses. “And the result of that is antisemitism.” It’s an idea that has proved resonant with their base. Only 19 percent of Republicans said in a that they have “a great deal” or “quite a lot” of confidence in higher education. Republicans have also sought to use the issue of antisemitism — both on campus and in the country more broadly — to turn the tables on Democrats, who have sought to highlight the extremism of the MAGA movement under Trump. After right-wing white supremacists chanted “ ” at a rally in Charlottesville in 2017, Democrats accused Republicans of failing to reckon with extremism and antisemitism in their own ranks. Now, Republicans feel that they have the opportunity to say the same of Democrats, while simultaneously working to weaponize real Jewish fear and make themselves look like the party most willing to keep Jewish people safe, on college campuses and everywhere else. Last week’s hearing proved an opportunity to flex that strategy. What this means for college campuses and broader discourse on the war So, where does all of this leave universities and the acrimonious discourse over the war in Gaza playing out on their campuses? Lawrence, the former Brandeis president, worries that the backlash to the university presidents’ testimony could further erode trust in higher education, which was among all Americans. “What I fear is that this enrages more people about higher education. They feel higher education is out of touch on issues that they care about. That would be a terrible outcome,” he said. It could also cause universities to roll back their commitments to free speech, which they see as essential to how they approach education. “I think that there is a concern at any particular moment of heightened fear that that could be an overreaction,” Lawrence said. In dealing with the current environment, he says that universities should approach incendiary speech on their campuses as falling into three buckets, the first being a small number of “genuine, bona fide threats of violence and threatening behavior” that would warrant punishment or even referrals to the criminal system, such as the recent incident in which a Cornell student was charged. The second is speech that is protected by the First Amendment but that is sufficiently problematic that the university should make a very clear statement about why it is contrary to the values of the university. For example, Yale president Peter Salovey recently that “Chants or messages that express hatred, celebrate the killing of civilians, or contain calls for genocide of any group are utterly against our ideals and certainly are not characteristic of our broader community.” Those kind of statements “do have an impact on the campus community,” Lawrence said. The third, which Lawrence said is the “largest by far of all the forms of expression,” is the kind of speech that, whether smart or based on naivete or ignorance, should always be met with education. “So a school like the University of Pennsylvania, for example — which has outstanding faculty in international relations and social psychology and a whole set of related fields — ought to be putting on programs throughout campus, open sessions, town hall meetings, webinars, all the different ways in which we educate students.” But even in this framework, universities may have to permit students to engage in speech that many would find abhorrent — potentially including, as the university presidents sought to acknowledge in their testimony, abstract calls for genocide, Perrino, the free speech advocate from FIRE, argued. “There may be some circumstances where an abstract call for genocide is part of a pattern of behavior that meets the legal standards for peer-on-peer discriminatory harassment,” Perrino said, noting that such speech is not protected by the First Amendment and would warrant that a university take action against it. But there are other situations, he argued, where a call for genocide might constitute protected speech. He cited one 2018 case in which a Drexel University professor was investigated for tweeting, “ .” On its face, that was a call for genocide. “But context does matter. He was making a joke about white nationalists’ theory of white replacement theory. He was a white guy. The tweet wasn’t targeted at anyone. It was simply satire,” Perrino said. That’s why free speech advocates like Perrino have advocated against universities implementing speech codes, which he says would be “wielded by those in power arbitrarily and in a political way” — including potentially against those they were originally designed to protect. “If the allegation is that all these college administrators are enabling antisemitism, do you really want to give those same college administrators the power to wield a broad speech code?” he asked. However, that hasn’t stopped the board of Penn’s Wharton business school from to the university code of conduct that go beyond existing university policies and include prohibitions on “language that threatens the physical safety of community members” and “hate speech, whether veiled or explicit, that incites violence.” Supporters of the changes have argued for a fundamental recalibration of private universities’ approach to free speech: Penn law and philosophy professor Claire Finkelstein, for instance, in the Washington Post arguing that universities should “rethink the role that open expression and academic freedom play in the educational mission” in order to protect their students. But critics of such speech codes — such as , the director of free expression and education programs at the free speech advocacy organization PEN America — warn that the “vague” provisions proposed by the Wharton board threaten to “ban wide swaths of speech.” Perrino argued that if anything will prevent genocide, it is the protection of individual rights including free speech. “The erosion of individual rights is necessary to allow the sort of horrors that the people who are calling for more speech codes fear. So it’s very short-sighted to erode civil liberties,” he said. That’s especially the case when the humanitarian situation in Gaza is becoming more dire every day — a subject that has been given short shrift while Americans have focused on debating how they should be allowed to talk about it.",
        "pubDate": "2023-12-15 13:00:00",
        "image_url": "https://cdn.vox-cdn.com/thumbor/ELbRPuIUxHPIsSdXxawpJs0EMyw=/0x0:4625x3469/1310x983/cdn.vox-cdn.com/uploads/chorus_image/image/72965719/1833206910.0.jpg",
        "source_id": "vox",
        "source_priority": 889,
        "country": [
          "united states of america"
        ],
        "category": [
          "top"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702645200012835457"
  }