{
    "status": "success",
    "totalResults": 15,
    "results": [
      {
        "article_id": "a0469f803a80dea8175e579ad275f345",
        "title": "Readers’ favourite travel discoveries of 2023",
        "link": "https://www.theguardian.com/travel/2023/dec/15/readers-favourite-travel-discoveries-of-2023",
        "keywords": [
          "Travel",
          "Top 10s"
        ],
        "creator": [
          "Guardian readers"
        ],
        "video_url": null,
        "description": "From a Finnish archipelago to a tranquil lake in Albania, our tipsters have unearthed beautiful beaches, lively cities and wild, atmospheric placesFans of Finnish author Tove Jansson will love the idyllic Pellinki archipelago, where she spent her summers on a tiny island, Klovharun, described in several of her novels. About 50 miles east of Helsinki, Pellinki forms part of a group of islands, linked by bridges and a delightful ferry, which you can explore by boat, car, bicycle, bus or on foot. Walk through the woods to reach one of the quiet beaches, hire a boat to fish or just tootle around the beautiful bays and stay in a traditional, wooden cottage with a matching sauna set among the trees where the only sounds you’ll hear are birdsong and the gentle putter of a small boat passing by. Finnish people know a lot about the importance of connecting with nature and this is a place where you will quickly find yourself reflecting on what really matters in life. Christine Continue reading...",
        "content": "Tove Jansson’s island life, Finland Fans of Finnish author Tove Jansson will love the idyllic Pellinki archipelago, where she spent her summers on a tiny island, Klovharun, described in several of her novels. About 50 miles east of Helsinki, Pellinki forms part of a group of islands, linked by bridges and a delightful ferry, which you can explore by boat, car, bicycle, bus or on foot. Walk through the woods to reach one of the quiet beaches, hire a boat to fish or just tootle around the beautiful bays and stay in a traditional, wooden cottage with a matching sauna set among the trees where the only sounds you’ll hear are birdsong and the gentle putter of a small boat passing by. Finnish people know a lot about the importance of connecting with nature and this is a place where you will quickly find yourself reflecting on what really matters in life. Christine Sounds and sights of Lake Ohrid, Albania Lake Ohrid, eastern Albania. Photograph: Westend61/Getty Images Our summer 2023 trip took us on a tour of Albania. We loved Tirana and its lively drivers, Berat bewitched us, historical Gjirokaster entranced us and we chilled out by the beach in Himarë. But it was tiny Lin in the Korçë region, eastern Albania, perhaps the oldest inhabited settlement in Europe, dating back to 6,000 BC, that totally captured our hearts. Our accommodation on the shores of Lake Ohrid offered amazing views across to North Macedonia. Delicious homecooked meals, including the tasty local Ohrid brown trout caught by the owner, were served on the terrace overlooking the lake where we were serenaded by a noisy frog chorus. Lisa J Profile Readers' tips: send a tip for a chance to win a £200 voucher for a Coolstays break Show Guardian Travel readers' tips Every week we ask our readers for recommendations from their travels. A selection of tips will be featured online and may appear in print. To enter the latest competition visit the readers' tips homepage - Was this helpful? Thank you for your feedback. Young and inclusive, Wrocław There is plenty of scope for boat trips on the rivers and canals of Wrocław. Photograph: ewg3D/Getty Images Wrocław is an underrated city, a place to be immersed in river boat trips, £1.30 pints, chimney cakes and cobbled streets. The cathedrals are stunning, the people are warm and kind and it’s just about within day-trip range of the beautifully preserved German town of Görlitz. As a centre of academia in Poland, it has plenty of inclusive, youth-friendly bars and shops, and for far less money than in France, Belgium or Germany you can enjoy a truly authentic European long weekend. Aaron Every day in Georgia we ate bread filled with oozing cheese An adjaruli khachapuri (cheese-filled bread) Photograph: Radist/Getty Images Khachapuri , bread filled with oozing, melted cheese, was so irresistible, cheap and ubiquitous, I ate it every day for two weeks in Georgia with each regional variation evoking travel memories. Breakfast in Tbilisi was warm imeruli khachapuri , stuffed with sour, salty Imeretian cheese ; while a version full of cheese and nettles warmed the soul on a dreary night in the Kazbegi mountains. In the Samegrelo-Zemo Svaneti region of western Georgia, we had megruli khachapuri , with sulguni cheese in the middle and on top, which was like pizza on speed. But we saved the best for the Black Sea resort Batumi: adjaruli , an iconic canoe-shaped bread, full of cheese swimming in butter. Lovely! Helen Jackson Sea, surf, rock arches and beer, Galicia, Spain Catedrais beach. Photograph: Luna Marina/Getty Images Head to As Catedrais beach (Cathedral beach) in Galicia, north-west Spain, for incredible rock formations and turquoise waters. It takes its name from the huge arches which resemble the flying buttresses of a cathedral. During high tide the formations are hidden, but as the tide subsides beautiful arches and caves are revealed. Exploring these and sploshing through the beautifully clear water is pure pleasure. When you’re done exploring there is a cafe on the cliff top serving cold beers with views of the sea and surf below. Laura Tipple in the taverna, Volos, Greece Dishes at a Volos taverna. Photograph: Wirestock, Inc./Alamy Volos is a city in eastern Greece that many pass through en route to the Sporades islands, but we stayed a bit longer and discovered the culture of tsipouradika . Order a small bottle of tsipouro (a wine-based spirit), and a meze or two will come with it. If there are two of you, you get double; four and they quadruple it – it’s a social thing. The first meze are basic: aubergine salad, cured fish. Then the more you drink, the better they get: grilled sea bream, scallops. There are no menus, but as it’s a fishing city, seafood dominates. With hundreds of tsipouradika tavernas throughout Volos, it’s an integral part of local life and one I’m glad to have discovered. Alice skip past newsletter promotion Sign up to The Traveller Free newsletter Get travel inspiration, featured trips and local tips for your next break, as well as the latest deals from Guardian Holidays Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Incredible atmosphere, Essex by the Thames Thames View campsite, East Tilbury Thames View in East Tilbury is an eco-conscious, no-frills campsite and a perfect weekend escape, with a firepit and table on each generous pitch. It’s right on the Thames Estuary path. There’s a second world war battery next door, and Coalhouse Fort is at the end of the road. For a real sense of the edge of things, walk up the path to Tilbury Fort just after high tide; it’s lonely, desolate and incredibly atmospheric. This is where Elizabeth I rallied her army nearby to face the threat of the Armada in 1588. It’s a half-mile walk to the jetty for the ferry to Gravesend here. At the other end of East Tilbury is the old Bata estate , a modernist masterpiece best explored by bike. Tim Smith Canny meandering, Essaouira, Morocco Fruit and veg on sale in Essaouira. Photograph: Grant Rooney/Alamy The Essaouira Sunday souq on Avenue Moulay Hicham is an un-Googleable paradise of organic produce. Our landlady showed us the way, cannily meandering, pausing to ask a price, split open a pea pod, exchange gossip. Essaouira, best known for surf and seafood, is also ridiculously fertile. November and December are best, when all the key Moroccan ingredients are at their peak. A truckload of corn in their husks? Thick bunches of wormwood? Artichokes, their stalks intact for soup making? One step back from the coast, the Essaouira land was brought to us, and it was delicious. Rachel Hobley Tranquil swimming spot, Lake District Wasdale’s Emerald Pool. Photograph: Laurie Crayston In July we found the tranquil and secluded Wasdale Emerald Pool . We were the only people there. The double waterfall is framed by the 899-metre peak of Great Gable, and looks out to the Wasdale valley below. After an invigorating dip we headed back to our timber cabin in Irton near Ravenglass and watched a thunderstorm from the half-moon window. Rachel Donnison Winning tip: Cycling and refuelling on the Hebridean Way Crust, Lewis In August we cycled the 184-mile Hebridean Way from Vatersay to the Butt of Lewis. Our best discovery? The food! We enjoyed fudgy brownies from Ardmhor Coffee while waiting at Barra ferry terminal. A day later we arrived, soaked to the skin, at the Hebridean Jewellery Cafe on South Uist and had the best brie and cauliflower soup ever. We ate, overlooking the beach, at the Wee Cottage Kitchen trailer on North Uist; my partner loved his scallop and black pudding roll. And on Lewis we hunkered down beside a blue shipping container, sheltering from the wind, with yummy Neapolitan pizza from Crust . Christine",
        "pubDate": "2023-12-15 07:00:21",
        "image_url": "https://i.guim.co.uk/img/media/fb9738597a73f1edcd0c21b4666a685edf054f3c/0_169_5161_3096/master/5161.jpg?width=140&quality=85&auto=format&fit=max&s=3497a2b8f1f68079b42d8d280ff1aebe",
        "source_id": "theguardian",
        "source_priority": 106,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      },
      {
        "article_id": "c41c3c53a524eced03811d899ccb51b2",
        "title": "Amtrak train crashes into big rig, closing Calif. freeway temporarily",
        "link": "https://www.sfgate.com/travel/article/amtrak-train-crashes-big-rig-closing-calif-18554909.php",
        "keywords": null,
        "creator": [
          "Olivia Harden"
        ],
        "video_url": null,
        "description": "The train was traveling to San Diego when it smashed into a big rig.",
        "content": "Amtrak Pacific Surfliner train 790 travels between Goleta and San Diego. An traveling to San Diego crashed into a big rig on Dec. 12, around 6:20 p.m. The Pacific Surfliner train crashed into an “unoccupied tractor-trailer” near Camarillo, Calif., Amtrak told SFGATE in a statement. The accident occurred along state Route 118, according to a tweet from California Highway Patrol Moorpark. There were 95 passengers and five employees on board. Advertisement Article continues below this ad The first car of the six-car train was derailed but remained upright. Five people were injured with mild to moderate injuries, and four were transported to the hospital, a spokesperson for the Ventura County Fire Department told SFGATE. “The big rig driver was making a turn at the rail crossing when the truck apparently became stuck on the tracks,” according to . State Route 118 between Balcom Canyon Road and state Route 34 (Somis Road) were closed for cleanup and repairs, according to CHP Moorpark. Drivers were directed to take alternate routes until it reopened Wednesday morning. Amtrak’s Pacific Surfliner typically travels from San Luis Obispo with 26 stops before reaching San Diego; due to , the train involved in this crash operates daily from Goleta (near Santa Barbara) to San Diego. The Pacific Surfliner is Amtrak’s , behind the Northeast Corridor. Advertisement Article continues below this ad Following the crash, the railway company said, it provided passengers with alternate forms of transportation to their destinations. | | | |",
        "pubDate": "2023-12-15 00:31:18",
        "image_url": null,
        "source_id": "sfgate",
        "source_priority": 1360,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      },
      {
        "article_id": "4a4cf50a87aad2d26ad256ef08d91c19",
        "title": "Inside L.A.'s hidden equestrian oasis, you can ride a horse to the neighborhood coffee shop",
        "link": "https://www.latimes.com/travel/newsletter/2023-12-14/exploring-burbank-rancho-district-the-wild",
        "keywords": null,
        "creator": null,
        "video_url": null,
        "description": "Tucked between Walt Disney Studios and Griffith Park, the Burbank Rancho Equestrian District bridges the horse lifestyle and city living.",
        "content": "A spritely woman leading a white horse waves at me from a perfectly suburban street corner in Burbank looking like an ethereal ghost of rodeos past. Instantly, I know it’s Tarrah Barbour, who invited me to visit an equestrian neighborhood tucked in a far-from-rural nook between Walt Disney Studios and Griffith Park. I look up and down the quiet, leafy street just an exhale away from the thumping heartbeat of the San Fernando Valley and wonder where on earth even one horse could be kept. Barbour, 44, buzzing with energy despite rising in the early hours to tend to horses, introduces me to her horse Kota and then leads me around the corner. A parallel rustic world emerges: past a cherry red Chevy pickup truck and horse trailer is the entrance to stables. There I meet Hector Aguilar, who proudly recounts riding USC’s mascot , a horse named Traveler — and whips out a June 2014 copy of The Times featuring a photo of him atop the regal creature to prove it. Sheena Graves , a Hollywood horse wrangler, mills around in serious-looking leather boots. For many residents of the Burbank Rancho Equestrian District, as well as the adjacent Riverside Rancho in Glendale, life revolves around their equine charges. Even with hired help, taking care of the graceful but massive creatures requires investment — of time, money and heart. Karen Thornton, a Burbank Rancho resident with a small gaggle of farm animals, including a horse and a pony, told me that being a horse person leaves virtually no time for other hobbies. Taking vacations is tough. “It’s more of a lifestyle,” she said. For some, it’s a dream come true. “Every morning I wake up and I feel like I’m an 8-year-old girl,” Barbour told me, eyes shining behind oversize circular sunglasses. By the time Barbour starts work (as an advertising producer) at 9:30 a.m., she’s typically exercised three horses. Perhaps a gallop at Griffith Park or lunging — driving a horse around a circle on a rope — in a patch of land called the Pollywog . She checks on the animals at 6 p.m. and then again by 11 p.m. and relies on twice-daily visits by Jose Alberto Lomeli, 80, who, for a half-century, has cared for horses in the area. “Rain, shine, earthquake, every single day — now 24 years without a day off,” Lomeli said. Film studios and equestrians in the area have long enjoyed a symbiotic relationship. Just as the first movie production companies moved into Burbank in the 1920 s, large farms and ranches sprang up. By the 1940s, those expansive lots were subdivided into small homes, many with horse stalls in the back. That proximity became an asset when horses, and someone to handle them, were needed on set. (Horse celebrity Mr. Ed once lived there, USC’s mascot still does.) Most of my horseback riding experience dates back to toddlerhood when my parents took me to the now-closed Griffith Park Pony Rides . But alongside Barbour I feel at ease astride a gentle brown steed named Charlie. We depart from Studio Horse Rental — the only remaining horse rental facility in Burbank — and make our way across the Mariposa Bridge over the L.A. River that connects Burbank to more than 4,000 acres of land in Griffith Park. Ten of us, five riders and five horses, pass under the 134 Freeway and past the Martinez Arena , a first-come, first-served public equestrian area. Eventually, we veer away from concrete and plod along a dirt trail through the trees. I feel comfortable as we saunter along the path — even when the horses switch from a slow walk to a trot. As the pace momentarily quickens, a sense of freedom surges up. Atop the strong, graceful creature, I absorb some of its power. I become conscious of how tall I’ve grown. The allure of horse life clicks. How to get your horse on in the city Barbour says she sometimes rides to Basecamp , a local coffee shop, for a morning cup of joe. So consider that a good starting point. Those who want to experience what it’s like to meander on horseback can book a guided trail ride at one of the local rental facilities. Studio Horse Rental located near the horse bridge on Mariposa Street is open seven days a week from 8 a.m. to 4 p.m. and welcomes riders of all skill levels. My one-hour ride through Griffith Park cost $50. Another option is L.A. Horse Rentals , a stone’s throw away in Glendale. Rides between 30 minutes and 1.5 hours are offered daily, with prices ranging from $30 to $75. Longer trail rides can be booked on weekends. If you’re interested in mastering the ropes (and reins as it were), consider taking a lesson. Studio Horse Rental offers them. When dismounting from my ride, I met trainer Lorie Martan, whom my Rancho companions praised for her gifted ways of working with children. L.A. Equestrian Center hosts trainers specializing in an array of training styles. Details are available at thelaec.com . Traditional Equitation School , located in the center, bills itself as the oldest horseback riding school in L.A. Prices start at $93.50 for a single lesson. Experienced riders are welcome to haul over their horse for a day in Griffith, a lunge in the Pollywog or a roll in Martinez Arena. Boarding is available at the Equestrian Center. Food and equipment can be purchased at Damoor’s or Trickee Tack, located on the same lot as L.A. Horse Rentals. And, if you need any leather repairs, hoof it over to A&M Leather Shop, run by Lomeli and his longtime business partner Miguel Angel Garcia and located behind Border Brothers Dry Cleaners & Laundry . 1. Walk — or run — past holiday lights. Ever since I was a teenager, I’ve loved to jog the streets of L.A. as a means to explore neighborhoods. The time between Halloween and Christmas is a particularly great time to do this because you get the seasonal benefit of taking in holiday lights and festive facades. The lights also literally brighten up an evening foray. Walking is perfectly acceptable, but a quicker clip allows you to cover more ground. Need some inspo? My colleague Jeanette Marantos compiled this list of 30 dazzling light displays across Southern California. 2. Experience a winter wonderland at a park near you. Through Dec. 16, dozens of L.A. County parks will be transformed into winterscapes complete with 40 to 80 tons of snow for sledding and playing. Free and open to all ages, the Parks After Dark: Winter Wonderland events will also feature family- and teen-friendly crafts, hot cocoa and snacks, carnival games, toy giveaways, holiday music and more. Hosted by L.A. County Parks and Recreation, the events will be held Fridays and Saturdays from either noon to 4 p.m. or 4 to 8 p.m A full list of parks and their event times is available at parks.lacounty.gov . 3. Get merry on a guided Griffith Park hike. On Dec. 16, naturalist Jason Wise will lead a group on a one-mile hike to celebrate the native fauna in our backyard with a crafty wintertime twist. Participants will forage mistletoe to transform into a decoration, learn about the native California holly and craft ornaments from pine cones. Warm cider, craft supplies and hiking lessons will be provided on the two-hour experience running from noon to 2 p.m. Hosting the hike is Usal Outdoor Research Center, a community hub and store geared toward the “modern nature enthusiast.” Tickets are $30. Details and booking at usalproject.com . Three men, two ropes and one sleeping bag. Those were the essential — and notably minimal — ingredients for a celebrated recent ascent of the north face of dizzyingly sheer Mount Jannu in the Himalayas. Some have summited the daunting peak, but none have done this particularly challenging route in the light alpine style employed by a trio of Americans who successfully reached the 25,295-foot summit on Oct. 12, John Branch explains in a recent piece for the New York Times . Alan Rousseau, Matt Cornell and Jackson Marvell tackled the summit — notorious for its height, steepness and remote locale — without supplemental oxygen, fixed ropes or the help of porters beyond base camp. Top alpinists have lauded the feat as one of the most significant in climbing, exceeding the difficulty of scaling Everest. Besides its impressive athleticism, the climb represents a hopeful alternative to navigating crowds that have improbably become common on Everest and other behemoths. Happy adventuring, Every month, local gallerist Lauren Powell leads a procession of art lovers up a steep trail to a pine tree grove overlooking the L.A. Basin. Besides trail snacks and water bottles, the crew hauls up art, thereby freeing it from the potentially exclusionary gallery space. “I would say this is a pilgrimage to bring the gallery outside of the four walls to the public,” Powell told my colleague Deborah Vankin, who chronicled the recurring ritual . On a recent trek, a group of roughly 30, decked out in primarily sunset-hued threads, carried hulking paintings by Senon Williams, giving off what Vankin described as “a Burning Man -meets- Sierra Club vibe.” Once they reached an area adjacent to the iconic Griffith Observatory, they installed the works for a temporary open-air exhibit. As the sun set, the paintings appeared to dissolve against the golden backdrop. The hikes are free and open to the public, with the next one scheduled for Dec. 17. For more insider tips on Southern California’s beaches, trails and parks, check out past editions of The Wild . And to view this newsletter in your browser, click here .",
        "pubDate": "2023-12-14 19:00:32",
        "image_url": null,
        "source_id": "latimes",
        "source_priority": 267,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      },
      {
        "article_id": "b065a2fcfac9863e003e97d07f8ce3bf",
        "title": "‘The American dream is to leave America.’ The US TikTokers revealing what life is like abroad",
        "link": "https://www.mercurynews.com/2023/12/14/the-american-dream-is-to-leave-america-the-us-tiktokers-revealing-what-life-is-like-abroad/",
        "keywords": [
          "California News",
          "Features",
          "Latest Headlines",
          "Lifestyle",
          "National News",
          "News",
          "Things To Do",
          "Travel",
          "World News",
          "Asia Travel",
          "Europe Travel",
          "Morning Wire",
          "Social Media"
        ],
        "creator": [
          "Cnn.Com Wire Service"
        ],
        "video_url": null,
        "description": "These Americans abroad seem to be living the dream and thanks to their streams of content, TikTok users can follow along and live vicariously through them.",
        "content": "A month’s paid vacation time. Wine at lunchtime on a Tuesday. No tipping needed. In Kacie Rose Burns’ most , the influencer runs through some of the biggest culture shocks she’s experienced since upping sticks from the US to Italy. Burns’ TikTok – viewed 19.8 million times – is flooded with comments ranging from disbelief, envy and approval. There’s one comment – liked 34,800 times – that maybe sums it all up: “I think the American dream is to leave America.” Burns’ social media accounts chronicle her experiences as, according to her TikTok bio, “that American girl living in Italy.” She details cultural differences, offers guides to Italian cities and speaks directly to the camera about her experiences. The 30-year-old started posting on TikTok in 2021 when she moved to Florence with her Italian boyfriend, who she In early 2021, international travel was off the table. Burns’ videos quickly gained traction thanks to her mix of escapist content, wish fulfillment fantasy and funny-yet-insightful takes on the realities of moving abroad. Cut to today and Burns has 1 million TikTok followers. Fans approach her on the street and act like they know her. She’s leveraged her success into a brand, complete with ebooks and group tours. Chronicling her life in Italy is now her full time job. It’s a career move that Burns, a former New York dancer, says was entirely accidental. The success has taken her by surprise. But Burns isn’t alone. In recent years – as TikTok has ballooned in popularity and Instagram has embraced short-form video content in the shape of Instagram Reels – the American influencer abroad has become an omnipresent figure. No matter your algorithm, if you’re active on these platforms it’s likely you’ve seen a video or two along these lines. Maybe an influencer wandering around a UK grocery store, commenting on how bizarre it is that British stores don’t store eggs in the refrigerator, or someone chronicling their attempts to learn French while in situ in Paris, or showing the incredible views from their red-roofed Lisbon apartment. For American social media user Elizabeth Staub, 31, watching TikTokers who’ve moved abroad is appealing partly because their content feels “like an easy daydream” or “escape.” But it’s a fantasy that’s “also kind of attainable,” as Staub puts it to . These people might seem to have a day-to-day that’s straight out of a Netflix romantic comedy, but they’re real people. And for Staub, it’s this reality that makes it easy to insert herself in their shoes – at least for the few minutes it takes to watch one of their videos. “I really enjoy seeing the differences between our country and wherever these influencers are, and romanticizing what it would be like to live there,” says Staub. “I follow people who live in places I’d want to live,” agrees Boston-based social media user Erin Conry, 26. It feels like a dopamine hit, Conry tells CNN Travel, every time she sees “these aesthetically pleasing travel videos.” These Americans abroad seem to be living the dream and thanks to their streams of content, TikTok users can follow along and live vicariously through them. Many of the most popular videos from US content creators abroad hinge on the little details. Take Quentin Pettiford’s social media presence. Pettiford, 24, moved from the US to Norway in 2021. Like Burns, he emigrated after falling in love with a European, and like Burns, people love hearing about his transatlantic love story – but if his TikTok stats are anything to go by, they’d rather hear his thoughts on the differences between Norwegian and American grocery stores. Pettiford gets it. The first time he walked the aisles of a Norwegian grocery store, he was entranced. For his Norwegian partner, the experience was mundane – boring, even – but for Pettiford, the store was a treasure trove of intriguing cultural differences. He was baffled by the bread slicers, something he’d never seen in an American grocery store. He soon learned that when you leave certain stores in Norway, you have to scan your receipt in order to open the doors. “Everything about the grocery stores here in Norway is just so different,” Pettiford tells CNN Travel. Pettiford immediately started filming clips and posting on his . “I knew that if the right people saw it, they’d be interested and it would go viral,” he says. Sure enough, one day Pettiford opened the TikTok app to thousands of comments, views and follows. “It got two million views in a couple of weeks,” says Pettiford of his first viral video. “I was like, ‘You know what, I’m not going to let this opportunity slip.” Pettiford dove head on into content creation. Today, he intersperses funny commentary on cultural differences with glimpses into his day-to-day family life with his Norwegian wife and their young daughter. His followers seem to enjoy that family content, says Pettiford, but his most popular video isn’t particularly personal at all – it’s “me talking about how Americans use Fahrenheit, and how the rest of the world uses Celsius.” “That got, like, 8 million views,” says Pettiford, sounding disbelieving. “Little things like that, people go crazy for. So I just kind of sit back, reflect on what’s different, write it in my notes and then talk about it and see if it goes viral.” Burns and Pettiford both started posting during the pandemic – partly because they found themselves with more time on their hands and partly because that’s just when they happened to move abroad. But thirtysomething Fatima, an American content creator who runs the TikTok , had lived in Paris for several years before she started posting publicly about her life in early 2021. Like former dancer Burns, Fatima worked in the performing arts industry pre-2020 and found herself turning to social media as a “different way to be creative” when Covid hit. Fatima, who has requested her last name not be included in this article for personal reasons, was also inspired to start posting publicly in the wake of the Netflix hit “Emily in Paris.” The much talked about TV show tracks a fictional American social media influencer who moves to a version of Paris that bears little resemblance to the city’s reality, but which quickly enamored locked-down-viewers when the show landed on Netflix in late 2020. Fatima watched – and enjoyed – “Emily in Paris.” But seeing the show’s success also prompted her desire to show a more realistic view of the “American in Paris” tale. It’s a tale, Fatima acknowledges, that is, if not as old as time, certainly pretty old – she recalls watching the 2014 Broadway musical “An American in Paris,” based on the 1950s movie, the week before she moved to France. The pop culture trope of an American moving to Europe and living a charmed life also extends beyond Paris and predates the 21st century – think 1954’s Rome-set “Three Coins in the Fountain.” For millennial Fatima, it was the 2003 “Lizzie McGuire Movie” – in which American teen Lizzie takes a trip to Italy and is accidentally mistaken for a pop star – that first had her dreaming about moving to Europe. “That movie is very iconic for me, very important,” says Fatima. “When I finally went to Italy, and I was in front of the Trevi Fountain, I couldn’t stop talking about it. And I kid you not – like five minutes into like me being in that location, there was another American talking about the same movie.” Fatima points out that most of these movies and TV shows depict “White women of a certain socio-economic background moving to Europe to pursue their ‘Eat, Pray, Love lifestyle.’” Fatima realized her TikTok was an opportunity to broaden that overriding pop culture narrative. “To be a Black American in Paris, it really does inform how I go about my life in this country,” she says. In one of the pinned videos on Fatima’s TikTok, she’s shown walking around picturesque Parisian streets, speaking directly to the camera and promising followers “range, details, information, tips, tricks, silly stories of my times past, and TBH just my reality of living in Paris.” directly engages with the pop culture tropes of Americans living abroad. For one, there’s a direct reference to fictional “Emily” – Fatima calls herself “Fatima in Paris” both in the video and her TikTok bio. And the video is soundtracked to the “Sex and the City” theme music – nodding to the moment in that series when fictional heroine Carrie Bradshaw decided to start over in Paris. “My content does have an aspect of escapism, and that’s by design,” says Fatima. “I try to make content that is fun and engaging for me, and also fun and engaging for the audience that might want to consume it.” For Fatima, social media has also turned out to be an alternative revenue stream – although she doesn’t make a full time living off her content, she does make a profit. “To put things into perspective, I have made enough money (post taxes) to pay two months worth of rent including utilities in the calendar year of 2023,” she tells CNN Travel. Kacie Rose Burns also makes money from her social media content via occasional branded content, but she says social media only became a full time career once she began running group tours in Italy and started her business. Burns says she also avoids any branded content she doesn’t think will resonate with her followers. For both Burns and Fatima, keeping their content as “real” as possible is important to them. For example, while Fatima’s content always has an appealing touch of glamor, she stresses to CNN that “living in France, living in Paris, is not this idealistic perfect utopia that a lot of people set it out to be” “I’m fully aware of that and fully cognizant of that. And every now and then I do talk about that on my platforms. I talk about the realities of living in this country,” she says. Burns – who, like Fatima, is well aware of the pop culture tropes she’s playing with – also says she tries to strike that equilibrium in her content. “It’s healthy to romanticize your life so that you find beauty in it,” Burns says. “But I also think it’s important, at the same time, to talk about the hard parts too, because life in Italy is not like ‘Lizzie McGuire.’ It does have its pain points. It’s not like ‘Under the Tuscan Sun.’ It’s not like ‘Eat, Pray, Love.’ There are definite, hard challenges to overcome. And there are a lot of things such as homesickness, that will never fully go away.” While a lot of popular social media accounts chart the adventures of Americans in Europe, there are accounts depicting “fish out of water” adventures across the globe. Ananya Donapati’s TikToks, for example, chronicles her life as an American in Japan. For the 23-year-old Californian, moving to Japan was the culmination of a dream that started when she discovered manga comics and started learning Japanese in her early teens. When the pandemic hit, Donapati almost cast the dream aside, figuring it was never going to be possible. But then the founder of a Japanese fintech startup found Donapati’s popular Twitter account and reached out, offering her a marketing job. Donapati left the US for Tokyo earlier this year. Although she was big on Twitter, now called X, it didn’t occur to Donapati to create TikToks about her new life until she started seeing other Americans doing the same. Now Donapati posts regular dispatches, funny observations and guides to Tokyo on her account The goal, says Donapati, is “to share what Japan has to offer, through the beauty that I see through my eyes, through my content.” Donapati had no qualms about filming herself and her experiences, she’s Gen Z and grew up watching YouTubers. To her, the whole thing seemed “kind of natural.” “I’ve always wanted to create content,” says Donapati “And I feel like a lot of people my age tend to have that desire.” Donapati enjoys the creativity that comes with the platform’s limitations – videos have to be short and snappy to catch the attention of a scrolling, time poor social media user who wants to “see something new, wants to be entertained,” as Donapati puts it. “So the more that you’re yourself and creative, I think you really get a lot of eyes on you, and a lot of support as well.” Donapati still enjoys watching content created by other Americans in Japan. She finds comfort in seeing some of her experiences reflected back at her, and also finds these videos helpful as she continues to navigate life abroad. “It’s extremely important to rely on each other, get advice,” she says. “And I think the content creation that everyone’s doing is kind of an extension of that.” Donapati also enjoys watching American content creators who post about their life elsewhere in the world. For Donapati, the appeal is that it’s “very real.” “I really like seeing, let’s say, someone in Europe and their life living there,” she says. “I definitely watch videos like that, it’s great, because I feel like I’m there without having to be there.” It’s not only American content creators who post about their experiences abroad on social media. Donapati also follows Japanese content creators living in the US, while Fatima likes reliving her New York years via content created by Europeans who’ve relocated to the US. But the proliferation of Americans posting about their experiences abroad suggests it’s a particularly popular trend in the US. US social media user Elizabeth Staub suggests glimpses of life abroad grow ever more appealing to Americans “as our country becomes a mess with regards to healthcare, affordable living and lack of third spaces in our community.” Burns suggests it’s also because the difficulties associated with international travel in the US didn’t end when pandemic travel restrictions were lifted. “We don’t have federal paid time off, people can’t take time off work, flying is impossible, it costs thousands of dollars to take a flight to Europe – it’s really expensive,” she says. “It’s just not a reality for a lot of people.” There’s a stereotype, suggests Burns, that Americans aren’t interested in traveling abroad. But many people, especially younger Americans, “want so badly to travel, but maybe they don’t necessarily have the means to do it.” “So they travel through their phone,” she says. “It’s easy to find Americans traveling abroad [on TikTok] and then they’re able to experience it through somebody that has a similar background.” Her words are echoed by social media user Erin Conry. “They’re living my dream,” she says of the Americans abroad she follows. The content she loves is informative and insightful, but overall just a “great escape.” “It’s cool to see that people have the confidence to actually live out that kind of life.” The-CNN-Wire ™ & © 2023 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.",
        "pubDate": "2023-12-14 18:17:39",
        "image_url": "https://www.mercurynews.com/wp-content/uploads/2023/12/231214132246-tiktok-travel-extra.webp?w=1400px&strip=all",
        "source_id": "mercurynews",
        "source_priority": 2968,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      },
      {
        "article_id": "da238e2b3993c8789c40158efb7c49e2",
        "title": "Disneyland 2024: All of the events, parades, and fireworks happening next year",
        "link": "https://www.mercurynews.com/2023/12/14/everything-happening-at-disneyland-in-2024/",
        "keywords": [
          "California News",
          "Entertainment",
          "Latest Headlines",
          "Lifestyle",
          "News",
          "Things To Do",
          "Travel",
          "Disneyland",
          "Family Travel",
          "Morning Wire",
          "Southern California Travel",
          "Theme Parks"
        ],
        "creator": [
          "Brady MacDonald"
        ],
        "video_url": null,
        "description": "For the first time ever, Disneyland has released details on each of the seasonal celebrations, special events and limited-time offerings planned for the year ahead.",
        "content": "Disneyland fans will need to go out and buy their 2024 calendar a little earlier than usual now that the full lineup of events and dates has been released for all of next year at the Anaheim theme parks. For the first time ever, Disneyland has released details on each of the seasonal celebrations, special events and limited-time offerings planned for the year ahead. The calendar will be filled on more than 300 days of the 366-day leap year in 2024 with a slate of festivities at Disneyland and Disney California Adventure. Disneyland decided to release the full calendar for 2024 during the first full week of December 2023 so fans can plan ahead and book reservations well in advance of the upcoming event. The advance planning strategy brings Disneyland more in line with Walt Disney World where visitors plan months in advance for vacations tied to specific events and times of the year. Disneyland hopes to encourage visitors to stretch overnight or weekend stays into longer vacations that extend into multiday or weeklong trips — just like travelers at the Florida theme park resort. The Disneyland calendar was recently extended to a 180-day window so visitors can plan further in advance and book theme park reservations and hotel stays. Here’s the lineup of events planned for Disneyland and Disney California Adventure in 2024. The annual food festival paying tribute to Chinese, Korean and Vietnamese traditions returns to DCA. The Year of the Dragon celebration means Mushu will lead Mulan’s Lunar New Year parade. Disneyland announced plans for four after-hours, separate admission special events in the first half of 2024 — without providing any details on themes or dates. The five Disneyland After Dark events in 2023 included the returning Sweethearts Nite (late January and early February), Throwback Nite (mid-April) and Star Wars Nite (early May) along with the new Princess Nite (early March) and Pride Nite (mid June). Previous years have seen Villains Nite, Pixar Nite, Grad Nite Reunion, 80s Nite and 90s Nite. Star Wars Nite and Sweethearts Nite are likely locked in for 2024 with the other two slots remaining open for new or returning special events. Chances are good for a Pixar Nite tied to Pixar Fest starting in late April. The annual tribute to gospel music returns to the Fantasyland Theatre with a pair of headliner musicians and a host of Southern California community choirs. The Feb. 17 show will be headlined by Marvin Sapp and the Feb. 24 show will feature Tasha Cobbs. The Anaheim NHL team celebrates its 30th anniversary in DCA’s Hollywood Land. Current and former Ducks players will take part in a fan zone with plenty of photo opportunities and a cavalcade parade. The 2024 version of the venerable Food & Wine Festival returns to DCA with California-centric food, beer and wine, celebrity chefs and Disney characters dressed in their best foodie attire. Fans of the classic Soarin’ Over California will get another chance to hang glide over Napa Valley, Monterey Bay and Redwood Creek when the classic version of the flight simulator ride returns during the food fest. The annual Star Wars celebration returns to Tommorowland and Galaxy’s Edge for a two-month run on either side of May 4 — the unofficial holiday of the epic saga. New planetary excursions will be added to Star Tours starting on April 5. Also starting on April 5, a galactic soundtrack featuring Star Wars symphonic music will be played in Galaxy’s Edge during Disneyland fireworks shows. Hyperspace Mountain will be back in Tomorrowland along with specialty Star Wars-themed food, drinks and merchandise. The Pixar-centric festival that helped launch Pixar Pier in 2018 is back again at both parks. The new Better Together parade will debut at DCA while the “Together Forever” fireworks and projection show returns to Disneyland with a few new scenes. The red panda version of Mei Lee and the 4*Town boy band from “Turning Red” along with Ember and Wade from “Elemental” will be among the characters taking part in Pixar Fest. The reimagined Paradise Pier Hotel will officially become Pixar Place Hotel on Jan. 30 — giving fans a chance to add an extra dose of Pixar to the 10-week festival. The nighttime spectacular returns to the Rivers of America with a new climactic battle scene between Sorcerer Mickey and Maleficent. A fire that destroyed the towering audio-animatronic Maleficent dragon forced a yearlong renovation of the show. Seasonal decor will once again fill both parks with a massive Mickey Mouse jack-o-lantern on Main Street U.S.A., Headless Horseman statue on Buena Vista Street and Radiator Screams makeover of Cars Land. Expect to see the return of holiday attraction overlays for the Haunted Mansion in Disneyland and Guardians of the Galaxy — Mission: Breakout, Mater’s Junkyard Jamboree and Luigi’s Rollickin’ Roadsters in Disney California Adventure. DCA’s Plaza de la Familia event in Paradise Gardens celebrating the Mexican traditions of Dia de los Muertos with music from “Coco” runs a few extra days through Nov. 2. Disneyland attached dates to virtually every event in 2024 except one: Oogie Boogie Bash. The wildly-popular Halloween event sold out in 12 hours in 2023. Announcing the Oogie Boogie Bash dates too soon might lead to squatters booking Disney hotel rooms that would need to be canceled later if fans can’t manage to get tickets for the event. The Christmas season has become one of the busiest times of the year at Disneyland. While it’s too soon to book theme park tickets for Christmas 2024, it’s not too early to begin thinking about what you’re going to do next holiday season — before this one has really gotten started. The Disney Festival of Holidays will once again return to Disney California Adventure Park in 2024. The former Splash Mountain log flume ride is undergoing a transformation into a new attraction themed to Disney’s 2009 animated film “ThePrincess and the Frog.”",
        "pubDate": "2023-12-14 17:10:05",
        "image_url": "https://www.mercurynews.com/wp-content/uploads/2023/12/lede-disney.jpg?w=1400px&strip=all",
        "source_id": "mercurynews",
        "source_priority": 2968,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      },
      {
        "article_id": "a5ec34430d6dcb3d54aedfeec6d7d179",
        "title": "Key West on a Budget",
        "link": "https://www.nytimes.com/2023/12/14/travel/key-west-budget.html",
        "keywords": [
          "wintertravel23",
          "Travel and Vacations",
          "Budget Travel"
        ],
        "creator": [
          "Elaine Glusac"
        ],
        "video_url": null,
        "description": "Can a thrifty traveler afford this “end-of-the-road” Florida hot spot? Getting around on a rented bike and staying in a four-person dorm room helps.",
        "content": null,
        "pubDate": "2023-12-14 10:02:08",
        "image_url": "https://static01.nyt.com/images/2023/12/14/multimedia/14Frugal-Key-West-02-bhfv/14Frugal-Key-West-02-bhfv-mediumSquareAt3X.jpg",
        "source_id": "nytimes",
        "source_priority": 27,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      },
      {
        "article_id": "8cfc0e177e5bb0459a621a58a1cc1f61",
        "title": "Night trains and border crossings: Europe’s best new rail routes",
        "link": "https://www.theguardian.com/travel/2023/dec/14/night-trains-and-border-crossings-europes-best-new-rail-routes",
        "keywords": [
          "Rail travel",
          "Europe holidays",
          "Public transport trips",
          "Travel",
          "City breaks",
          "Short breaks"
        ],
        "creator": [
          "Nicky Gardner"
        ],
        "video_url": null,
        "description": "Our slow travel expert checks out what’s new in the European train timetables unveiled this monthWarsaw has just moved closer to Munich, Berlin nudged towards Paris, and Aachen slipped nearer to Salzburg. These are just three examples of city pairs that are newly linked, as of this week, by direct night trains. None of these city pairs currently has direct daytime trains, so the overnight options create a web of opportunities. As always in December, rail operators across Europe are introducing new schedules, along the way creating tantalising links where none existed before.In Britain the changes ushered in with the 2024 timetables are hardly dramatic; many services have just been tweaked by a minute or two here and there. There are extra trains on weekdays between Nottingham and Birmingham and some thinning out (yet again) of TransPennine Express schedules. Continue reading...",
        "content": "W arsaw has just moved closer to Munich, Berlin nudged towards Paris, and Aachen slipped nearer to Salzburg. These are just three examples of city pairs that are newly linked, as of this week, by direct night trains. None of these city pairs currently has direct daytime trains, so the overnight options create a web of opportunities. As always in December, rail operators across Europe are introducing new schedules, along the way creating tantalising links where none existed before. In Britain the changes ushered in with the 2024 timetables are hardly dramatic; many services have just been tweaked by a minute or two here and there. There are extra trains on weekdays between Nottingham and Birmingham and some thinning out (yet again) of TransPennine Express schedules. A new high-speed line through Spain’s Cantabria mountains opened last month. Photograph: Gonzalo Azumendi/Getty Images However, across the Channel, the unstoppable rail renaissance continues apace, with many new services in the 2024 schedules. In much of Europe those 2024 timetables were introduced on 10 December. There are exceptions. A new high-speed line through Spain’s Cantabrian mountains opened in late November, and new timetables for some routes in Poland and the Baltic states won’t come into effect for another week or two. Winners and losers For the most part, the 2024 timetables are good news for rail travellers. Of course, there are winners and losers. Copenhagen secures more direct services to Hamburg, while Aarhusloses out as its direct trains to Hamburg are axed. Few will shed too many tears in Aarhus as the compensation for losing those twice-daily direct trains is a new connecting service every two hours from Denmark’s second-largest city which, with an easy same-platform change of train in Kolding, will get travellers to Hamburg faster than the direct trains. Rail services shape our mental maps of Europe. The German city of Nuremberg was for years a jumping-off point for rail journeys to the Czech Republic. The range of Czech destinations from Nuremberg has been trimmed over the years, but until last week there were still five direct trains each day to the Czech Republic. Now there are none, although, in fairness, there is no shortage of other cross-border routes linking Germany with the Czech Republic. Berlin now has a direct night train to Paris. Photograph: Sylvain Sonnet/Getty Images Each year’s new timetables create links between communities that just a few weeks earlier were unconnected. Paris and Berlin now have a direct night train , reinstating a link that was severed at the start of the pandemic when the Russian Railways train from Paris to Berlin and Moscow ran for the last time. As of this week, the historic cities of Aachen and Halle find themselves linked by a new direct night train. A Nightjet leaves the city of Charlemagne just after 9pm and arrives 10 hours later in Halle, the city in central Germany which so profoundly influenced the Pietist movement. What better journey for anyone interested in German history? New opportunities Tour operators and travel agents are quick to pore over each December’s new train schedules to create new itineraries. Cat Jones, CEO of flight-free operator Byway Travel , says: “All these new trains across Europe are creating a real buzz at Byway. We’re now able to pair places in holidays where direct trains didn’t exist before. The new Euronight direct sleeper linking Salzburg with Kraków, for example, creates a real opportunity for culture vultures to combine [trips to] two very different cities.” That new Salzburg-Kraków link takes almost 10 hours and is among many new city pairs opened up by the new night train linking Munich with Warsaw. The Warsaw-bound train that left Munich on the evening of 10 December was the first direct departure from Bavaria to Poland since 2010. Kraków has a new link to Salzburg, in Austria Photograph: Antagain/Getty Images In the new timetables, we see many city pairs that are already well served by direct daytime trains securing an overnight link. From this week, travellers can snooze in the comfort of a sleeping car from Dresden to Budapest, Vienna and Graz. All three cities have long had daytime trains from Dresden, but now there is an extra option. skip past newsletter promotion Sign up to The Traveller Free newsletter Get travel inspiration, featured trips and local tips for your next break, as well as the latest deals from Guardian Holidays Privacy Notice: Newsletters may contain info about charities, online ads, and content funded by outside parties. For more information see our Privacy Policy . We use Google reCaptcha to protect our website and the Google Privacy Policy and Terms of Service apply. after newsletter promotion Even in France, where in 2016 Le Monde proclaimed “ Le train de nuit: c’est fini! ” there is an upswing in demand for overnight trains. Béziers and Montpellier will now have a direct link with Paris on some nights, with the first departures tomorrow. Here, of course, there is competition from direct daytime trains, with the fastest TGVs dashing from Montpellier to the capital in little more than three hours. Another new French overnight train is the Aurillac-Paris service, where there are no competing direct daytime trains. As with all French night trains, they offer little by way of creature comforts. There are no sleeping cars, so passengers must choose between a reclining seat and a couchette. But prices are keen, with fares from €19 for seats and €29 for couchettes. Crossing borders Much has been made of the fact that Europe’s rail operators often focus on their domestic markets and neglect cross-border connections. The ambition of some rail companies does flag as they approach international frontiers, but there are plenty of improved cross-border opportunities. This week has seen increased frequency between Munich and Zürich, hard on the heels of big improvements in November, when direct trains from Stuttgart to Zürich were reinstated. On the busy Berlin-Amsterdam route, journey time has been trimmed by 30 minutes, to under six hours. There is a cross-border service from Latvia, above, to Lithuania for the first time since before Covid. Photograph: Westend61/Getty Images The number of direct daytime trains from Kraków to both Vienna and Berlin doubles from one to two and the Polish city of Wrocław acquires a new early-morning direct train to Vienna, returning late afternoon. From last weekend, there has been a second direct train from Vienna to Ukraine. Complementing the longstanding Euronight service from Vienna to Kyiv, the morning departure from Vienna to Romania now also has through-carriages to Chop, in Ukraine’s Transcarpathia region. It is a mark of how EU-based rail operators promoting better connectivity with western Ukraine. Czech private operator RegioJet is said to be exploring the possibility of a new direct overnight train from Prague to Chop from early 2024. It is even possible that cross-border services from Lithuania to Latvia may be reinstated before the end of the year. The habitually cautious editors of the wonderful European Rail Timetable suggest in their newly published winter edition that “a through Vilnius to Riga train is expected to start running from 27 December”. If this comes to pass, it will be the first public train service between the two capitals since before the pandemic. And it will mean dedicated rail travellers will once again be able to travel by train all the way from England to Estonia without resorting to a bus for that cross-border hop from Lithuania into Latvia. Nicky Gardner is the co-author of Europe by Rail: the Definitive Guide. The 17th edition of the book is available from the Guardian bookshop",
        "pubDate": "2023-12-14 07:00:08",
        "image_url": "https://i.guim.co.uk/img/media/ebaae6add35f15dddcbea35fe4b586b9ac97213b/1410_819_2564_1538/master/2564.jpg?width=140&quality=85&auto=format&fit=max&s=b8f9394f3ebecae937a52eb0494d5fde",
        "source_id": "theguardian",
        "source_priority": 106,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      },
      {
        "article_id": "712922e8381aa969bc7a08f0d01662b9",
        "title": "Bear killed in California after 3-way standoff between man, bear and dog",
        "link": "https://www.sfgate.com/renotahoe/article/bear-attacks-california-man-near-tahoe-18552087.php",
        "keywords": null,
        "creator": [
          "Andrew Chamings"
        ],
        "video_url": null,
        "description": "A man was reportedly bitten by a bear in Sierra County, an extremely rare incident.",
        "content": "A female black bear sits in a tree near Lake Tahoe, Calif. In an extremely rare incident, a California man was reportedly bitten numerous times by a black bear in Friday. The Calpine resident told authorities he let his dog outside to use the bathroom as usual on Saturday evening, but noticed the dog bolted. When he went outside to find him, a bear emerged from his neighbor’s yard and “charged at him,” the Sierra County Sheriff’s Office said in a . The bear then reportedly bit the man on the hand, wrist and leg. The man escaped back into his home, retrieved a shotgun and shot the black bear while the animal was in a standoff with his dog. The shotgun blast seriously wounded the bear. Advertisement Article continues below this ad The California Department of Fish and Wildlife subsequently located and euthanized the bear, then took the remains to Sacramento to test for rabies. The man is recovering after receiving treatment for his injuries in a hospital. “The bear had been shot at close range, was bleeding heavily and mortally wounded,” Capt. Patrick Foy at Fish and Wildlife told SFGATE over the phone Wednesday. “The decision was made to euthanize it through compassion.” Foy said a wildlife officer killed the bear on-site with a patrol rifle. It’s an exceedingly unusual example of a bear, outside, charging at and repeatedly biting a human. The sheriff’s statement did not detail if the bear had cubs or if the dog was acting aggressively. “Very, very, very rare. I’ve never heard of that happening,” said Ann Bryant, executive director of the Bear League, a wildlife rescue organization in Tahoe. “The only time I heard of such a thing in 30 years of dealing with bears in California would be if the bear was in an enclosed area with no way out, and the person was blocking its escape route. Then they may push a person out of the way and maybe scratch them.” Advertisement Article continues below this ad Foy and Bryant agreed that bears attacking dogs is also rare. Bryant said it has happened on occasion, if a dog has a hold of a mother bear’s cub. Black bears — the still in California — have never killed a human in the wild in the state’s recorded history. “They don’t pick fights,” Bryant said. — — — —",
        "pubDate": "2023-12-13 22:53:14",
        "image_url": null,
        "source_id": "sfgate",
        "source_priority": 1360,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      },
      {
        "article_id": "0fd51b46ba5ee239719a4ee2899789c8",
        "title": "Caltrans predicts Highway 1 through Big Sur reopening following Paul's Slide closure",
        "link": "https://www.sfgate.com/centralcoast/article/big-sur-highway-1-expected-reopening-18552346.php",
        "keywords": null,
        "creator": [
          "Silas Valentino"
        ],
        "video_url": null,
        "description": "Access to the coastal California highway has been blocked throughout 2023.",
        "content": null,
        "pubDate": "2023-12-13 21:24:50",
        "image_url": null,
        "source_id": "sfgate",
        "source_priority": 1360,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      },
      {
        "article_id": "24e4a7991e85c7354cb1edb22f0a03d3",
        "title": "Puerto Rico’s restaurant scene has never been better. Here’s why",
        "link": "https://www.eastbaytimes.com/2023/12/13/puerto-ricos-restaurant-scene-has-never-been-better-heres-why/",
        "keywords": [
          "Things To Do",
          "Travel",
          "Network"
        ],
        "creator": [
          "Tribune News Service"
        ],
        "video_url": null,
        "description": "If you didn’t know, Puerto Rico has become one of the most exciting destination-dining scenes in the Caribbean.",
        "content": "Maybe you’ve heard about the ascendant restaurant scene in Puerto Rico. Most people haven’t: The island is still principally known as a highly convenient place for sun and beaches, with no passport required for U.S. citizens, and the food scene is often relegated to what’s convenient to cruise ship ports. If you didn’t know, Puerto Rico has become one of the most exciting destination-dining scenes in the Caribbean. It’s rich with exciting concepts and heritage-minded chefs who showcase culinary traditions and fresh local ingredients in ways that range from ingenious riffs on Puerto Rican classics to exuberant explorations of Mediterranean cuisine—and even noteworthy pizza. This is all happening in spite of the long-lasting impact of Hurricane Maria in 2017 and the subsequent COVID-19 pandemic. In fact, those two crippling events inspired many chefs to work with the most readily available ingredients — what they could obtain from the island’s fields and surrounding waters —while also giving them opportunity to cultivate fresh concepts. The creative wave in dining options is surging as Puerto Rico welcomes a record-breaking influx of visitors. As of August, year-to-date arrivals at San Juan’s Luis Muñoz Marín International Airport climbed to 4.2 million passengers, an increase of 20% compared to the same period last year. According to Tourism Economics, travel and tourism brought in approximately $8.7 billion in revenue for the year through June, a 63% increase from 2018 highs. As of the second quarter this year, AirDNA has tracked a 12% increase in lodging demand for the year, while independent rental demand more than doubled since 2019. As the food scene has expanded, both in San Juan and within reasonable driving distance, restaurant prices remain affordable, especially in comparison with other Caribbean destinations such as Anguilla and St. Barts. Here are the seven most exciting places to eat in Puerto Rico, from a fine dining farm-to-table restaurant helmed by the island’s first James Beard Award-winning chef to a wood-fired homage to the region’s cooking traditions. Cocina al Fondo Natalia Vallejo, who scored the title of James Beard Best Chef South in June, transforms local produce and protein foods into dishes that speak to the island’s heritage. Delicately fried lionfish is served in a country bean casserole; yellowfin crudo is enlivened with caramelized pineapple. Meals at her villa-style San Juan restaurant, with its verdant backyard patio, feel like lively dinner parties. They’re powered by cocktails from bar star Karla Torres, who deftly weaves regional fruits, flowers and botanicals into memorable libations. Tia Dora Tucked away near San Juan’s beachy, breezy Ocean Park community, chef Raul Corea’s slim restaurant evokes the Mediterranean. The food, served mezze style, is colorful and creative: Options include fire-roasted prawns, daubed with preserved lemon aioli and served with magenta triangles of watermelon radish, and bucatini tossed with za’atar and parmesan in a reimagined cacio e pepe; entrees start at $23. Vegan options abound, too. The cocktail menu is equally compelling, full of such delectable riffs as a cooling cucumber sumac margarita. Café Caleta Set near the historic Catedral de San Juan Bautista, this charming newcomer is a coffee shop by day and a wine-cocktail bar at night. Don’t ask for any flavor shots with your expertly pulled espresso drinks; Caleta doesn’t believe in them. Alongside is a fun, funky selection of bottles and classic-inspired tipples, including a righteous mezcal-powered Negroni. The food served throughout the day is internationally influenced: horchata-spiced challah bread French toast at breakfast, house-made pastrami stacked on a bialy-like pretzel bun for the lunch crowd and, at dinner, catch-of-the-day ceviche crowned with crunchy peanuts. (Dishes at night start at $14.) La Santurcina One of the newest additions to the island’s pizza scene may be its best. Located in San Juan’s vibe-y Santurce neighborhood, its airy space is decorated with slice-minded pop art and plenty of plants. Chef-owner Francis Guzman and chef Stephen Reyna, who also helm the city’s celebrated farm-to-table restaurant Vianda, turn out beautifully bubbled, Neapolitan-inspired rounds, often with clever vegetable toppings such as their signature Beetaroni, with thinly sliced, sausage-spiced beets. Tables fill up quickly, so arriving early will bring the best chance of scoring a seat. Celeste Snuggled between Old San Juan and Condado in Puerta de Tierra, this chic seafood-centric wine bar highlights fresh catches from the surrounding waters. Chef-owner Sebastián Martínez Tully’s seemingly simple plates have complex flavors, such as cubes of raw yellowfin tuna tossed in umami-packed curry leaf oil and grilled razor clams lavished with arugula-embellished chili sauce. Don’t miss the desserts, including tender chocolate cake topped with a cloud of allspice-accented whipped cream and a drizzle of honey-sesame caramel. El Pretexto This verdant, 3.5-acre mountaintop retreat outside Cayey on the southeastern end of the island — an hour from San Juan — offers immersive property tours and dinners twice a week. Founder Crystal Díaz is a super connector who knows everyone in Puerto Rico’s food community; she hosts sunset soirees that begin with a walk through her bountiful garden and orchard and past the property’s newest villa. The four-course meals by acclaimed chef Luis Cabrero, which go for $75, unfold on the deck with a view of the hills tumbling down to the azure Caribbean coastline. The seasonal dishes blend influences from the diaspora, European colonizers and Caribbean culture, such as chorizo-packed chickpea stew served with a toasted slab of garlic-rubbed baguette from a local baker. Bacoa Three veteran chefs from Puerto Rico power this exuberant, exciting enterprise: Tia Dora’s Correa, René Marichal and Xavier Pacheco. The restaurant is situated in a restored hacienda overlooking a small, stream-fed lake on a finca (country estate) in the town of Juncos on the eastern end of the island, a 45-minute drive from San Juan. The menu, which capitalizes on wood-fired grilling, offers refined interpretations of Puerto Rican favorites: salted cod fritters, crispy skinned branzino with slender ribbons of calabaza squash, and sausage pudding in a glistening puddle of pork demi-glace. ___ ©2023 Bloomberg L.P. Visit Distributed by Tribune Content Agency, LLC.",
        "pubDate": "2023-12-13 21:10:55",
        "image_url": "https://www.eastbaytimes.com/wp-content/uploads/2023/12/TRV-WLT-PUERTO-RICO-DINING-SCENE-DMT.jpg?w=1400px&strip=all",
        "source_id": "eastbaytimes",
        "source_priority": 17164,
        "country": [
          "united states of america"
        ],
        "category": [
          "tourism"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702501855692083165"
  }