{
    "status": "success",
    "totalResults": 365,
    "results": [
      {
        "article_id": "6a14ee72b8ea41e99ce8015014e76ed2",
        "title": "Navy officer released from Japanese prison booked into California federal prison",
        "link": "https://www.eastbaytimes.com/2023/12/15/navy-officer-released-from-japanese-prison-booked-into-california-federal-prison/",
        "keywords": [
          "California News",
          "Crime and Public Safety",
          "Latest Headlines",
          "National News",
          "National Politics",
          "News",
          "Politics",
          "World News",
          "Crime",
          "Military",
          "Morning Wire"
        ],
        "creator": [
          "Cnn Com Wire Service"
        ],
        "video_url": null,
        "description": "US Navy officer Lt. Ridge Alkonis, who was jailed in Japan for negligent driving that resulted in the death of two people, has been booked into a federal prison in Los Angeles following his transfer to the US.",
        "content": "US Navy officer Lt. Ridge Alkonis, who was jailed in for negligent driving that resulted in the death of two people, has been booked into a federal prison in Los Angeles following his transfer to the US, according to a family spokesperson and the Federal Bureau of Prisons. “We can confirm Ridge Alkonis is in the custody of the Federal Bureau of Prisons at the Metropolitan Detention Center (MDC) Los Angeles,” a BOP spokesperson told CNN. A family spokesperson, Jonathan Franks, said in a statement that “Lt. Alkonis is now housed in a notorious federal lockup in Los Angeles, and BOP tells us it will take up to 90 days to approve Brittany and the kids to visit him. We believe the BOP can and should release Ridge immediately – it is outrageous he is spending the night in jail.” The BOP spokesperson said the bureau had nothing to add when asked by CNN when Alkonis’ family might be able to visit him. Earlier Thursday, the Alkonis family said in a statement that they were “encouraged” by the transfer. “After 507 days, Lt. Ridge Alkonis is on his way home to the United States. We are encouraged by Ridge’s transfer back to the United States but cannot celebrate until Ridge has been reunited with his family,” the statement said. Two US officials confirmed earlier in the day that Alkonis was in US custody. One of those officials told CNN that he was remanded to US custody after direct engagement by Vice President Kamala Harris and national security adviser Jake Sullivan, and was being brought back to the US under an international prisoner convention that allows individuals to serve the remainder of their confinement in their home country. When Alkonis arrives back in the US, the official said, “he will go before an entity called the US parole commission within the Department of Justice, which will consider his case and make a determination about further confinement.” According to a Department of Justice official, the parole commission process could take several months. They will look at Alkonis’ prison sentence in Japan and determine what would have been done in the US, and then determine what his remaining punishment would be. He could end up in home custody, this official said. “The Biden administration signaled to the Parole Commission that if they want to understand the complexity of the diplomacy, his military record, the fact that he was a model prisoner or anything else, we are available to do that as long as the Commission deems it appropriate,” they said. The Department of Justice declined to comment. Alkonis, who was stationed in Japan, was sentenced to three years in a Japanese prison in October 2021 for negligent driving resulting in the death of two people and injuries to a third person in May 2021. He said he suffered from acute mountain sickness as he was driving with his family from Mount Fuji, which caused him to lose consciousness. That argument was rejected by the court. His appeal was denied in July 2022. Alkonis’ family argued he was ill, not negligent, and therefore committed no crime. They have also noted that they offered the victims’ families over $1 million in restitution, as is customary in Japan. The Alkonis family had claimed that there have been violations of the status of forces agreement between the United States and Japan during the proceedings of the case. Related Articles The family pushed for him to be transferred back to the US under the Council of Europe (COE) Convention on the Transfer of Sentenced Persons, which would allow him to serve out his sentence there. Under the terms of the treaty, which Japan joined in 2003, “The prisoner, the Government of Japan and the U.S. government must all agree to the transfer,” according to the “Transfers can take 2 years or longer from the time the process begins,” it notes. Twenty Republican senators wrote to Japanese Prime Minister Fumio Kishida in August asking the Japanese government to consider expelling Alkonis as they made the case that the “full nature” of the situation had not been taken into consideration. They also noted that a Navy investigation concluded that Alkonis lost consciousness because of acute mountain sickness. The family said they appreciated “the efforts of the U.S. Government to effect this transfer and are glad that an impartial set of judiciary eyes will review his case for the first time.” “We trust that the DOJ will urgently wish to end this travesty of justice by immediately releasing Ridge, and we look forward to Ridge enjoying the holidays at home with his wife and children.” CNN’s Evan Perez contributed to this report. The-CNN-Wire™ & © 2023 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.",
        "pubDate": "2023-12-15 12:14:40",
        "image_url": "https://www.eastbaytimes.com/wp-content/uploads/2023/12/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbHE1YnQ1aTUwMDBkM2I1dzFsdDJ5bXhr-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NscTVic3BueTAwMGo0NXA0N3kxZGgybXg.jpg?w=1400px&strip=all",
        "source_id": "eastbaytimes",
        "source_priority": 17164,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      },
      {
        "article_id": "80d20683c04d1fbb7c2e13f90935076d",
        "title": "Navy officer released from Japanese prison booked into California federal prison",
        "link": "https://www.mercurynews.com/2023/12/15/navy-officer-released-from-japanese-prison-booked-into-california-federal-prison/",
        "keywords": [
          "California News",
          "Crime and Public Safety",
          "Latest Headlines",
          "National News",
          "News",
          "World News",
          "Crime",
          "Military",
          "Morning Wire"
        ],
        "creator": [
          "Cnn.Com Wire Service"
        ],
        "video_url": null,
        "description": "US Navy officer Lt. Ridge Alkonis, who was jailed in Japan for negligent driving that resulted in the death of two people, has been booked into a federal prison in Los Angeles following his transfer to the US.",
        "content": "US Navy officer Lt. Ridge Alkonis, who was jailed in for negligent driving that resulted in the death of two people, has been booked into a federal prison in Los Angeles following his transfer to the US, according to a family spokesperson and the Federal Bureau of Prisons. “We can confirm Ridge Alkonis is in the custody of the Federal Bureau of Prisons at the Metropolitan Detention Center (MDC) Los Angeles,” a BOP spokesperson told CNN. A family spokesperson, Jonathan Franks, said in a statement that “Lt. Alkonis is now housed in a notorious federal lockup in Los Angeles, and BOP tells us it will take up to 90 days to approve Brittany and the kids to visit him. We believe the BOP can and should release Ridge immediately – it is outrageous he is spending the night in jail.” The BOP spokesperson said the bureau had nothing to add when asked by CNN when Alkonis’ family might be able to visit him. Earlier Thursday, the Alkonis family said in a statement that they were “encouraged” by the transfer. “After 507 days, Lt. Ridge Alkonis is on his way home to the United States. We are encouraged by Ridge’s transfer back to the United States but cannot celebrate until Ridge has been reunited with his family,” the statement said. Two US officials confirmed earlier in the day that Alkonis was in US custody. One of those officials told CNN that he was remanded to US custody after direct engagement by Vice President Kamala Harris and national security adviser Jake Sullivan, and was being brought back to the US under an international prisoner convention that allows individuals to serve the remainder of their confinement in their home country. When Alkonis arrives back in the US, the official said, “he will go before an entity called the US parole commission within the Department of Justice, which will consider his case and make a determination about further confinement.” According to a Department of Justice official, the parole commission process could take several months. They will look at Alkonis’ prison sentence in Japan and determine what would have been done in the US, and then determine what his remaining punishment would be. He could end up in home custody, this official said. “The Biden administration signaled to the Parole Commission that if they want to understand the complexity of the diplomacy, his military record, the fact that he was a model prisoner or anything else, we are available to do that as long as the Commission deems it appropriate,” they said. The Department of Justice declined to comment. Alkonis, who was stationed in Japan, was sentenced to three years in a Japanese prison in October 2021 for negligent driving resulting in the death of two people and injuries to a third person in May 2021. He said he suffered from acute mountain sickness as he was driving with his family from Mount Fuji, which caused him to lose consciousness. That argument was rejected by the court. His appeal was denied in July 2022. Alkonis’ family argued he was ill, not negligent, and therefore committed no crime. They have also noted that they offered the victims’ families over $1 million in restitution, as is customary in Japan. The Alkonis family had claimed that there have been violations of the status of forces agreement between the United States and Japan during the proceedings of the case. The family pushed for him to be transferred back to the US under the Council of Europe (COE) Convention on the Transfer of Sentenced Persons, which would allow him to serve out his sentence there. Under the terms of the treaty, which Japan joined in 2003, “The prisoner, the Government of Japan and the U.S. government must all agree to the transfer,” according to the “Transfers can take 2 years or longer from the time the process begins,” it notes. Twenty Republican senators wrote to Japanese Prime Minister Fumio Kishida in August asking the Japanese government to consider expelling Alkonis as they made the case that the “full nature” of the situation had not been taken into consideration. They also noted that a Navy investigation concluded that Alkonis lost consciousness because of acute mountain sickness. The family said they appreciated “the efforts of the U.S. Government to effect this transfer and are glad that an impartial set of judiciary eyes will review his case for the first time.” “We trust that the DOJ will urgently wish to end this travesty of justice by immediately releasing Ridge, and we look forward to Ridge enjoying the holidays at home with his wife and children.” CNN’s Evan Perez contributed to this report. The-CNN-Wire ™ & © 2023 Cable News Network, Inc., a Warner Bros. Discovery Company. All rights reserved.",
        "pubDate": "2023-12-15 12:14:40",
        "image_url": "https://www.mercurynews.com/wp-content/uploads/2023/12/cnn-L19jb21wb25lbnRzL2ltYWdlL2luc3RhbmNlcy9jbHE1YnQ1aTUwMDBkM2I1dzFsdDJ5bXhr-L19jb21wb25lbnRzL2FydGljbGUvaW5zdGFuY2VzL2NscTVic3BueTAwMGo0NXA0N3kxZGgybXg.jpg?w=1400px&strip=all",
        "source_id": "mercurynews",
        "source_priority": 2968,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      },
      {
        "article_id": "f123c8d881fcc229cfffefb1d5c45cda",
        "title": "Disagreements emerge over who should be in control of Gaza when the war ends",
        "link": "https://www.npr.org/2023/12/15/1219512036/disagreements-emerge-over-who-should-be-in-control-of-gaza-when-the-war-ends",
        "keywords": null,
        "creator": [
          "Daniel Estrin"
        ],
        "video_url": null,
        "description": "Who should be in charge in Gaza after the war? Disagreements have emerged between the U.S., Israel, Palestinian and Gulf leaders, and activists.",
        "content": "Who should be in charge in Gaza after the war? Disagreements have emerged between the U.S., Israel, Palestinian and Gulf leaders, and activists.",
        "pubDate": "2023-12-15 11:54:07",
        "image_url": "https://media.npr.org/include/images/tracking/npr-rss-pixel.png?story=1219512036",
        "source_id": "npr",
        "source_priority": 118,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      },
      {
        "article_id": "3a4a4a0c5548fba74bad9cf05cd93118",
        "title": "Police officer stoned to death after rescuing FGM survivors in Kenya",
        "link": "https://www.theguardian.com/global-development/2023/dec/15/police-officer-stoned-to-death-after-rescuing-fgm-survivors-in-kenya",
        "keywords": [
          "Global development",
          "Female genital mutilation (FGM)",
          "Women's rights and gender equality",
          "Kenya",
          "Health",
          "Society",
          "Africa",
          "World news",
          "Global health"
        ],
        "creator": [
          "Peter Muiruri in Nairobi"
        ],
        "video_url": null,
        "description": "Activists see the killing as a setback in the efforts to eliminate the practice, despite it being illegal in the east African countryEfforts to eradicate female genital mutilation in Kenya have suffered a setback after a police officer was killed in a confrontation with a gang of youths.Activists and local leaders condemned the murder, calling it a backward step in the fight to eradicate the practice in the country. Police in Elgeyo Marakwet county, in the Rift Valley region, had taken a group of girls who had been forced to undergo the illegal procedure to hospital when a mob of young men stormed a police station and stoned Cpl Mushote Boma to death. Continue reading...",
        "content": "Efforts to eradicate female genital mutilation in Kenya have suffered a setback after a police officer was killed in a confrontation with a gang of youths. Activists and local leaders condemned the murder, calling it a backward step in the fight to eradicate the practice in the country. Police in Elgeyo Marakwet county, in the Rift Valley region, had taken a group of girls who had been forced to undergo the illegal procedure to hospital when a mob of young men stormed a police station and stoned Cpl Mushote Boma to death. “Angry youth raided the police post in a bid to get the girls, who had been rescued by police after they were genitally mutilated, where they overpowered the officer who was on duty and stoned him to death before burning his body using a mattress,” reported the government-owned Kenya news agency . The six girls are recuperating at a local hospital, according to county police commander, Peter Mulinge. Female genital mutilation, or “the cut”, remains illegal in Kenya but is still being practised in some places, usually during school holidays , by women using crude methods and tools. There have been cases of activists being attacked by those carrying out FGM, but assaults on law enforcement officers are rare. “It is shocking and disheartening that in the 21st century we can kill a police officer rescuing girls undergoing the inhumane act,” said Tony Mwebia, founder and executive director of the not-for-profit Men End FGM Foundation that aims to rally men and boys against FGM and child marriages. “Were these men who killed the policeman aware of why they were protecting the backward culture? Do they have any idea of the harm caused by the cut?” Mwebia, whose organisation has since trained nearly 500 male champions in counties where FGM exists, says men cringe when they are shown videos of the cut, a rite they traditionally believe is undertaken for their benefit. “They are told the cut makes women more mature and avoid promiscuity. They are also told that they will lose any respect within the community by marrying an uncut woman. That is why they will kill anyone, including a policeman, who interferes with the cut,” Mwebia said. Mwebia was attacked by another group of men in Kuria in December 2016 after he and a colleague were suspected of filming a street parade of girls undergoing the cut. A local administrator, who asked to remain anonymous for fear of reprisals, said the attack on law enforcement officers will embolden those performing the cut as they will see the government as weak and unable to protect its own. “Killing a police officer in the name of FGM worries me,” he said. “We know FGM is illegal in Kenya but just enforcing the law without adequate public sensitisation against the vice will have little success. There must be a robust conversation with local people if we are to stem the FGM tide in the region.” According to The Nation newspaper , about 70 girls were rescued by the police, with Viola Cherono, a human rights activist from the region, reporting that as many as 500 girls had been assembling in the forest to undergo the practice. ‘Every chemist has a backroom’: the rise of secret FGM in Kenya Read more “Girls are being cut every day in the Endo and Embobut wards. The people in Embobut are very wild and if you are an activist or the police, they will come and get you,” she told the paper. Bernadette Loloju, chief executive officer of the Anti-FGM Board in Kenya, said the killing was “an isolated incident beyond human thinking”, but that it should not be used to gauge the extent of the fight against the practice. “Cases of FGM have come down in communities that were strongly for the cut, mainly because girls have come out to say no,” said Loloju. “Although women are the perpetrators of the cut, we continue to engage the elders who are the cultural gatekeepers. These are the men who are shocked when they see videos of how FGM is done.” Mwebia said the war against FGM will only be won if “we don’t waste resources in conferences but change our strategies”. “There is political goodwill, right from the country’s top leadership. The silence from men will be the biggest barrier.”",
        "pubDate": "2023-12-15 11:12:42",
        "image_url": "https://i.guim.co.uk/img/media/cc654fa66ac1da09f4f76adb133d04109afcf270/0_40_600_360/master/600.jpg?width=140&quality=85&auto=format&fit=max&s=2d12c6fcc9ed2baacd725a27105ed981",
        "source_id": "theguardian",
        "source_priority": 106,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      },
      {
        "article_id": "461b7938104a83f35276fd0e9280c87c",
        "title": "Over 1,000 migrant families separated at border near San Diego since September, advocates say",
        "link": "https://www.latimes.com/politics/story/2023-12-15/migrant-families-at-san-diego-border-immigrant-advocates-letter-dhs",
        "keywords": null,
        "creator": [
          "Andrea Castillo"
        ],
        "video_url": null,
        "description": "Advocates say the separations stem from the federal government's ongoing practice of releasing high volumes of migrants to street locations around San Diego County without coordinated reception plans.",
        "content": "Nearly 1,100 migrant families have been separated while being processed at the U.S.-Mexico border near San Diego since September, immigrant advocacy groups said in a letter sent Thursday to the Department of Homeland Security that seeks an investigation into the matter. The separations stem from U.S. Customs and Border Protection’s ongoing practice of releasing high volumes of migrants to street locations around San Diego County without coordinated reception plans, according to the UCLA Center for Immigration Law and Policy and three other groups that signed the letter. As migrant arrivals at the California-Mexico border have increased, Customs and Border Protection has turned to street releases and holding migrants between border walls to reduce the number of people in its short-term facilities. According to the letter, immigration law group Al Otro Lado documented 1,081 family separations among the hundreds of migrants it serves each day at a border welcome center in San Diego, where it provides legal aid and translation services. Of that total, there were almost 400 separations of spouses and about 200 separations of adult children from the parents they were traveling with, including 43 children between age 18 and 21. Separations of those in other family relationships, such as adult siblings, cousins and common-law partners, make up the remainder of the total. In at least 39 cases, families remained separated after one or more members were transferred to long-term immigrant detention facilities. In at least two cases, one family member was deported while the others remain in the U.S. Customs and Border Protection did not immediately respond to a request for comment on the letter. “The trauma families experience during the periods of separation is compounded by CBP’s lack of communication and the near-total opacity of their practices,” states the letter to the Department of Homeland Security’s office of civil rights and civil liberties, which was also signed by the ACLU Foundation of San Diego and Imperial Counties, and Jewish Family Service of San Diego. To prevent further separations, the organizations are asking Homeland Security to broaden the definition of a family group under agency practice to include parents with adult children, couples without marriage certificates, adult siblings and extended family members. The groups are also asking that Homeland Security agents document all relationships among family groups and ensure families are released together, or to communicate the whereabouts of any family members that aren’t released at the same time. The letter comes after a federal judge in San Diego approved a court settlement last week that bars widespread separations of parents from their underage children at the U.S.-Mexico border for the next eight years. The settlement stems from a 2018 ACLU lawsuit over the separations, including those that took place under the Trump administration’s “zero tolerance” policy that led to the prosecutions of migrant parents who crossed the border without authorization. The settlement doesn’t affect family separations like those documented by Al Otro Lado, which the group believes are undercounted. An April 20 Customs and Border Protection memo obtained by The Times, which offers guidance on processing family groups, states that Homeland Security is “committed to protecting the unity of families encountered at the border to the extent legally and operationally feasible.” The guidance included in the memo pertains to parents or guardians with unmarried adult children up to age 25, grandparents with unmarried adult grandchildren up to age 25 and spouses and unmarried adult siblings up to age 25. Agents are required under the guidance to consider any verifiable documentation acknowledging such relationships and to link those individuals as a family group, with the goal of processing them out of custody together. “If the guidance truly is in furtherance of CBP’s stated commitment to maintaining unity of families, then in practice it should be implemented in a way that allows for families to report and have documented their relationships in accordance with the realities of people who are forced to flee their countries,” said Monika Langarica, an attorney with the Center for Immigration Law and Policy at UCLA. Most separated families said they had informed Customs and Border Protection that they were traveling in a family group, according to the letter, but families were rarely told they would be separated or how to locate their relatives. In October, Customs and Border Protection detained nearly 30,000 migrants near San Diego, up from nearly 18,000 in October 2022, according to agency figures. Meghan Zavala, data and policy analyst for Al Otro Lado, said these kinds of separations aren’t unique to San Diego. But Priscilla Orta, a supervising attorney at Brownsville, Texas-based Lawyers for Good Government, which provides legal aid to migrants, said separations aren’t common in the Rio Grande Valley of Texas, noting that Customs and Border Protection drops people off at designated locations. Few migrants stay overnight because even if family members are processed separately, there is little delay before they reunite at a welcome center. Spouses are often processed together, she said. “If you came here you’d have absolutely no idea that thousands of people were processed daily,” Orta said. “There’s zero chaos.” Just under half of the families recently separated at the border near San Diego are from Colombia, with smaller numbers from China, Brazil, Afghanistan and Peru, according to Al Otro Lado. Some separations have lasted hours or days, while others documented by the organization have lasted more than a month. Separations involving families who speak languages other than Spanish are particularly difficult, causing advocates to scramble to find interpreters, Zavala said. Some families spend days in crowded San Diego shelters waiting to see whether their relatives will be released, she said. “Our organization along with others continue to be very strained in our capacity and yet are given all these additional hurdles,” Zavala said. “We try to do our best to get information for these families who are quite desperate to know where the person they were traveling with is now being held.” In one case documented by Al Otro Lado, a husband and wife from Colombia were taken into Border Patrol custody in September. The husband was released just across the border from Tijuana in San Diego’s San Ysidro district without his wife, who had been transferred to a detention facility in Louisiana and was deported before she could speak with a local attorney. In another case, a husband and wife were separated during Customs and Border Protection processing. The husband was released without his wife at the San Ysidro Transit Center and returned to the center for weeks, hoping to find her. He later learned she had been transferred to a U.S. Immigration and Customs Enforcement facility in Texas, where she experienced medical complications. They were separated for 49 days. Julieta, 38, who asked that only her first name be used out of fear for her safety, told The Times she arrived in Tijuana from Colombia with her 19-year-old son. She said they turned themselves over to border agents on Nov. 22. Two days later, she was led to a bus and dropped off at a shelter, with no idea as to her son’s whereabouts. Five days after that, Julieta’s son was dropped off at the same shelter and they reunited. She said she knew they would be detained at the border, but didn’t anticipate that they would be separated. “It’s hell,” she said. “Not knowing if your son is safe, if he is alive, if something happened to him. All you can do is pray to God.”",
        "pubDate": "2023-12-15 11:00:55",
        "image_url": "https://ca-times.brightspotcdn.com/dims4/default/66aa52d/2147483647/strip/false/crop/3000x2000+0+0/resize/1500x1000!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Ffb%2Ffd%2F72023ee7465b9970684f257d6f38%2F1378206-me-1124-jacumba-border-12-rcg.jpg",
        "source_id": "latimes",
        "source_priority": 267,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      },
      {
        "article_id": "858ab45494454e0cbaaea852c6b68303",
        "title": "Christians living at the Lebanon border see Israel-Hamas war igniting hostilities with Hezbollah",
        "link": "https://www.latimes.com/world-nation/story/2023-12-15/christians-living-at-the-israel-lebanon-border-see-gaza-war-igniting-hostilities-with-hezbollah",
        "keywords": null,
        "creator": [
          "Melanie Lidman"
        ],
        "video_url": null,
        "description": "An ancient Christian minority in northern Israel, including some who fled from Lebanon decades ago, watch nervously as Israel-Hezbollah tensions rise.",
        "content": "Birds swoop across a valley separating Lebanon and Israel as olive and pomegranate trees rustle in the wind. The flash of light from an opposing hillside looks small from a distance — until a boom cracks across the landscape, announcing another Hezbollah rocket launched toward Israel. Minutes later, more explosions peal through the air, as the Israeli military responds to the source of the fire. Since the start of the Israel-Hamas war in Gaza Strip, hostilities have spread north to these hills, where Lebanon-based Hezbollah fighters have launched hundreds of missiles toward Israeli border communities, and Israeli forces have shelled targets to the north. “This is happening every day,” said Shadi Khaloul, a Christian Aramaean activist, as he stands in a pastoral orchard in the northern Israeli town of Jish. Aramaeans are a community of native Christians who trace their lineage to the time of Jesus. Khaloul has been instrumental in reviving spoken Aramaic, believed to be the language of Jesus and one used in portions of the Bible. Like many Aramaeans in Israel, Khaloul has distant family in Lebanon. “I am worried both for my Christian community here in Israel, and for our brothers across the border,” he said, looking over the valley toward the southern Lebanese village of Maroun el Ras. For Maryam Younnes, the conflict is wrenchingly personal. She was born in a small, rural Lebanese village called Debel. Her father was a commander in the Christian-dominated militia South Lebanon Army, which cooperated with the Israeli army during Israel’s 18-year occupation of southern Lebanon. Many in Lebanon viewed members of the SLA as traitors and collaborators for fighting alongside Israel and against Hezbollah. Human rights groups accused the SLA of systematic torture and abuse of Lebanese prisoners at a facility it controlled. When Israel withdrew from Lebanon in 2000, the SLA collapsed and many members and their relatives fled to Israel. Younnes and her family hoped to stay only a few days, until hostilities calmed down. Twenty-three years later, her family is still there. The SLA members and their families were eventually offered and accepted full Israeli citizenship. She said she has been completely cut off from her extended family in Lebanon, with no communication since they left. “The fact that my family is on the other side of the border, it’s not easy, because I know that they will get hurt if a broader war will happen,” Younnes said. “The southern Lebanese never wanted this war .... And then when the war is over, we are the ones who pay the price.” Younnes said the villagers in southern Lebanon — many of whom are Christians — have little choice when Hezbollah militants set up military infrastructure, including rocket launchers, on their property, which puts them at risk for retaliation from Israel. She blames Iran-backed Hezbollah — the militant group and Islamist political party with representatives in Lebanon’s government — for forcing her to stay in Israel. “For me, and for many Lebanese, Hezbollah is occupying Lebanon.” Of the roughly 7,000 SLA members and their families who came to Israel, about 3,000 remain, Younnes said. The others resettled in third countries or went back to Lebanon. Returning SLA officials faced prison sentences, though many family members were not prosecuted. They have struggled to reintegrate into Lebanese society. In October, the Israeli government directed citizens living within 2½ miles of the Lebanese border to evacuate, including more than 30 towns and the city of Kiryat Shmona. At least 63,000 residents from the north are living in temporary accommodations in the center of the country, funded by the government at least until the end of the year. Nearly 70,000 additional Israelis were evacuated from their homes near the Gaza border. Both Younnes and Khaloul live outside the evacuation zones and have stayed put. But the booms from the exchanges of fire shake their homes, providing a constant reminder of the threats in the north, even though the fighting in the south in Gaza captures most of the daily headlines. Israel’s Iron Dome air-defense system intercepts most missiles from Lebanon, though they have killed 10 people in Israel in the last two months. In Lebanon, at least 100 civilians and Hezbollah militants have died due to Israeli artillery fire, according to media reports. Khaloul said that people in northern Israel fear that Hezbollah will carry out a similar strike to the one on Oct. 7, when Hamas militants in Gaza burst through the border fence and attacked Israeli communities, army bases and a music festival, killing about 1,200 people and taking about 240 hostages back to Gaza. “If the [Hezbollah] terrorists will stay on the border with no solution, a lot of people will not return in the border line communities,” he said. In Israel, the Aramaean Christian minority is concentrated in the north, in isolated, rural communities that often do not have adequate shelters from rocket fire. About 3,000 South Lebanon Army soldiers and their families live in Israel, many of whom are Aramaean Christians as well. They live mostly clustered along the northern towns, “as close to Lebanon as possible,” Younnes said. The Aramaean Christian community numbers just 15,000 in Israel; there are thought to be more than a million Aramaean Christians in Lebanon, and more than 15 million worldwide. Aramaeans such as Younnes and Khaloul struggle to find their place in the complex tapestry of identities that make up northern Israel. Younnes and Khaloul speak Arabic, but do not identify as Arab Israelis. Khaloul led a long legal battle to recognize the community as a distinct official minority group, and in 2014 his son became the first to receive an Israeli identity card listing him as “Aramaean.” Still, many don’t feel fully accepted by the Jewish majority, despite speaking Hebrew and often attending Jewish schools. “Minorities like the native Christians and Druze, especially Aramaic-speaking Christians ... have no one that can protect them,” Khaloul said. To foster greater acceptance in Israel, he has advocated for members of his community to serve in the Israeli army. Khaloul, who works at the Alma Research and Education Center think tank, helped start a preparatory program that brings together young Christians and Jews for a year of study and leadership training ahead of their conscription into the military. Serving in the army helps his community integrate into Israeli society and connect them with better economic and educational opportunities, Khaloul said. Many worry that the tit-for-tat hostilities on the northern front will expand into a major regional war, roping in Iran, Syria, Lebanon and possibly the U.S. and other international powers. “People are asking me all the time if we will be in a wider war, and what we’re saying is that right now we are below the threshold of war,” said Orna Mizrahi, a researcher with the Israel-based Institute for National Security Studies who served for 12 years with the National Security Council of the prime minister’s office. So far, Hezbollah is showing its presence with rockets aimed at targets very close to the border, but not utilizing the organization’s full arsenal by sending missiles deeper into Israel. Hezbollah is believed to have an arsenal of at least 150,000 rockets with high-precision capabilities that can target the entirety of Israel. During Israel’s weeklong cease-fire with Hamas in November, when 110 hostages were freed, Hezbollah mostly honored the truce, renewing rocket attacks only after the deal collapsed. “Neither Hezbollah nor Iran are interested in a wider war,” Mizrahi said. For its part, the Israeli army is “ready at any moment to go on the offensive in the north,” Israeli army chief of staff Lt. Gen. Herzi Halevi said during a Dec. 5 news conference. Halevi added that Israel was exploring both diplomatic and military options to deal with the Hezbollah threat. Hezbollah leader Hassan Nasrallah boasted in a November speech that its attacks in the north have forced Israel to divert a large amount of its army, navy, and air force resources away from Gaza, which has helped the Palestinians there. The group has also sought to pressure the international community into intervening in the Gaza conflict by demonstrating how violence could spread into a regional war. Both Mizrahi and Khaloul said that for Israelis to regain their sense of security in the north, Hezbollah fighters must be pushed back from their footholds along the border, creating a buffer zone controlled by United Nations forces and the Lebanese army. Evacuated families from the north have railed against the Israeli government, fearful they will be forced to return to a reality where they are living just a couple of miles from a militant group that is better funded, better organized and better armed than Hamas. Mizrahi cited the Litani River, whose western branch runs parallel to the border about 13 miles north, as a psychological boundary for Israelis. If Hezbollah were contained north of the Litani River, that would restore some feeling of safety for Israelis, she said. This is also the boundary that was agreed upon in United Nations Resolution 1701 , which helped end the 2006 war between Israel and Lebanon. But Resolution 1701 has been mostly ignored as Hezbollah has crept closer to the border in recent years. Militants now operate so close to the border that Israelis can see them with their bare eyes. Hezbollah “is just one mile from our homes, maybe two miles from our homes,” Khaloul said. “We don’t need another Oct. 7 to happen here.” Lidman is a special correspondent. Times staff writer Nabih Bulos in Beirut contributed to this report.",
        "pubDate": "2023-12-15 11:00:47",
        "image_url": "https://ca-times.brightspotcdn.com/dims4/default/9ee98e8/2147483647/strip/false/crop/5616x3744+0+0/resize/1500x1000!/quality/75/?url=https%3A%2F%2Fcalifornia-times-brightspot.s3.amazonaws.com%2Fd6%2Fe3%2Facdf5f82461fb93b069666789d28%2F1358911-fg-1101-israelgazawar-mwy-43779.jpg",
        "source_id": "latimes",
        "source_priority": 267,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      },
      {
        "article_id": "6646573abe876047872d4162e11347c9",
        "title": "Abcarian: Who will make abortion pill rules? A bunch of right-wing judges, or FDA scientists?",
        "link": "https://www.latimes.com/opinion/story/2023-12-15/abortion-texas-supreme-court-pill-mifepristonel-fda-matthew-kacsmaryk",
        "keywords": null,
        "creator": [
          "Robin Abcarian"
        ],
        "video_url": null,
        "description": "The Supreme Court's mifepristone case comes down to science and the health of women versus rabidly antiabortion hogwash.",
        "content": "Here we go again. On Wednesday, the Supreme Court announced that it will decide whether the Food and Drug Administration has wrongly loosened the rules for abortion pills, which have been used safely for decades and now account for half of all U.S. abortions. The case against the drug, mifepristone, was filed by a group of antiabortion physicians in a Texas federal court whose sole judge, U.S. District Judge Matthew Kacsmaryk , is known for his right-wing, anti-LGBTQ+, antiabortion bent. The physicians could have filed in Maryland, where the FDA is based. They could have filed in any of the blue states where all kinds of abortion are legal. But no. They filed in Amarillo, Texas, where, to no one’s surprise, in April, the physicians won their case. However, around the same time, a federal court in Washington state said exactly the opposite: The FDA had acted properly in 2016 when it extended the time for using mifepristone from seven weeks of pregnancy to 10, and in 2021, when it said that doctors did not have to see patients in person to prescribe the drug, and that it could be dispensed by mail. A few months later, a panel of appellate judges at the ultraconservative 5th Circuit Court of Appeals in New Orleans upheld part of Kacsmaryk’s ruling. The FDA’s original drug approval in 2000 could stand, the panel said, but the later modifications to how the drug could be prescribed and at what point in a pregnancy would be tossed. With conflicting federal court rulings , the Supreme Court has stepped in to break the tie, probably next spring. It’s quite possible that, having roiled the country with its indefensible Dobbs decision overturning Roe vs. Wade and allowing individual states to outlaw abortion, the justices will take a less radical stance this time around. After all, the issue (ostensibly) is not whether abortion should or should not be legal. It’s whether the FDA followed its own rules when it modified how mifepristone can be used and prescribed. The plaintiffs in the case, the Alliance for Hippocratic Medicine, a consortium of Christian, antiabortion medical associations, claim that the FDA has endangered the lives of women and girls by letting “abortionists” give them “dangerous drugs” without proper review or study. Mifepristone, the group claims, helps sex traffickers and sex abusers “to force their victims into getting abortions while preventing the authorities from identifying these victims.” That’s just a smidgen of the complaint’s overheated rhetoric. Now, as we all know, the rules of regulatory agencies are dense thickets of jargon and impenetrable prose. So instead of looking at the FDA’s own rules, I carefully read a friend-of-the-court brief filed by 20 American food and drug law scholars, all of whom have what they describe as “deep expertise in the drug approval process.” They were scathing. The rulings from Kacsmaryk and the 5th Circuit, wrote the scholars, “rest on critical misunderstandings of federal food and drug law, and the underlying regulatory history for mifepristone” and “replace FDA’s scientific and medical expertise with the courts’ own interpretations of scientific evidence.” A decision reversing the FDA’s process on mifepristone, the scholars indicated, would throw the agency and indeed the entire pharmaceutical industry into chaos. The FDA was cautious in approving and modifying rules about mifepristone. For example, contrary to what the antiabortion physicians claimed (and Kacsmaryk parroted), the FDA did examine data about whether mifepristone was associated with anxiety and depression. (It was not.) Another of the abortion opponents’ claims is that the FDA wrongly expedited mifepristone’s original approval in 2000. “In fact,” wrote the scholars, “FDA took far longer than average to approve mifepristone.” The approval process took 54 months, compared with the agency’s average of 18 months for new drugs between 1996 and 2002. And don’t be fooled by assertions that blocking access to mifespristone will keep women and girls safer. The physicians’ case is just one more disingenuous run at outlawing abortion in all 50 states. You must understand one thing above all else: Induced abortion, whether by surgery or medication, is much, much safer than carrying a pregnancy to term and going through childbirth. How much safer? In 2021, according to the Centers for Disease Control and Prevention, the maternal mortality rate was 32.9 per 100,000 live births. The number of women who died that year of “maternal causes,” as the CDC puts it, was 1,205. The number of deaths related to abortions, by contrast, is vanishingly small. In 2019, the last year for which the CDC has information, four women in the U.S. died due to complications from induced abortions. Those years are not anomalies: “Legal induced abortion is markedly safer than childbirth,” wrote physician-researchers Elizabeth Raymond and David Grimes in a 2012 paper published by the journal Obstetrics and Gynecology . “The risk of death associated with childbirth is approximately 14 times higher than that with abortion.” If the Supreme Court cares at all about facts and science underpinning government decision-making and regulations, and if it cares at all about the health and well-being of women and girls — so far, the jury is out on all these counts — it will uphold the FDA’s perfectly legal and sensible rules about abortion drugs, which have been safely used by more than 5 million American women since they were first approved nearly a quarter century ago. @robinkabcarian",
        "pubDate": "2023-12-15 11:00:39",
        "image_url": null,
        "source_id": "latimes",
        "source_priority": 267,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      },
      {
        "article_id": "4b36ffbc37b657d3d0f79055de3b1e24",
        "title": "Joe Biden boldly claims other world leaders urge him to not let Trump win again",
        "link": "https://theindependent.co/joe-biden-world-leaders-urge-him-to-not-let-trump-win/",
        "keywords": [
          "News",
          "politics",
          "US",
          "Joe Biden",
          "Trump win again",
          "world leaders"
        ],
        "creator": [
          "Asir F"
        ],
        "video_url": null,
        "description": "Donald Trump’s potential 2024 bid sets the stage for a heated battle against President Joe... The post Joe Biden boldly claims other world leaders urge him to not let Trump win again appeared first on The Independent News.",
        "content": "Donald Trump’s potential 2024 bid sets the stage for a heated battle against President Joe Biden, barring any legal hiccups. Biden’s global encounters have led many to implore him to block Trump’s return to power. During a Philadelphia fundraiser, the 81-year-old mentioned leaders from various nations fervently urging him against Trump’s victory. PoliticalFlare states, Surging polls favour Trump for the GOP nomination, with a majority of Republican voters backing him. Biden, facing this challenge, attended a fundraising event, emphasising the USA’s global importance and warning of international uproar if Trump returns. Troublingly, recent polls depict Trump neck-and-neck or ahead of Biden, even in critical swing states. The persistence of Trump’s support amid legal turmoil reflects GOP sentiments, indicating a tough battle ahead for Democrats. The Democrats’ lacklustre response raises concerns. Biden’s sporadic appearances demand a more robust campaign trail effort to counter Trump’s momentum. However, on social media, it seems that the support for both nominees are rather solid. The liberal folks and the conservative folks are determined to support their candidate regardless of what is said about either of them. Will Biden win the next election? Strong blue states like Michigan are waning towards the Republican party. One of the reasons why is due to the economy. Many residents feel that they’re not seeing much improvement under his regime. Democrat supporters are finding this to be shocking as Republicans are generally a lot more conservative, which in their eyes, may not be a good thing for women. Unfortunately, those on the centre feel that both candidates are not suitable for America. They feel that this is what a two party political system does to a country and feel that America deserves better. Be that as it may, a two party political system is more stable than having multiple parties trying to govern the country as votes will be split even further and a majority would not be formed easily. Read More News Social media users unhappy with LeBron James not sitting down during American national anthem",
        "pubDate": "2023-12-15 11:00:09",
        "image_url": "https://media.theindependent.co/wp-content/uploads/2023/03/Joe_Biden_official_portrait_2013-e1677892356218.jpg",
        "source_id": "theindependentsg",
        "source_priority": 249045,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      },
      {
        "article_id": "5d45c359082cfc0b64e5a20e05626f72",
        "title": "Inside the Supreme Court’s Dismantling of Roe",
        "link": "https://www.theunionjournal.com/inside-the-supreme-courts-dismantling-of-roe/",
        "keywords": [
          "World",
          "courts",
          "Dismantling",
          "Roe",
          "Supreme"
        ],
        "creator": [
          "Julia Carroll"
        ],
        "video_url": null,
        "description": "“The intention was to underscore the potential threat to the court’s integrity if such a significant personal freedom was overturned, alongside facing resultant turmoil,” commented Nancy Northup, the president of the Center for Reproductive Rights which represented the clinic. The lawyers from the clinic were apprehensive that any dilution involving the viability line could potentially […]",
        "content": "World Inside the Supreme Court’s Dismantling of Roe By Julia Carroll - December 15, 2023 “The intention was to underscore the potential threat to the court’s integrity if such a significant personal freedom was overturned, alongside facing resultant turmoil,” commented Nancy Northup, the president of the Center for Reproductive Rights which represented the clinic. The lawyers from the clinic were apprehensive that any dilution involving the viability line could potentially lead to dissolving of Roe altogether. But protecting Roe wasn’t a straightforward task. Many of those familiar with its legal foundation, rooted in an alleged implicit constitutional right to privacy, have frequently scrutinized it over the years, including liberal thinkers who support the right to abortion based on policy. John Hart Ely penned in The Yale Law Journal in 1973, “It doesn’t constitute constitutional law and barely aims to come close.”. Justice Ginsburg also expressed her reservations about the ruling. During public events, she mentioned that she felt the Supreme Court had acted “too swiftly and too expansively,” and wished the ruling would have rooted in gender-equality grounds. In the oral arguments, some conservative justices showed almost no interest in the course set by the chief. Justice Barrett questioned abortion by suggesting alternatives like adoption. Justice Alito put forward probing questions to Ms. Rikelman regarding the viability standard and history of abortion rights. When she argued that a 15-week limit wouldn’t give women ample time to decide on their pregnancies, Justice Alito brought up a quote from her document. “Your brief claims that ‘there can be no compromise here,’ is this interpretation correct?” He asked. Ms. Rikelman confirmed it was. Later, the justices gathered again for a preliminary vote. Five supported the overturn of Roe, indicating their likely success. The chief seemed to support Mississippi’s 15-week ban, which technically put him in the majority, but he would not extend his support any further. On the contrary, the three liberal justices were in favor of upholding the lower courts’ annulment of the law. Though the chief typically assigns opinions when in the majority, in this case, insiders say it was Justice Thomas, the majority’s senior member, who assigned the opinion to Justice Alito. In his initial draft, Justice Alito stated that both Roe and Casey were not legally sound, asserting that abortion rights have a brief history in the United States and linked abortion to the destruction of an “unborn human being” as termed in the Mississippi law. His next order of business was ensuring the five votes remained intact. Votes within the court are prone to change right up until the announcement of a decision. The swift responses received in February led others in the court to deduce that he had shared the initial draft opinion with his four allies before the entire panel of justices, thereby securing their approval early on. Unraveling Roe: A Look into the Supreme Court’s Approach TAGS courts Dismantling Roe Supreme Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Telegram Previous article Mandy Cohen, New CDC Director, Tries to Foster Trust in a Battered Agency Julia Carroll",
        "pubDate": "2023-12-15 10:55:02",
        "image_url": null,
        "source_id": "theunionjournal",
        "source_priority": 1875007,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      },
      {
        "article_id": "a768594a0a469509c18442a35e5f19db",
        "title": "Mandy Cohen, New CDC Director, Tries to Foster Trust in a Battered Agency",
        "link": "https://www.theunionjournal.com/mandy-cohen-new-cdc-director-tries-to-foster-trust-in-a-battered-agency/",
        "keywords": [
          "World",
          "Agency",
          "Battered",
          "cdc",
          "Cohen",
          "director",
          "foster",
          "Mandy",
          "trust"
        ],
        "creator": [
          "Julia Carroll"
        ],
        "video_url": null,
        "description": "In November, Dr. Mandy K. Cohen, the new director of the Centers for Disease Control and Prevention, visited a Fox affiliate in Dallas soon after the Texas governor signed a law preventing private employers from enforcing Covid-19 vaccinations. Despite the politically charged environment, Dr. Cohen showed no signs of hesitation or concern. “Not only am […]",
        "content": "World Mandy Cohen, New CDC Director, Tries to Foster Trust in a Battered Agency By Julia Carroll - December 15, 2023 In November, Dr. Mandy K. Cohen, the new director of the Centers for Disease Control and Prevention, visited a Fox affiliate in Dallas soon after the Texas governor signed a law preventing private employers from enforcing Covid-19 vaccinations. Despite the politically charged environment, Dr. Cohen showed no signs of hesitation or concern. “Not only am I the C.D.C. director, but I’m also a mother,” she stated, revealing live on television that her 9 and 11-year-old daughters have received their latest Covid and flu vaccinations. She affirmed, “I wouldn’t endorse anything for the American population that I wouldn’t recommend for my own family.” Dr. Cohen has constantly used this down-to-earth approach as she embarks on an arguably impossible mission: reviving faith in public health and in her beleaguered agency amongst a skeptical American public. Irrespective of the pandemic’s official end, Dr. Cohen stands firm on her messaging, five months into her tenure. After the pandemic, the American public’s trust in the agency and science in general suffered a severe blow, especially amongst Republicans. A striking rise in distrust was noted in a Pew Research Center survey, whereby 38% of Republicans expressed little or no confidence in scientists acting in the public’s best interests, a steep increase from 14% in April 2020. Nevertheless, the C.D.C. winter vaccination campaign, sadly, does not appear to be gaining traction. A recent alert warned of potential spikes in severe illnesses and strains on healthcare capacity due to low vaccination rates against the flu, Covid, and respiratory syncytial virus (R.S.V.). Furthermore, political divide over vaccination remains, with only one-quarter of Republicans intending to receive their next Covid shot, compared with seven out of ten Democrats, as per a September KFF poll. Since taking office in July, President Biden’s pick to succeed Dr. Rochelle P. Walensky, Dr. Cohen, has embarked on a countrywide media awareness campaign about vaccination. Her numerous efforts comprise of 19 city visits in 13 states, touring 22 vaccination sites, appearing in dozens of television interviews, including NBC’s “Today” show, and maintaining a social media presence with videos titled “Check-In With Dr. Cohen.” She is seen in the videos, often in the company of county health officials and other health practitioners, spreading awareness and endorsing preventive measures against various diseases. In Dallas and Chicago, she managed to converse with the public about the importance of data in health matters and the significance of vaccination, respectively. While interacting with reporters, Cohen often refers to her family. In an interview with The New York Times, she said, “We are all human beings at the end of the day. If we can engage in a real human dialogue about the safety measures I’d undertake for my kids, perhaps that would connect us in an entirely different manner.” Dr. Cohen has inherited an agency undergoing substantial changes. She is dedicated to implementing the overhaul plans initiated by her predecessor, Dr. Walensky, which involves creating a new analytics center and making necessary structural changes to streamline science-to-policy translation. Despite these lofty ambitions, her allies agree that her most crucial challenge would be to alter the public’s perception of her agency. Megaphone missteps during the pandemic by C.D.C. officials and health leaders significantly hampered trust amongst the public. Brian C. Castrucci, the president of de Beaumont Foundation, a public health nonprofit partnering with strategist Frank Luntz, believed public health officials sowed seeds of mistrust by being over-assertive and flip-flopping on their guidance eventually. According to Luntz, his research suggests a significant subset of the public — about 20-25% — has become detached due to public health officials’ seemingly condescending language towards individuals with genuine misgivings. Based on his surveys, a cheat sheet for communication guidance has been developed to help health officials reach out effectively to individuals of all political ideologies. Dr. Tom Frieden, former C.D.C. director and a participant in the project, appreciates Dr. Cohen’s communication approach. “The ultimate goal is to empower individuals with facts, not scold them into altering their behaviors,” he opines. “Dr. Cohen comprehends this aspect well.” Despite a slight increase in flu hospitalizations compared to the previous year and a relatively low Covid vaccination rate among health care staff, lighter news arrived in the form of a freshly released 77,000 dose batch of a new monoclonal antibody shot to prevent R.S.V. in infants. And with R.S.V. cases in Texas also surging, Dr. Cohen intends to perfect the C.D.C.’s narrative around monitoring vaccine safety in response to mounting public concern regarding vaccination side effects. Dr. Cohen is altering how the C.D.C. communicates about itself. During her first appearance before Congress, she described the agency as a “critical national security asset.” Although, according to M. Anthony Mills, a senior fellow at the conservative American Enterprise Institute, such framing might not resonate with the general public who are suspicious of government agencies like the C.D.C., National Institutes of Health, and the Food and Drug Administration. “For those who suspect that the N.I.H. lied about funding pandemic-causing research, believe the pharmaceutical industry is colluding with the F.D.A., and see public health initiatives as an infringement on their freedom, such concerns largely do not correlate with national security,” he noted. Unlike Dr. Walensky, who had no previous government experience and was known for seeking media training, Dr. Cohen is not a newcomer when it comes to Washington or media attention. She was a high-ranking official at the Centers for Medicare and Medicaid Services during the Obama administration. After which, as the secretary of health and human services in North Carolina, she advocated for the Republican-majority legislature to accept Medicaid expansion and successfully guided the state through the pandemic. Her nomination to these positions was criticized by more than two dozen congressional Republicans, who accused her of politicizing science. Though, Republicans in North Carolina maintain that their relationship with her, while strained at times, was always respectful and professional. One such Republican, Representative Donny Lambeth, the chair of the Health Committee in the North Carolina House of Representatives, said, “She was always cool and composed before us. She was unflappable.” During her congressional testimony last month, she managed to maintain her calm demeanor throughout. Even when Representative Daniel Crenshaw and Jeff Duncan, both Republicans, put her on the spot, Dr. Cohen skillfully navigated the questions. Instead of succumbing to their demands for regrets and mistakes, she remained forward-thinking and optimistic about her new tenure at the C.D.C., affirming, “We’re in a new place and it’s good news.” New CDC Director, Mandy Cohen, Strives to Rebuild Trust in a Troubled Agency TAGS Agency Battered cdc Cohen director foster Mandy trust Facebook Twitter Pinterest WhatsApp Linkedin ReddIt Email Telegram Previous article Florida Law Chills Chinese Student Recruitment Julia Carroll",
        "pubDate": "2023-12-15 10:45:48",
        "image_url": null,
        "source_id": "theunionjournal",
        "source_priority": 1875007,
        "country": [
          "united states of america"
        ],
        "category": [
          "world"
        ],
        "language": "english"
      }
    ],
    "nextPage": "1702637148311290763"
  }